[{"name":"Robin Williams","photos":[{"url":"http://image.tmdb.org/t/p/original/xzM2xrbDJ0r9GZ2407Q6Sx57fuP.jpg"},{"url":"http://image.tmdb.org/t/p/original/lVbK3wy8nguQ78USWvtB4O6Xi92.jpg"},{"url":"http://image.tmdb.org/t/p/original/9QmmscSVCR5pJiUFyjxik5NYhCM.jpg"},{"url":"http://image.tmdb.org/t/p/original/uba0RHOgLKKIZBNmKXn5mIeZnje.jpg"},{"url":"http://image.tmdb.org/t/p/original/xKONcXSOT0Po8UfE3PRvZCQhaDW.jpg"}],"biography":"Robin McLaurim Williams (born July 21, 1951) is an American actor and comedian. Rising to fame with his role as the alien Mork in the TV series Mork and Mindy, and later stand-up comedy work, Williams has performed in many feature films since 1980. He won the Academy Award for Best Supporting Actor for his performance in the 1997 film Good Will Hunting. He has also won two Emmy Awards, four Golden Globes, two Screen Actors Guild Awards and five Grammy Awards.\n\nDescription above from the Wikipedia article Robin Williams, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1951-07-21"},{"name":"George Clooney","photos":[{"url":"http://image.tmdb.org/t/p/original/zOwzwGOZIqL3W80VrwosH4BkoZ6.jpg"},{"url":"http://image.tmdb.org/t/p/original/icvezfts0bw85s9XhDocReXqE6L.jpg"},{"url":"http://image.tmdb.org/t/p/original/z4SBfpKDThuQY0FsvDbajcooBdA.jpg"},{"url":"http://image.tmdb.org/t/p/original/14inS9i4qr0TkZcaDhuYtQBsZiO.jpg"},{"url":"http://image.tmdb.org/t/p/original/exJWy9evctrcftzQLwUbHXYqwTJ.jpg"},{"url":"http://image.tmdb.org/t/p/original/z2FcjLurZbtkuQNqmdOcTgfkk6h.jpg"},{"url":"http://image.tmdb.org/t/p/original/ez6bfLFH5YxdANFM6UTWLyOMRa0.jpg"},{"url":"http://image.tmdb.org/t/p/original/kW1Edf1nGnTDl4bxM9SVqdcvzfb.jpg"},{"url":"http://image.tmdb.org/t/p/original/pXCOnG5rn2uRNwqeGOV30b15tkk.jpg"}],"biography":"Timothy Clooney (born May 6, 1961 height 5' 10¾\" (1,80 m)) is an American actor, film director, producer, and screenwriter. He has received three Golden Globe Awards for his work as an actor and two Academy Awards—one for acting and the other for producing. Clooney is also noted for his political activism and has served as one of the United Nations Messengers of Peace since January 31, 2008.\n\nBorn in Lexington, Kentucky, as son of Nick Clooney, a TV newscaster of many years, who hosted a talk show at Cincinnati and often invited George into the studios already at the age of 5. Avoiding competition with his father, he quit his job as broadcast journalist after a short time.\n\nStudied a few years at Northern Kentucky University. Failed to join the Cincinnati Reds baseball team. He came to acting when his cousin, Miguel Ferrer, got him a small part in a feature film. After that, he moved to L.A. in 1982 and tried a whole year to get a role while he slept in a friend's closet. His first movie, together with Charlie Sheen, stayed unreleased but got him the producers' attention for later contracts.","birthday":"1961-05-06"},{"name":"George Takei","photos":[{"url":"http://image.tmdb.org/t/p/original/yXQsJ0ahBXsbxzJUYjwyCxpJHgp.jpg"},{"url":"http://image.tmdb.org/t/p/original/16BLn6Nm4xasNvHM5koUiMwmAP5.jpg"},{"url":"http://image.tmdb.org/t/p/original/tOvoDiRM6cEVOZlplmOIoQLOxGG.jpg"},{"url":"http://image.tmdb.org/t/p/original/hpU6RxMzK009TeZ5fjkbht0Yko5.jpg"},{"url":"http://image.tmdb.org/t/p/original/xcPENP6CTGSHyNu5e7pu92QMtJn.jpg"}],"biography":"George Hosato Takei Altman (born April 20, 1937) is an American actor of Japanese descent, best known for his role in the television series Star Trek, in which he played Hikaru Sulu, helmsman of the USS Enterprise. He is a proponent of gay rights and active in state and local politics as well as continuing his acting career. He has won several awards and accolades in his work on human rights and Japanese-American relations, including his work with the Japanese American National Museum. Description above from the Wikipedia article George Takei, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1937-04-20"},{"name":"Michael Fassbender","photos":[{"url":"http://image.tmdb.org/t/p/original/ohGJPTlou8TuZ8VOz5m9kChWgts.jpg"},{"url":"http://image.tmdb.org/t/p/original/oexNPLumoFpazzzUqzBSDDYiUg1.jpg"},{"url":"http://image.tmdb.org/t/p/original/hvtyvcLd3hqRiYECH0bP9IJXCX2.jpg"},{"url":"http://image.tmdb.org/t/p/original/k2YSI7hxWlRs53iKCVcdJEnH3Br.jpg"},{"url":"http://image.tmdb.org/t/p/original/r6dxyfjbpOw4CG2feUhlUOLynUs.jpg"},{"url":"http://image.tmdb.org/t/p/original/lgSnb51BahIWPr3xsUwtUro117u.jpg"},{"url":"http://image.tmdb.org/t/p/original/5ncFkzuUURfWHIMQOZ6LQ7PtgRK.jpg"},{"url":"http://image.tmdb.org/t/p/original/qhxhmc2fmnc0ou9kRWCOUwhrmsU.jpg"},{"url":"http://image.tmdb.org/t/p/original/sbxCV4a4J8FhHeh1Z1roAb4On7Q.jpg"},{"url":"http://image.tmdb.org/t/p/original/7cRUq8PVhoRqaoy9ftB8qId0cMs.jpg"},{"url":"http://image.tmdb.org/t/p/original/kR9MkrOUarKRs8BSrS3joMtURKX.jpg"},{"url":"http://image.tmdb.org/t/p/original/yoWnyL5ssizKlb8msqtl9Nlli7O.jpg"},{"url":"http://image.tmdb.org/t/p/original/f4v9WXBNj0FGBREKiF3SxbpuuUV.jpg"}],"biography":"Michael Fassbender (born 2 April 1977) is a German-born Irish actor. He played Lt. Archie Hicox in Quentin Tarantino's Inglourious Basterds. His other credits include Jane Eyre, the Sky One television series Hex, the HBO miniseries Band of Brothers, Zack Snyder's 300, and the 2008 BAFTA-winning film Hunger. In June 2011, Fassbender will play a young Magneto in the upcoming superhero film, X-Men: First Class.\n\nDescription above from the Wikipedia article Michael Fassbender, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1977-04-02"},{"name":"Nicola Peltz","photos":[{"url":"http://image.tmdb.org/t/p/original/vDfgwMqFNDOO7C4EkV2JEWOPkTH.jpg"},{"url":"http://image.tmdb.org/t/p/original/7SSsn7GNhr3odPLR9nIz5NMmDgD.jpg"},{"url":"http://image.tmdb.org/t/p/original/ywS7lEeN6kbZCOUH3U2Rxiw1DFc.jpg"},{"url":"http://image.tmdb.org/t/p/original/iovDvmRqQPYCbQ8XYaJstp1TcXc.jpg"}],"biography":"From Wikipedia, the free encyclopedia\n\nNicola Peltz is an American actress. Perhaps her most notable role to date is Katara in the 2010 film The Last Airbender, directed by M. Night Shyamalan.\n\nDescription above from the Wikipedia article Nicola Peltz, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1995-01-09"},{"name":"Scarlett Johansson","photos":[{"url":"http://image.tmdb.org/t/p/original/cmvo9gzikPJ3LV6GxWQmZAg2Nct.jpg"},{"url":"http://image.tmdb.org/t/p/original/tHMgW7Pg0Fg6HmB8Kh8Ixk6yxZw.jpg"},{"url":"http://image.tmdb.org/t/p/original/8EueDe6rPF0jQU4LSpsH2Rmrqac.jpg"},{"url":"http://image.tmdb.org/t/p/original/yDYpYy09nfyXIWHC6mbsaRdLiDV.jpg"},{"url":"http://image.tmdb.org/t/p/original/aPTNNvUDW6VJeE269RVInmNlhia.jpg"},{"url":"http://image.tmdb.org/t/p/original/juQRh5xeyA3yv3REKnT2YKEcni6.jpg"},{"url":"http://image.tmdb.org/t/p/original/uNxd4VL7OXtudqc50yWUWlMuAdh.jpg"},{"url":"http://image.tmdb.org/t/p/original/lrkMapc1t86otevADCAGEUg6qds.jpg"},{"url":"http://image.tmdb.org/t/p/original/6rzF7EuwSBoAbBlW2W2nugadnD8.jpg"},{"url":"http://image.tmdb.org/t/p/original/pYy7sWxYG3s9QnjLPNk5aFtdHjc.jpg"},{"url":"http://image.tmdb.org/t/p/original/t4igqs3L3LD5cSxv1eOk1mYAlb3.jpg"},{"url":"http://image.tmdb.org/t/p/original/pLerxNLxuq4oEU5d8NRey85etFa.jpg"},{"url":"http://image.tmdb.org/t/p/original/1IsROboT8utZxUGrdNZWuX7KoNv.jpg"},{"url":"http://image.tmdb.org/t/p/original/8DIin5K9Bc1ilPRSsAAZ4yCrjpg.jpg"},{"url":"http://image.tmdb.org/t/p/original/hNY0JtTOri1vtPTf9mAkGhlTJ5y.jpg"},{"url":"http://image.tmdb.org/t/p/original/3mGM8Vycmin9rSCeqbBeos4VsSS.jpg"},{"url":"http://image.tmdb.org/t/p/original/jYeB9FGINhAb0FoLBM7heVnKP1Y.jpg"},{"url":"http://image.tmdb.org/t/p/original/dokrAxkB2hBldtBzvwW80T0TXGF.jpg"}],"biography":"Scarlett Johansson, born November 22, 1984, height 5' 3\" (1,60 m)) is an American actress, model and singer. She made her film debut in North (1994) and was later nominated for the Independent Spirit Award for Best Female Lead for her performance in Manny &amp; Lo (1996), garnering further acclaim and prominence with roles in The Horse Whisperer (1998) and Ghost World (2001). She shifted to adult roles with her performances in Girl with a Pearl Earring (2003) and Sofia Coppola's Lost in Translation (2003), for which she won a BAFTA award for Best Actress in a Leading Role; both films earned her Golden Globe Award nominations as well.\n\nA role in A Love Song for Bobby Long (2004) earned Johansson her third Golden Globe for Best Actress nomination. Johansson garnered another Golden Globe nomination for Best Supporting Actress with her role in Woody Allen's Match Point (2005). She has played the Marvel comic book character Black Widow/Natasha Romanoff in Iron Man 2 (2010), The Avengers (2012), and Captain America: The Winter Soldier (2014) and is set to reprise the role in Avengers: Age of Ultron (2015). The 2010 Broadway revival of Arthur Miller's A View From the Bridge won Johansson the Tony Award for Best Performance by a Featured Actress in a Play. As a singer, Johansson has released two albums, Anywhere I Lay My Head and Break Up.\n\nJohansson is considered one of Hollywood's modern sex symbols, and has frequently appeared in published lists of the sexiest women in the world, most notably when she was named the \"Sexiest Woman Alive\" by Esquire magazine in both 2006 and 2013 (the only woman to be chosen for the title twice), and the \"Sexiest Celebrity\" by Playboy magazine in 2007.\n\nJohansson was born in New York City. Her father, Karsten Johansson, is a Danish-born architect, and her paternal grandfather, Ejner Johansson, was a screenwriter and director. Her mother, Melanie Sloan, a producer, comes from an Ashkenazi Jewish family from the Bronx. Johansson has an older sister, Vanessa, who is an actress; an older brother, Adrian; a twin brother, Hunter (who appeared in the film Manny &amp; Lo with Scarlett); and a half-brother, Christian, from her father's re-marriage.","birthday":"1984-11-22"},{"name":"Tom Hanks","photos":[{"url":"http://image.tmdb.org/t/p/original/xxPMucou2wRDxLrud8i2D4dsywh.jpg"},{"url":"http://image.tmdb.org/t/p/original/zLDjweF7EvnPGbgnYHrNBlVlNhg.jpg"},{"url":"http://image.tmdb.org/t/p/original/6fh0wdPgV0rlIvLgfrxXJMsXq3u.jpg"},{"url":"http://image.tmdb.org/t/p/original/a14CNByTYALAPSGlwlmfHILpEIW.jpg"},{"url":"http://image.tmdb.org/t/p/original/1TGabQuX8wlHFNTxFijX2hweNNR.jpg"},{"url":"http://image.tmdb.org/t/p/original/4GQhsq83mfsGsLXdRsYZIrA694g.jpg"},{"url":"http://image.tmdb.org/t/p/original/7D7EFDZ1eAntIuIhtoH7qlT5ypl.jpg"},{"url":"http://image.tmdb.org/t/p/original/sFnnr2lTATGBK28nPz8CUHEyfK2.jpg"}],"biography":"Thomas Jeffrey \"Tom\" Hanks (born July 9, 1956, height 6' (1,83 m)) is an American actor, producer, writer and director.\n\nHanks worked in television and family-friendly comedies, gaining wide notice in 1988's Big, before achieving success as a dramatic actor in several notable roles, including Andrew Beckett in Philadelphia, the title role in Forrest Gump, Commander James A. Lovell in Apollo 13, Captain John H. Miller in Saving Private Ryan, Joe Fox in You've Got Mail and Chuck Noland in Cast Away. Hanks won consecutive Best Actor Academy Awards, in 1993 for Philadelphia and in 1994 for Forrest Gump. U.S. domestic box office totals for his films exceed $3.9 billion.","birthday":"1956-07-09"},{"name":"Tom Cruise","photos":[{"url":"http://image.tmdb.org/t/p/original/3oWEuo0e8Nx8JvkqYCDec2iMY6K.jpg"},{"url":"http://image.tmdb.org/t/p/original/fttvtGtgjPjoKEqGtnebbwEkVNA.jpg"},{"url":"http://image.tmdb.org/t/p/original/hIVsySa8Ro6vrQ0hygIF6ylBgK7.jpg"},{"url":"http://image.tmdb.org/t/p/original/nPGebm4wxlLThpEEjTKthjoHMbM.jpg"}],"biography":"Thomas Cruise Mapother IV, born on July 3, 1962, better known by his screen name of Tom Cruise, is an American film actor and producer. He has been nominated for three Academy Awards and won three Golden Globe Awards.\n\nHis first leading role was the 1983 film Risky Business, which has been described as \"A Generation X classic, and a career-maker\" for the actor. After playing the role of a heroic naval pilot in the popular and financially successful 1986 film Top Gun, Cruise continued in this vein, playing a secret agent in a series of Mission: Impossible action films in the 1990s and 2000s. In addition to these heroic roles, he has starred in a variety of other successful films such as Days of Thunder (1990), Jerry Maguire (1996), Magnolia (1999), Vanilla Sky (2001), Minority Report (2002), The Last Samurai (2003), Collateral (2004) and War of the Worlds (2005). In 2005, the Hollywood journalist, Edward Jay Epstein argued that Cruise is one of the few producers (the others being George Lucas, Steven Spielberg and Jerry Bruckheimer) who are able to guarantee the success of a billion-dollar movie franchise.\n\nSince 2005, Cruise and Paula Wagner have been in charge of the United Artists film studio, with Cruise as producer and star and Wagner as the chief executive. Cruise is also known for his controversial support of and adherence to the Church of Scientology.\n\nCruise married Mimi Rogers on May 9, 1987; they divorced on February 4, 1990. Rogers is generally believed to have introduced Cruise to Scientology. Cruise met Nicole Kidman on the set of their film Days of Thunder. The couple married on December 24, 1990. He and Kidman adopted two children, Isabella Jane and Connor Antony. They separated in February 2001. Cruise was next romantically linked with Penélope Cruz, the lead actress in his film Vanilla Sky. After a three-year relationship, Cruise announced that their relationship had ended in January. In April 2005, Cruise began dating actress Katie Holmes. Shortly after they began their highly publicized relationship, on June 17, 2005, Cruise announced he had proposed to her at the top of the Eiffel Tower in Paris. On April 18, 2006, Holmes gave birth to a baby girl named Suri at Saint John's Health Center in Santa Monica, California. Cruise stated that the name derives from the Hebrew word for \"princess\" or the Persian word meaning red rose. She is the first biological child for both Holmes and Cruise. On November 18, 2006, Holmes and Cruise were married at the 15th-century Odescalchi Castle in Bracciano, Italy, in a Scientology ceremony attended by many Hollywood stars. Cruise owns a home in Murrieta, California.","birthday":"1962-07-03"},{"name":"Dwayne Johnson","photos":[{"url":"http://image.tmdb.org/t/p/original/n432vxKiMpgdCmOjq7UX6Gatisa.jpg"},{"url":"http://image.tmdb.org/t/p/original/gQIWcpYo2W4MHw8UhTP2cW0jojF.jpg"},{"url":"http://image.tmdb.org/t/p/original/7NtsQKKXWz6UI61XtOwyq84AOms.jpg"},{"url":"http://image.tmdb.org/t/p/original/2GNFwpMG7gqEf6svHGcRS5acud5.jpg"},{"url":"http://image.tmdb.org/t/p/original/51mFgfOelhiAdNmFKL0dHOJizyb.jpg"}],"biography":"Dwayne Douglas Johnson also known by his ring name The Rock, is an American actor and professional wrestler, who as of 2011 is signed with World Wrestling Entertainment. He is occasionally credited as Dwayne \"The Rock\" Johnson.\n\nJohnson was a college football player and, in 1991, he was part of the University of Miami's national championship team. He later played for the Calgary Stampeders in the Canadian Football League, but was cut two months into the season. This led to his decision to become a professional wrestler like his grandfather, Peter Maivia, and his father, Rocky Johnson. He gained mainstream fame as a wrestler in World Wrestling Entertainment (WWE), originally known as the World Wrestling Federation (WWF), from 1996 to 2004, and was the first third-generation superstar in the company's history. Johnson was quickly given a push in the WWF, first as \"Rocky Maivia\", and then as \"The Rock\", a member of the Nation of Domination. Two years after he joined the WWF, Johnson won the WWF Championship, and became one of the most popular wrestlers within the company's history for his engaging interviews and promos.\n\nIn 2001, he began acting and occasionally returned to the ring. His primary focus, as of 2011, is his acting career. Johnson's first leading role as an actor was in The Scorpion King in 2002. For this film, he received the highest salary for an actor in his first starring role, earning $5.5 million. He has since appeared in movies such as The Rundown, Be Cool, Walking Tall, Gridiron Gang, The Game Plan, Get Smart, Race to Witch Mountain, Planet 51, Tooth Fairy, Doom, Why Did I Get Married Too?, The Other Guys, and Faster.","birthday":"1972-05-02"},{"name":"Jane Lynch","photos":[{"url":"http://image.tmdb.org/t/p/original/2VpBBY7qFGomxEg7oqw5Gt3HD30.jpg"},{"url":"http://image.tmdb.org/t/p/original/lCVWWTIrKVXYGZ2vIzjoEAecgpm.jpg"},{"url":"http://image.tmdb.org/t/p/original/e1FKDcj4VYLfzyGZ7LTiHhX7p4o.jpg"},{"url":"http://image.tmdb.org/t/p/original/v9erJO3FcRNuE8stK2UZEx0rMfh.jpg"},{"url":"http://image.tmdb.org/t/p/original/4pSHbUxQF6lqWeqLO6mzu3yDWbO.jpg"},{"url":"http://image.tmdb.org/t/p/original/e1FKDcj4VYLfzyGZ7LTiHhX7p4o.jpg"},{"url":"http://image.tmdb.org/t/p/original/fstzXyxBm7eqQIQhErmYYfrDbVq.jpg"},{"url":"http://image.tmdb.org/t/p/original/mTooQJKzKKydUXvcpq7d2RmkNvv.jpg"}],"biography":"Jane Marie Lynch (born July 14, 1960) is an American comedian, actress and singer. Since 2009, she has played the role of Sue Sylvester in the Fox musical-comedy series Glee for which she has won an Emmy Award and a Golden Globe Award. She has also played roles in comedies such as Best in Show, The 40-Year-Old Virgin and Role Models, as well as for her recurring roles as lawyer Joyce Wischina in The L Word, Dr. Linda Freeman, Charlie's sarcastic therapist on Two and a Half Men and as Spencer Reid's mother, Dr. Diana Reid on Criminal Minds. She has appeared on iCarly as Sam's mother. She was also a regular on the comedy-drama series Party Down as Constance Carmell; the role garnered her positive critical response.  Description above from the Wikipedia article Jane Lynch, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1960-07-14"},{"name":"Hugh Jackman","photos":[{"url":"http://image.tmdb.org/t/p/original/wnl7esRbP3paALKn4bCr0k8qaFu.jpg"},{"url":"http://image.tmdb.org/t/p/original/kryVmcqybc6ebxfM3K9kutvjWM1.jpg"},{"url":"http://image.tmdb.org/t/p/original/7nIyQu8fJTcKN40idTKajIxQo2x.jpg"},{"url":"http://image.tmdb.org/t/p/original/zMy31K62BFQlIKqFqLeA6NTBef3.jpg"},{"url":"http://image.tmdb.org/t/p/original/B5cSiN5beek3VIOjyLJGE5Pt1V.jpg"},{"url":"http://image.tmdb.org/t/p/original/A4KiXW40T57k0vbiR24OG6ZU8aR.jpg"},{"url":"http://image.tmdb.org/t/p/original/tIA5P5LS7E48zDiJsjE84Kb32p1.jpg"},{"url":"http://image.tmdb.org/t/p/original/a1eiarHDiSyyBTAnfvCoTGpyK4R.jpg"}],"biography":"Hugh Michael Jackman (born 12 October 1968) is an Australian actor and producer who is involved in film, musical theatre, and television. Jackman has won international recognition for his roles in major films, notably as action/superhero, period and romance characters.\n\nHe is known for his role as Wolverine in the X-Men series, as well as for his leads in Kate &amp; Leopold, Van Helsing, The Prestige, and Australia. Jackman is a singer, dancer, and actor in stage musicals, and won a Tony Award for his role in The Boy from Oz. In November 2008, Open Salon named Jackman one of the sexiest men alive. Later that same month, People magazine named Jackman \"Sexiest Man Alive.” A three-time host of the Tony Awards, winning an Emmy Award for one of these appearances, Jackman also hosted the 81st Academy Awards on 22 February 2009. Description above from the Wikipedia article Hugh Jackman , licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1968-10-12"},{"name":"Mark Hamill","photos":[{"url":"http://image.tmdb.org/t/p/original/klQrOckrIuUluOEp7g0osOfTgWI.jpg"},{"url":"http://image.tmdb.org/t/p/original/wnRFmHkowKs58MIqJP10owkipo3.jpg"},{"url":"http://image.tmdb.org/t/p/original/zUXHs0t0rhRNg7rD1pQm09KXAKP.jpg"},{"url":"http://image.tmdb.org/t/p/original/sA0kCclNWaWs1KjIm2XyyTGiNLk.jpg"},{"url":"http://image.tmdb.org/t/p/original/4EUWV8KW5UHbCvzQeOjPkSMJob3.jpg"},{"url":"http://image.tmdb.org/t/p/original/a85lLkADqD2Ab03cfMyJVQaE1UR.jpg"},{"url":"http://image.tmdb.org/t/p/original/bZbOmlwhOGVowB3MDqZyvfT9ZQT.jpg"},{"url":"http://image.tmdb.org/t/p/original/3I9loGcjEFSEbD7zH02jMBhg7JC.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nMark Richard Hamill (born September 25, 1951) is an American actor, voice artist, producer, director, and writer. Hamill is best known for his role as Luke Skywalker in the original Star Wars trilogy and also well known for voice-acting characters such as the Joker in various animated series, animated films and video games, beginning with Batman: The Animated Series, the Skeleton king in Super Robot Monkey Team Hyperforce Go!, Fire Lord Ozai in Avatar: The Last Airbender, Master Eraqus in Kingdom Hearts: Birth by Sleep, Skips in Regular Show, and Senator Stampington on Metalocalypse.\n\nDescription above from the Wikipedia article Mark Hamill, licensed under CC-BY-SA, full list of contributors on Wikipedia .","birthday":"1951-09-25"},{"name":"Paul Walker","photos":[{"url":"http://image.tmdb.org/t/p/original/iqvYezRoEY5k8wnlfHriHQfl5dX.jpg"},{"url":"http://image.tmdb.org/t/p/original/uBVONfPHpc2ZYxGpPi99CauRnhr.jpg"},{"url":"http://image.tmdb.org/t/p/original/l5aLYPSKDNmGPSCcehLZMbKEy3b.jpg"},{"url":"http://image.tmdb.org/t/p/original/lSObsJjnOM09NLFDEJXEcB3f1to.jpg"},{"url":"http://image.tmdb.org/t/p/original/uwHlQzxH216ubixgehkOBXZ3c46.jpg"},{"url":"http://image.tmdb.org/t/p/original/14fElACZcB7nOeSnXwKDhrPDOfx.jpg"},{"url":"http://image.tmdb.org/t/p/original/gbsSRN7wHBzmOCWZK6zjBE70nnE.jpg"}],"biography":"Paul William Walker IV (September 12, 1973 – November 30, 2013) was an American actor. He became well known in 1999 after his role in the hit film Varsity Blues. However, he was perhaps best known for starring as Brian O'Conner in The Fast and the Furious film series. His other films include Eight Below, Into the Blue, She's All That and Takers.","birthday":"1973-09-12"},{"name":"Milla Jovovich","photos":[{"url":"http://image.tmdb.org/t/p/original/mcNgLarIVho7LheWcvd1oQ2tBOg.jpg"},{"url":"http://image.tmdb.org/t/p/original/hSoAUlUha39LjjMVp73QEJ4zc2t.jpg"},{"url":"http://image.tmdb.org/t/p/original/nLsQCSxkYiPBVRvN5xf1K8LhKgG.jpg"},{"url":"http://image.tmdb.org/t/p/original/iheicTpIVWVkMFDRClsTmA8vaZU.jpg"},{"url":"http://image.tmdb.org/t/p/original/eqy16QQulZkPYzr0PrSgiPpka8x.jpg"},{"url":"http://image.tmdb.org/t/p/original/kpaxJsj6b0iUo9TSqZqq5pc8OxF.jpg"},{"url":"http://image.tmdb.org/t/p/original/oLW2PLhu5xb1SkbK6HLrzyAFE3h.jpg"},{"url":"http://image.tmdb.org/t/p/original/cslBIS8hps20mC2f0OV6Ov3LHXr.jpg"},{"url":"http://image.tmdb.org/t/p/original/n8Kb0NNKpB9FB6jbYrRHeNTSgDD.jpg"},{"url":"http://image.tmdb.org/t/p/original/jF6UfsniDK5KgKLzvj1K7EUsVQ2.jpg"},{"url":"http://image.tmdb.org/t/p/original/fBZaIokT9Ej09TpNs80GMvDPckX.jpg"}],"biography":"Milla Jovovich, born as Milica Natasha Jovovich, is an Ukrainian-born actress, an American supermodel, musician, and fashion designer.\n\nOver her career, she has appeared in a number of science fiction and action themed films, for which music channel VH1 has referred to her as the \"reigning queen of kick-butt\". Born on 17th December, 1975, Milla has appeared on the cover of more than a hundred magazines, and has also starred in films such as The Fifth Element (1997), Ultraviolet (2006), and the 'Resident Evil' franchise.\n\nJovovich began modeling at eleven, when Richard Avedon featured her in Revlon's \"Most Unforgettable Women in the World\" advertisements, and she continued her career with other campaigns for L'Oréal cosmetics, Banana Republic, Christian Dior, Donna Karan, and Versace. In 1988, she had her first professional acting role in the television film The Night Train to Kathmandu, and later that year she appeared in her first feature film, Two Moon Junction.\n\nFollowing more small television appearances such as the \"Fair Exchange\" (1989) and a 1989 role as a French girl (she was 14 at the time then) on a Married with Children episode and film roles, she gained notoriety with the romance film Return to the Blue Lagoon (1991). She appeared in 1993's Dazed and Confused alongside Ben Affleck and Matthew McConaughey. Jovovich then acted alongside Bruce Willis in the science fiction film The Fifth Element (1997), and later played the title role in The Messenger: The Story of Joan of Arc (1999). In 2002, she starred in the video game adaptation Resident Evil, which spawned three sequels: Resident Evil: Apocalypse (2004), Resident Evil: Extinction (2007) and Resident Evil: Afterlife (2010).\n\nIn addition to her modelling and acting career, Jovovich released a music album, The Divine Comedy in 1994. She continues to release demos for other songs on her official website and contributes to film soundtracks as well; Jovovich has yet to release another album. In 2003, she and model Carmen Hawk created the clothing line Jovovich-Hawk, which ceased operations in early 2008. In its third season prior to its demise, the pieces could be found at Fred Segal in Los Angeles, Harvey Nichols, and over 50 stores around the world.","birthday":"1975-12-17"},{"name":"Will Smith","photos":[{"url":"http://image.tmdb.org/t/p/original/yTMJPPVHZ6P2zXQOg2pMRDBbfEf.jpg"},{"url":"http://image.tmdb.org/t/p/original/u8mGdQ5Ft8r7x8bDqnUAotxsWjm.jpg"},{"url":"http://image.tmdb.org/t/p/original/5V4OKHQpIEffF9rqgzGYK4TNaGg.jpg"},{"url":"http://image.tmdb.org/t/p/original/9vNM61Qjf3vwqFERUVzKdckyQFJ.jpg"}],"biography":"Willard Christopher \"Will\" Smith, Jr. (born September 25, 1968) is an American actor, film producer and pop rapper. He has enjoyed success in music, television and film. In April 2007, Newsweek called him the most powerful actor on the planet. Smith has been nominated for four Golden Globe Awards, two Academy Awards, and has won multiple Grammy Awards. In the late 1980s, Smith achieved modest fame as a rapper under the name The Fresh Prince. In 1990, his popularity increased dramatically when he starred in the popular television series The Fresh Prince of Bel-Air. The show ran for nearly six years (1990–1996) on NBC and has been syndicated consistently on various networks since then. In the mid-1990s, Smith transitioned from television to film, and ultimately starred in numerous blockbuster films that received broad box office success. In fact, he is the only actor in history to have eight consecutive films gross over $100 million in the domestic box office as well as being the only actor to have eight consecutive films in which he starred open at the #1 spot in the domestic box office tally.\n\nFourteen of the 19 fiction films he has acted in have accumulated worldwide gross earnings of over $100 million, and 4 of them took in over $500 million in global box office receipts. His most financially successful films have been Bad Boys, Bad Boys II, Independence Day, Men in Black, Men in Black II, I, Robot, The Pursuit of Happyness, I Am Legend, Hancock, Wild Wild West, Enemy of the State, Shark Tale, Hitch, and Seven Pounds. He also earned critical praise for his performances in Six Degrees of Separation, Ali, and The Pursuit of Happyness, receiving Best Actor Oscar nominations for the latter two. From Wikipedia, the free encyclopedia.","birthday":"1968-09-25"},{"name":"Mark Wahlberg","photos":[{"url":"http://image.tmdb.org/t/p/original/eGHgl0sRg0ecKuAiHKehPUnY1lL.jpg"},{"url":"http://image.tmdb.org/t/p/original/z2wJh5n7qZRUE1y9uB8UrivAV2b.jpg"},{"url":"http://image.tmdb.org/t/p/original/rT1Lo9rfGhWnsb2W2WQKiZnWGMd.jpg"},{"url":"http://image.tmdb.org/t/p/original/fZIn6FllBXeG08vY7oE55l5eW7g.jpg"},{"url":"http://image.tmdb.org/t/p/original/v8cRuuEKQUViuMAKhyk8090aXeW.jpg"},{"url":"http://image.tmdb.org/t/p/original/bLU9qUZ3XSitjfJLU0jdN8RBm1r.jpg"},{"url":"http://image.tmdb.org/t/p/original/fo4MlZUIsRnDAeb8Zj9VGnwj9Wa.jpg"}],"biography":"Mark Robert Michael Wahlberg (born June 5, 1971) is an American actor, film and television producer, and former rapper. He was known as Marky Mark in his earlier years, and became famous for his 1991 debut as a musician with the band Marky Mark and the Funky Bunch. He was named No.1 on VH1's 40 Hottest Hotties of the 90's. He is well known for his roles in films such as Boogie Nights (1997), Three Kings (1999), The Perfect Storm (2000), Planet of the Apes (2001), The Italian Job (2003), I Heart Huckabees (2004), Four Brothers (2005), The Departed (2006), Invincible (2006), Shooter (2007), and The Fighter (2010). He has also served as the executive producer of the TV series Entourage and Boardwalk Empire.  Description above from the Wikipedia article Mark Wahlberg, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1971-06-05"},{"name":"Ali Larter","photos":[{"url":"http://image.tmdb.org/t/p/original/4MVvnnOcZYb7rxfZQnK2EPDhokW.jpg"},{"url":"http://image.tmdb.org/t/p/original/hiijAuw0BddA5gT9dJdKy4riUuO.jpg"},{"url":"http://image.tmdb.org/t/p/original/nSqdv59lTcSmrwCClxcS8D52flz.jpg"},{"url":"http://image.tmdb.org/t/p/original/kvaR1zBhxSZ4kymp5h53LwcbpmB.jpg"},{"url":"http://image.tmdb.org/t/p/original/q8YWUyLxKSn6q96gHdydL9qybT.jpg"},{"url":"http://image.tmdb.org/t/p/original/x4XRJ1L8Tti3z9L6A06AmkSiIyJ.jpg"},{"url":"http://image.tmdb.org/t/p/original/wWJJdQahxBcCQsPC3AOrXx08NGk.jpg"},{"url":"http://image.tmdb.org/t/p/original/lPimzgdMzWOv8HLcZOeLMoKyZoo.jpg"}],"biography":"Alison Elizabeth \"Ali\" Larter (born February 28, 1976) is an American actress best known for playing the dual roles of Niki Sanders and Tracy Strauss on the NBC science fiction drama Heroes.\n\nShe also appeared in guest roles on several television shows in the 1990s. Her screen debut came in the 1999 film Varsity Blues, followed by the horror films House on Haunted Hill and Final Destination. Major supporting roles in the comedy Legally Blonde and the romantic comedy A Lot Like Love led her to lead roles as the titular character in the Bollywood film Marigold and in the 2009 thriller Obsessed. Larter achieved wider fame after her portrayal of video game heroine Claire Redfield in the successful films, Resident Evil: Extinction and Resident Evil: Afterlife. Larter frequently appears in \"Hot\" lists compiled by Maxim, FHM and Stuff as well as People magazine's \"Best Dressed List\" in 2007. After a three year relationship, Larter married actor Hayes MacArthur in a small ceremony in Maine in August 2009. The couple have a son, born December 2010.\n\nDescription above from the Wikipedia article Ali Larter, licensed under CC-BY-SA, full list of contributors on Wikipedia​","birthday":"1976-02-28"},{"name":"Sienna Guillory","photos":[{"url":"http://image.tmdb.org/t/p/original/pWyLeJCldGteBbSu9FhC0ef5LZx.jpg"},{"url":"http://image.tmdb.org/t/p/original/aNTDD2tVe8iv9kUY5dt2PtpYzTz.jpg"},{"url":"http://image.tmdb.org/t/p/original/1yuXUT6ZgLnxf2BcT9QEY0NqWJJ.jpg"},{"url":"http://image.tmdb.org/t/p/original/cOhO03iOpA65c4evdyFU52xXmNi.jpg"},{"url":"http://image.tmdb.org/t/p/original/4IrUMPn4VMCAvAA2hZWYcXHkC3y.jpg"},{"url":"http://image.tmdb.org/t/p/original/dbEbBI77MgQrlrGTjyZ7WktPT9d.jpg"},{"url":"http://image.tmdb.org/t/p/original/kJIEXnQxa7VmmnPZK5MDKT0srQQ.jpg"}],"biography":"Sienna Tiggy Guillory (born 16 March 1975) is an English actress, and a former model. She is well known for playing the title role in the TV miniseries, Helen of Troy. She is also well known for her portrayal of Jill Valentine in the science fiction action horror film Resident Evil: Apocalypse and as elf princess Arya Dröttningu in fantasy-adventure film, Eragon, based on the novel by Christopher Paolini. She resumed her role as Jill Valentine in the action horror film Resident Evil: Afterlife in 2010, and continues to resume her role in Resident Evil: Retribution scheduled for release September 14, 2012.\n\nDescription above from the Wikipedia article Sienna Guillory, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1975-03-16"},{"name":"Kiefer Sutherland","photos":[{"url":"http://image.tmdb.org/t/p/original/4YvDfOfD4TgyzDkLGoq76g5BZNe.jpg"},{"url":"http://image.tmdb.org/t/p/original/89wapFR2QC5SlhESOTJW16NLbvw.jpg"}],"biography":"Kiefer Sutherland  (born 21 December 1966) is a British-Canadian actor, producer and director, best known for his portrayal of Jack Bauer on the Fox thriller drama series 24. He has won an Emmy Award and Golden Globe award. He is the son of Canadian actors Donald Sutherland and Shirley Douglas.\n\nDescription above from the Wikipedia article Kiefer Sutherland, licensed under CC-BY-SA, full list of contributors on Wikipedia","birthday":"1966-12-21"},{"name":"Ann-Margret","photos":[{"url":"http://image.tmdb.org/t/p/original/i60AiHzZGTjr3Bq4dv6vXC8kzyi.jpg"},{"url":"http://image.tmdb.org/t/p/original/jZOSZRilobrFfFv0rrCR0GYRtSr.jpg"}],"biography":"From Wikipedia, the free encyclopedia  \n  Ann-Margret Olsson (born April 28, 1941) is a Swedish-American actress, singer and dancer whose professional name is Ann-Margret. She is best known for her roles in Bye Bye Birdie (1963), Viva Las Vegas (1964), The Cincinnati Kid (1965), Carnal Knowledge (1971), and Tommy (1975). She has won five Golden Globe Awards and been nominated for two Academy Awards, two Grammy Awards, a Screen Actors Guild Award, and six Emmy Awards. On August 21, 2010, she won her first Emmy Award for her guest appearance on Law & Order: SVU.  \n  Description above from the Wikipedia article Ann-Margret, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1941-04-28"},{"name":"Julianne Moore","photos":[{"url":"http://image.tmdb.org/t/p/original/5TP6PXUMfVlckGfDAmAk8ijVpLX.jpg"},{"url":"http://image.tmdb.org/t/p/original/kpofZuESpi3HHtUq80FxuQ4Uhuf.jpg"},{"url":"http://image.tmdb.org/t/p/original/AkY8Dm85fDrG6Q6XSfK6e3USvox.jpg"},{"url":"http://image.tmdb.org/t/p/original/lCz8xI1O5KOwCTbGo660jSM7lgb.jpg"},{"url":"http://image.tmdb.org/t/p/original/pucBu6ezfmgq1VBUkw2KNiLSGGt.jpg"},{"url":"http://image.tmdb.org/t/p/original/oh4EPRFOkU2gSKqqR3EXh79vWBP.jpg"}],"biography":"Julianne Moore (born Julie Anne Smith; December 3, 1960) is an American actress and a children's book author. Throughout her career she has been nominated for four Oscars, six Golden Globes, three BAFTAs and nine Screen Actors Guild Awards.  Moore began her acting career in 1983 in minor roles, before joining the cast of the soap opera As the World Turns, for which she won a Daytime Emmy Award in 1988. She began to appear in supporting roles in films during the early 1990s, in films such as The Hand That Rocks the Cradle and The Fugitive. Her performance in Short Cuts (1993) won her and the rest of the cast a Golden Globe for their ensemble performance, and her performance in Boogie Nights (1997) brought her widespread attention and nominations for several major acting awards.\n\nHer success continued with films such as The Big Lebowski (1998), The End of the Affair (1999) and Magnolia (1999). She was acclaimed for her portrayal of a betrayed wife in Far from Heaven (2002), winning several critic awards as best actress of the year, in addition to several other nominations, including the Academy Award, Golden Globe, and Screen Actors Guild Award. The same year she was also nominated for several awards as best supporting actress for her work in The Hours. In 2010 Moore starred in the comedy drama The Kids Are All Right, for which she received a Golden Globe and BAFTA nomination.\n\nDescription above from the Wikipedia article Julianne Moore, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1960-12-03"},{"name":"Lena Headey","photos":[{"url":"http://image.tmdb.org/t/p/original/6BZiPycIueJ3t0iEozWCbUZleuj.jpg"},{"url":"http://image.tmdb.org/t/p/original/gsEMokm0i2lknw3INs9nYPy75L2.jpg"},{"url":"http://image.tmdb.org/t/p/original/sYouxxl6FSwSxagIPnP1bE1mLoO.jpg"},{"url":"http://image.tmdb.org/t/p/original/ymrCNe7ekHDME35fE0KWSIr0NPI.jpg"},{"url":"http://image.tmdb.org/t/p/original/zCl7v11D7btDQwOWN1vblW1nLpL.jpg"},{"url":"http://image.tmdb.org/t/p/original/zLu7xX8I9XFcTkJ3owTP4IQAiGz.jpg"},{"url":"http://image.tmdb.org/t/p/original/hBOvsNJ5Eno1curkV8fgjWPmH7T.jpg"},{"url":"http://image.tmdb.org/t/p/original/cNZEorLowgClabP6ghF5TWzoyYZ.jpg"},{"url":"http://image.tmdb.org/t/p/original/ke6wGvD9zaFwjEgfWUaJzLq44rq.jpg"}],"biography":"Height 5' (1,66 m)  Lena Headey (born 3 October 1973) is an English actress known for playing Sarah Connor on Fox's Terminator: The Sarah Connor Chronicles, as well as appearing in such films as The Remains of the Day, Possession, Imagine Me and You, The Brothers Grimm, The Broken, 300 and The Red Baron.\n\nDescription above from the Wikipedia article  Lena Headey, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1973-10-03"},{"name":"James Remar","photos":[{"url":"http://image.tmdb.org/t/p/original/AeSuQlBclvWqztlpkf9nIhvvhsc.jpg"},{"url":"http://image.tmdb.org/t/p/original/nrH2PnXJ8kb01OWGXFDUxaq7Jut.jpg"},{"url":"http://image.tmdb.org/t/p/original/nRuuGoaYnDJTBVOp8H4iYlMXXdp.jpg"}],"biography":"James Remar (born December 31, 1953) is an American actor. He has appeared in movies, video games, and TV shows. He is perhaps best known as Richard, the on-off tycoon boyfriend of Kim Cattrall's character in Sex and the City, as Ajax in The Warriors, as the homicidal maniac Albert Ganz in the 1982 comedy/thriller 48 Hrs., Dutch Shultz in The Cotton Club, Lord Raiden in Mortal Kombat: Annihilation and more recently as Harry Morgan in Dexter. Description above from the Wikipedia article James Remar, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1953-12-31"},{"name":"Cobie Smulders","photos":[{"url":"http://image.tmdb.org/t/p/original/w1SIqfGFKbCTW0X4osoiQuvI0tW.jpg"},{"url":"http://image.tmdb.org/t/p/original/7TIENKNwDdKSuYqyTENKtCznkCG.jpg"},{"url":"http://image.tmdb.org/t/p/original/vi0bVIpQb8LsVF9PuDKAA92xwr.jpg"},{"url":"http://image.tmdb.org/t/p/original/o60rhilj3M9TDPn3hKvt2Y8KtCK.jpg"},{"url":"http://image.tmdb.org/t/p/original/yeAmFyEdsOTAcbbUtFgS1KNOmnB.jpg"},{"url":"http://image.tmdb.org/t/p/original/oGcx0q6leaDibTei3lIwDW5CLbX.jpg"},{"url":"http://image.tmdb.org/t/p/original/xRRXrlUnbw0JXsQGAETodIJFxfV.jpg"},{"url":"http://image.tmdb.org/t/p/original/39oGmftRWcZOsWKugDWNpPanDBa.jpg"},{"url":"http://image.tmdb.org/t/p/original/oPuPlX5CxJfpTsjHWDGWLQBngRI.jpg"},{"url":"http://image.tmdb.org/t/p/original/ehYfWsjro7VnX9g5H8eiGZb5Bgj.jpg"},{"url":"http://image.tmdb.org/t/p/original/uSMBdlauk8OoFncb28TGkFQ55cV.jpg"},{"url":"http://image.tmdb.org/t/p/original/agp9dPtKiWNkrKgNNlRhnuXa7Aw.jpg"},{"url":"http://image.tmdb.org/t/p/original/3VgX8ZIH4oBdAEqqzs18hNVZliG.jpg"},{"url":"http://image.tmdb.org/t/p/original/k9LI9q3dBa5CxiO7gRP6RE7NxGz.jpg"},{"url":"http://image.tmdb.org/t/p/original/vkNCFfAkZACXtDuM55pclEAfDou.jpg"},{"url":"http://image.tmdb.org/t/p/original/49cSaTLCmzQ581eFpjChSkzk7uU.jpg"},{"url":"http://image.tmdb.org/t/p/original/wy4P2QuemSQ2RS7frhcZv3MKlBG.jpg"},{"url":"http://image.tmdb.org/t/p/original/hmCG1LZGFcZOpHFsElFiuSltFY1.jpg"},{"url":"http://image.tmdb.org/t/p/original/lzhGhSNkGQhxY39akVwlRVj04Oy.jpg"},{"url":"http://image.tmdb.org/t/p/original/llXNJ8lqyv3QP1j6fdCKvRDvjT6.jpg"},{"url":"http://image.tmdb.org/t/p/original/h5rt3BG6pNAcTw3cDf8TpZDzy9P.jpg"},{"url":"http://image.tmdb.org/t/p/original/esgY35Ig1Fs5NXOwjlKIz5XXEL8.jpg"},{"url":"http://image.tmdb.org/t/p/original/sQAXM2ZEbBnkJQ1gmti9s3a05gc.jpg"},{"url":"http://image.tmdb.org/t/p/original/mCEog8aDFLBfd5pswQ9CCIYn0iA.jpg"}],"biography":"Jacoba Francisca Maria \"Cobie\" Smulders (born April 3, 1982, height 5' 8\" (1,73 m)) is a Canadian actress and former model, known for her current role as Robin Scherbatsky on the CBS television series How I Met Your Mother and Maria Hill in the 2012 film The Avengers.\n\nSmulders was born in Vancouver, British Columbia, to a Dutch father and an English mother. She was named after her great-aunt, from whom she gained the nickname \"Cobie\".\n\nSmulders worked in modeling, which she later said she \"kind of hated\", adding that the experience made her hesitant about pursuing acting as a career: \"You know you go into these rooms, and I've had the experience of people judging you physically for so long and I was over that. But then it was like, 'Oh no, I have to actually perform. I have to do well, and I have to have a voice, and I have to have thoughts now'\".After she quit modeling, she registered at the University of Victoria to study marine biology. During the summer, she took acting classes and decided to pursue her acting career.\n\nSmulders' first acting role was as a guest in the Showtime science fiction series Jeremiah, and she has appeared in several television series since, including a recurring role in The L Word. On the New York stage, she has performed in Love, Loss, and What I Wore from at least June 10 to June 27, 2010. Her first permanent series role was in the short-lived ABC series Veritas: The Quest, and her second was television reporter Robin Scherbatsky on the CBS sitcom How I Met Your Mother which quickly became popular. Joss Whedon has suggested that he considered her for the role of Wonder Woman in his draft of the eponymous film, which did not go into production. Smulders played Maria Hill in Whedon's 2012 film The Avengers and reprises her role in the premiere of the Agents of S.H.I.E.L.D. television seriesand both the Russo brothers' 2014 film Captain America: The Winter Soldier and Avengers: Age of Ultron in 2015.\n\nSmulders and American actor Taran Killam became engaged in January 2009. They married on September 8, 2012 in Solvang, California. The couple have a daughter, Shaelyn Cado Killam (born May 14, 2009).\n\nSmulders resides in Los Angeles, California.\n\nDescription above from the Wikipedia article Cobie Smulders, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1982-04-03"},{"name":"Ian Holm","photos":[{"url":"http://image.tmdb.org/t/p/original/uq6Wx7PaLgaw969avH7tLHnSb0Q.jpg"},{"url":"http://image.tmdb.org/t/p/original/27SAk1v043GdOeAxT5pPoMUYhGg.jpg"},{"url":"http://image.tmdb.org/t/p/original/yD3bGWErMQPaAe1ZKdzvWi7hLsY.jpg"},{"url":"http://image.tmdb.org/t/p/original/ro9CNUXcwB0OHqShKImkRjyZqWL.jpg"},{"url":"http://image.tmdb.org/t/p/original/ro9CNUXcwB0OHqShKImkRjyZqWL.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nSir Ian Holm, CBE (born 12 September 1931) is a British actor known for his stage work and for many film roles. He received the 1967 Tony Award for Best Featured Actor for his performance as Lenny in The Homecoming and the 1998 Laurence Olivier Award for Best Actor for his performance in the title role of King Lear. He was nominated for the 1981 Academy Award for Best Supporting Actor for his role as athletics trainer Sam Mussabini in Chariots of Fire. Other well-known film roles include the android Ash in Alien, Father Vito Cornelius in The Fifth Element, and the hobbit Bilbo Baggins in the first and third films of the Lord of the Rings film trilogy.\n\nDescription above from the Wikipedia article Ian Holm, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1931-09-12"},{"name":"Matthew McConaughey","photos":[{"url":"http://image.tmdb.org/t/p/original/jdRmHrG0TWXGhs4tO6TJNSoL25T.jpg"},{"url":"http://image.tmdb.org/t/p/original/hHiLJl7yvDwbtbgdvTQKa7HuQCx.jpg"},{"url":"http://image.tmdb.org/t/p/original/2w6LoftgzyvhZ0n8fxdP1vzMBtu.jpg"},{"url":"http://image.tmdb.org/t/p/original/4I08ZGh6fJ41wBUZqkiiku8JjgX.jpg"}],"biography":"Matthew David McConaughey (born November 4, 1969) is an American actor. After a series of minor roles in the early 1990s, McConaughey gained notice for his breakout role in Dazed and Confused (1993). It was in this role that he first conceived the idea of his catch-phrase \"Well alright, alright.\" He then appeared in films such as A Time to Kill, Contact, U-571, Tiptoes, Sahara, and We Are Marshall. McConaughey is best known more recently for his performances as a leading man in the romantic comedies The Wedding Planner, How to Lose a Guy in 10 Days, Failure to Launch, Ghosts of Girlfriends Past and Fool's Gold.\n\nDescription above from the Wikipedia article Matthew McConaughey, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1969-11-04"},{"name":"Robert Duvall","photos":[{"url":"http://image.tmdb.org/t/p/original/1aBC7NxPy10ofng6HsJBecJ1vMZ.jpg"},{"url":"http://image.tmdb.org/t/p/original/3ZrFkVN4K9LM2uLbCcnRk3a856T.jpg"},{"url":"http://image.tmdb.org/t/p/original/p1QXaBQlPz5ximUZsAfkXW1M8pr.jpg"}],"biography":"Robert Selden Duvall (born January 5, 1931) is an American actor and director. He has won an Academy Award, two Emmy Awards, and four Golden Globe Awards over the course of his career. Duvall has been in some of the most acclaimed and popular films of all time, among them To Kill a Mockingbird, The Godfather, The Godfather Part II, MASH, Network, True Grit, Bullitt, The Conversation, Apocalypse Now, Tender Mercies, The Natural and Lonesome Dove. He began appearing in theatre during the late 1950s, moving into small, supporting television and film roles during the early 1960s in such works as To Kill a Mockingbird (1962) (as Boo Radley) and Captain Newman, M.D. (1963). He started to land much larger roles during the early 1970s with movies like MASH (1970) (as Major Burns) and THX 1138 (1971). This was followed by a series of critical successes: The Godfather (1972), The Godfather Part II (1974), Network (1976), The Great Santini (1979), Apocalypse Now (1979), and True Confessions (1981). Since then Duvall has continued to act in both film and television with such productions as Tender Mercies (1983) (for which he won an Academy Award, The Natural (1984), Colors (1988), the television mini-series Lonesome Dove (1989), Stalin (1992), The Man Who Captured Eichmann (1996), A Family Thing (1996), The Apostle (1997) (which he also wrote and directed), A Civil Action (1998), Gods and Generals (2003), Broken Trail (2006) and Get Low (2010).\n\nDescription above from the Wikipedia article Robert Duvall, licensed under CC-BY-SA, full list of contributors on Wikipedia","birthday":"1931-01-05"},{"name":"Patrick Stewart","photos":[{"url":"http://image.tmdb.org/t/p/original/9APDd4HgEasZemAcSEBETY9DQoL.jpg"},{"url":"http://image.tmdb.org/t/p/original/6gYt0WPYGs3EqO9pUhlO68igWvD.jpg"},{"url":"http://image.tmdb.org/t/p/original/iyCFjNJfxeT9K3dZR5z0dMWL3Yu.jpg"},{"url":"http://image.tmdb.org/t/p/original/2HNfInPvo1ygBXGBf3J5RlUeUOp.jpg"},{"url":"http://image.tmdb.org/t/p/original/6MxFYEfzd1X3UqVr9wINgGTmP4c.jpg"}],"biography":"Patrick Hewes Stewart is an English film, television and stage actor. He has had a distinguished career in theatre and television for around half a century. He is most widely known for his television and film roles, as Captain Jean-Luc Picard in Star Trek: The Next Generation and as Professor Charles Xavier in the X-Men films.\n\nStewart was born in Mirfield near Dewsbury in the West Riding of Yorkshire, England, the son of Gladys, a weaver and textile worker, and Alfred Stewart, a Regimental Sergeant Major in the British Army who served with the King's Own Yorkshire Light Infantry and previously worked as a general labourer and as a postman. Stewart and his first wife, Sheila Falconer, have two children: Daniel Freedom and Sophie Alexandra. Stewart and Falconer divorced in 1990. In 1997, he became engaged to Wendy Neuss, one of the producers of Star Trek: The Next Generation, and they married on 25 August 2000, divorcing three years later. Four months prior to his divorce from Neuss, Stewart played opposite actress Lisa Dillon in a production of The Master Builder. The two dated for four years, but are no longer together. He is now seeing Sunny Ozell; at 31, she is younger than his daughter. \"I just don't meet women of my age,\" he explains.\n\nStewart has been a prolific actor in performances by the Royal Shakespeare Company, appearing in over 60 productions.","birthday":"1940-07-13"},{"name":"Anthony Hopkins","photos":[{"url":"http://image.tmdb.org/t/p/original/cxzilQP3rxybruyoD4xIsxNvc8x.jpg"},{"url":"http://image.tmdb.org/t/p/original/tkWWnTmxi5dItNXDrt0V4KYJMc6.jpg"},{"url":"http://image.tmdb.org/t/p/original/btweZvSRBiE6jaMME93BSXeTQN6.jpg"},{"url":"http://image.tmdb.org/t/p/original/oDMLEhFmXLkTlUnErs0RxRua7kN.jpg"},{"url":"http://image.tmdb.org/t/p/original/yvnmbCfshVOkCHbV1HsZ3OEcfCX.jpg"}],"biography":"Anthony Hopkins was born on 31 December 1937, in Margam, Wales. Influenced by Richard Burton,\n he decided to study at College of Music and Drama and graduated in \n1957. In 1965, he moved to London and joined the National Theatre, \ninvited by Laurence Olivier, who could see the talent in Hopkins. In 1967, he made his first film for television, A Flea in Her Ear (1967) (TV).\n\nFrom this moment on, he enjoyed a successful career in cinema and television. In 1968, he worked on The Lion in Winter (1968) with Timothy Dalton.\n Many successes came later, and Hopkins' remarkable acting style reached\n the four corners of the world. In 1977, he appeared in two major films:\n A Bridge Too Far (1977) with James Caan, Gene Hackman, Sean Connery, Michael Caine, Elliott Gould and Laurence Olivier, and Maximilian Schell. In 1980, he worked on The Elephant Man (1980). Two good television literature adaptations followed: Othello (1981) (TV) and \"Hallmark Hall of Fame: The Hunchback of Notre Dame (#31.2)\" (1982). In 1987 he was awarded with the Commander of the order of the British Empire. This year was also important in his cinematic life, with 84 Charing Cross Road (1987), acclaimed by specialists. In 1993, he was knighted.\n\nIn the 1990s, Hopkins made movies like Desperate Hours (1990) and Howards End (1992), The Remains of the Day (1993) (nominee for the Oscar), Legends of the Fall (1994), Nixon (1995) (nominee for the Oscar), Surviving Picasso (1996), Amistad (1997) (nominee for the Oscar), The Mask of Zorro (1998), Meet Joe Black (1998) and Instinct (1999). His most remarkable film, however, was The Silence of the Lambs (1991), for which he won the Oscar for Best Actor. He also got a BAFTA for this role.  IMDb Mini Biography By:  Emerenciano","birthday":"1937-12-31"},{"name":"Naomi Watts","photos":[{"url":"http://image.tmdb.org/t/p/original/6GIHYUKqhUvQrQn1L0S2u9Cbo00.jpg"},{"url":"http://image.tmdb.org/t/p/original/sDcObosp7IYrYYX9sXmdgQpFp3m.jpg"},{"url":"http://image.tmdb.org/t/p/original/iLx35xdKmkEyLpgvLia2cMN1jLJ.jpg"},{"url":"http://image.tmdb.org/t/p/original/5kC6fmh8BdUBaEWrtdnLGwq6lqa.jpg"},{"url":"http://image.tmdb.org/t/p/original/oJIPC98ZdgSR2DEWBYYymgG86rd.jpg"},{"url":"http://image.tmdb.org/t/p/original/eg2GpFxSd9MKIao74pFDO43tW9v.jpg"},{"url":"http://image.tmdb.org/t/p/original/xHqtk7SbS0ua8rqiDVEe8qvEGa5.jpg"},{"url":"http://image.tmdb.org/t/p/original/nnUBxT5RCMp7iVPZP9hnodNx792.jpg"},{"url":"http://image.tmdb.org/t/p/original/cEEMFrTgXjQI4GC8A9mqnXShQ3x.jpg"}],"biography":"Naomi Watts had already been a working actress for over a decade when she earned notice as a promising newcomer in David Lynch's Cannes Film Festival prizewinner Mulholland Drive (2001).\n\nBorn September 28th, 1968, Watts began acting in her teens, landing her first film role in For Love Alone (1986). Watts subsequently appeared with future Hollywood headliners Nicole Kidman and Thandie Newton in John Duigan's disarming teen romance Flirting (1991). Watts's next film with Duigan, Wide Sargasso Sea (1992), was not so well received. After her first taste of Hollywood with Joe Dante's schlock movie homage Matinee (1992), Watts nabbed a starring role as Jimmy Smits's disturbed student in George Miller's little seen courtroom drama Gross Misconduct (1993). Watts then starred as Jet Girl to Lori Petty's Tank Girl (1995), but the science fiction fantasy suffered an ignominious box office fate. After a series of TV movies and thrillers, including Sleepwalkers (1997) and Children of the Corn IV (1996), Watts appeared in Marshall Herskovitz's high-toned Venetian courtesan costumer Dangerous Beauty (1998) and successful TV docudrama The Hunt for the Unicorn Killer (1999).  Watts's breakthrough finally arrived when David Lynch cast her in his ABC pilot Mulholland Drive. Though ABC canceled the project in 1999 after Lynch turned in a typically mood-drenched work, StudioCanal financed its transformation into a feature that debuted to acclaim at Cannes in 2001. A Los Angeles dreamscape akin to Lost Highway, Mulholland Drive featured Watts as the blonde half of a female duo caught in a mystery of shifting identities. Drawing attention for her not-for-network TV love scene with co-star Laura Harring, Watts also earned praise as a rising \"new\" actress.\n\nThough ignored for an Oscar nomination, Watts's tour-de-force dual performance earned her numerous accolades and critics' awards, igniting her career. Working steadily in the wake of Mulholland Drive, Watts scored a box-office as well as critical success a year later with The Ring (2002), the Hollywood remake of the Japanese horror blockbuster. Starring Watts as an intrepid reporter investigating the origins of a lethal videotape, The Ring overcame studio doubts to become a sleeper hit, solidifying Watts's new star status. Watts subsequently donned period dress for the Showtime western The Outsider (2002), and to co-star alongside fellow Aussie Heath Ledger in The Kelly Gang (2003). Balancing her genre work with potentially headier fare guided by notable directors, Watts also appeared with Kate Hudson, Glenn Close and Stockard Channing in the Merchant-Ivory romantic comedy Le Divorce (2003), and won a leading role opposite formidable actors Sean Penn and Benicio Del Toro in Alejandro González Iñárritu's 21 Grams (2003).\n\nIn 2004, Watts worked opposite Mark Ruffalo for the independent film We Don't Live Here Anymore, and reteamed with Sean Penn for The Assassination of Richard Nixon. She landed the starring role of Ann Darrow in director Peter Jackson's remake of King Kong (2006), and starred in the 2006 remake of The Painted Veil. Watts was praised for her work as a British midwife who accidentally gets involved in the Russian mafia in director David Cronenberg's psychological thriller Eastern Promises.  Watts starred along with Clive Owen in 2009's The International, for which she played the part of an assistant district attorney who participates in a plan to rob a bank, and co-starred alongside Samuel L. Jackson, Annette Benning, and Kerry Washington for the drama Mother and Child. Watts was later cast in Dream House (2011), a thriller starring Daniel Craig and Rachel Weisz, and worked with Leonardo DiCaprio in the 2011 biopic J. Edgar. ~ Lucia Bozzola, Rovi","birthday":"1968-09-28"},{"name":"Louise Bourgoin","photos":[{"url":"http://image.tmdb.org/t/p/original/sTqanaZbDPV0GkZTy1lrUswpDuc.jpg"},{"url":"http://image.tmdb.org/t/p/original/9FpEojDFAHaQ7dOTWQCQKJoKSJh.jpg"},{"url":"http://image.tmdb.org/t/p/original/c7rIsCYvwy05InT6ff96cHfnIyx.jpg"}],"biography":"From Wikipedia, the free encyclopedia\n\nLouise Bourgoin, born Ariane Bourgoin, is a French actress and television presenter.\n\nDescription above from the Wikipedia article Louise Bourgoin, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1981-11-28"},{"name":"Johnny Depp","photos":[{"url":"http://image.tmdb.org/t/p/original/5sc2pu4YWItxCaXSvrFpg64zN9J.jpg"},{"url":"http://image.tmdb.org/t/p/original/cqSPVCB46cTV9jHthKk2d0Fz3md.jpg"},{"url":"http://image.tmdb.org/t/p/original/5O9WlphuJV4UuyzSgNVyc8SU4N6.jpg"},{"url":"http://image.tmdb.org/t/p/original/bhXxdbSf0pESd0fM0wuRDHK7tS3.jpg"},{"url":"http://image.tmdb.org/t/p/original/ciPYKTSr4t2ZSNLuybDBqe1eWus.jpg"},{"url":"http://image.tmdb.org/t/p/original/tk7BP6Z38d7ZcFtLquBjWnLVT5D.jpg"},{"url":"http://image.tmdb.org/t/p/original/tIqMa6wjblEXSUk1pI6w28wmq3u.jpg"},{"url":"http://image.tmdb.org/t/p/original/9IgmXO62VPCAv9ThL8zej9qsVS2.jpg"},{"url":"http://image.tmdb.org/t/p/original/ySaWKztxP8NUtMssTzNmj91MAai.jpg"},{"url":"http://image.tmdb.org/t/p/original/nh4Elx7RO7fHfFIyZ7dMU6DZ5qr.jpg"},{"url":"http://image.tmdb.org/t/p/original/hjnATV61uGMgpY4cHuiHjOW4cvA.jpg"},{"url":"http://image.tmdb.org/t/p/original/nQDbXBg6u2uBVqn1LB4NduKAiMD.jpg"},{"url":"http://image.tmdb.org/t/p/original/azFJqevKHI3F5R5M60nExp8HULP.jpg"},{"url":"http://image.tmdb.org/t/p/original/l4AcEgVUNAUgTtGS3hRcHNqDyGz.jpg"}],"biography":"John Christopher \"Johnny\" Depp II (born June 9, 1963) is an American actor and musician. He has won the Golden Globe Award and Screen Actors Guild award for Best Actor. Depp rose to prominence on the 1980s television series 21 Jump Street, becoming a teen idol. Turning to film, he played the title character of Edward Scissorhands (1990), and later found box office success in films such as Sleepy Hollow (1999), Pirates of the Caribbean: The Curse of the Black Pearl (2003), Charlie and the Chocolate Factory (2005), and Rango (2011). He has collaborated with director and friend Tim Burton in seven films, including Sweeney Todd: The Demon Barber of Fleet Street (2007) and Alice in Wonderland (2010). Depp has gained acclaim for his portrayals of people such as Edward D. Wood, Jr., in Ed Wood, Joseph D. Pistone in Donnie Brasco, Hunter S. Thompson in Fear and Loathing in Las Vegas, George Jung in Blow, and the bank robber John Dillinger in Michael Mann's Public Enemies. Films featuring Depp have grossed over $2.6 billion at the United States box office and over $6 billion worldwide. He has been nominated for top awards many times, winning the Best Actor Awards from the Golden Globes for Sweeney Todd: The Demon Barber of Fleet Street and from the Screen Actors Guild for Pirates of the Caribbean: The Curse of the Black Pearl. He also has garnered a sex symbol status in American cinema, being twice named as the Sexiest man alive by People magazine in 2003 and 2009.\n\nDescription above from the Wikipedia article Johnny Depp, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1963-06-09"},{"name":"Michelle Rodriguez","photos":[{"url":"http://image.tmdb.org/t/p/original/v37VK0MNuRuJOCKPKJcZAJXRA5r.jpg"},{"url":"http://image.tmdb.org/t/p/original/7s6NKm4eqMwCiuykg0ahTeGFJuK.jpg"},{"url":"http://image.tmdb.org/t/p/original/xNQX2itPnMaznG3GhHKdxBhwbum.jpg"},{"url":"http://image.tmdb.org/t/p/original/ltXb1G752cbwzUMSHb1ybEKnjci.jpg"},{"url":"http://image.tmdb.org/t/p/original/kxd7ofj9lGV6ibWNFN3GkyAg9Xa.jpg"},{"url":"http://image.tmdb.org/t/p/original/r9XrBBoiloM1BxFtIJOvHzK3HMY.jpg"},{"url":"http://image.tmdb.org/t/p/original/9QxyVS9Ru9GB1uSS1f8HYcF0XQN.jpg"},{"url":"http://image.tmdb.org/t/p/original/cXgDloQlOi8bnVvXOUdteQWyQ0A.jpg"}],"biography":"Mayte Michelle Rodríguez (born July 12, 1978), known professionally as Michelle Rodriguez, is an American actress.\n\nFollowing on from her breakthrough role in 2000's Girlfight, she is best known for playing tough-girl roles and starring in Hollywood blockbusters such as The Fast and the Furious (2001), Resident Evil (2002), S.W.A.T. (2003), Avatar and Fast &amp; Furious (2009), Machete (2010), Battle: Los Angeles (2011), Resident Evil: Retribution, (2012), Fast Six (2013) and Machete Kills (2013), as well as for her role as Ana Lucia Cortez in the television series Lost (2005–2006, 2009-2010). She made her Televisa debut, as her role as TBA in the telenovela series Amores verdaderos (telenovela) (2012).","birthday":"1978-07-12"},{"name":"Leonard Nimoy","photos":[{"url":"http://image.tmdb.org/t/p/original/5B5blUXy0PDvToh2nxZk4SVTdyP.jpg"},{"url":"http://image.tmdb.org/t/p/original/cnRIuGqh18KAo6r7OqJefjr0CGT.jpg"},{"url":"http://image.tmdb.org/t/p/original/sSMXLQtvp9j3frHVKvOsa4ccEfu.jpg"},{"url":"http://image.tmdb.org/t/p/original/rFt6DZu4la9k20UtOxa2Oj7UW6T.jpg"},{"url":"http://image.tmdb.org/t/p/original/pKSCkaT5OpK8T4x6IQBkWChzTFT.jpg"},{"url":"http://image.tmdb.org/t/p/original/jnuu2b2ZVOU6DklF9uVJh52H9Gu.jpg"},{"url":"http://image.tmdb.org/t/p/original/4LOyICP2Q521SHzv2iQn8AunB01.jpg"}],"biography":"Leonard Nimoy is an American actor, film director, poet, musician and photographer. Nimoy's most famous role is that of Spock in the original Star Trek series 1966–1969, multiple films, television and video game sequels.  Nimoy began his career in his early twenties, teaching acting classes in Hollywood and making minor film and television appearances through the 1950s, as well as playing the title role in Kid Monk Baroni. In 1953, he served in the United States Army. In 1965, he made his first appearance in the rejected Star Trek pilot, \"The Cage\", and would go on to play the character of Mr. Spock until 1969, followed by seven further films and a number of guest slots in various sequels. His character of Spock generated a significant cultural impact and three Emmy Award nominations; TV Guide named Spock one of the 50 greatest TV characters. Nimoy also had a recurring role in Mission: Impossible and a narrating role in Civilization IV, as well as several well-received stage appearances.  Nimoy's fame as Spock is such that both his autobiographies, I Am Not Spock (1977) and I Am Spock (1995) detail his existence as being shared between the character and himself.  Nimoy was born to Yiddish-speaking Orthodox Jewish immigrants from Iziaslav, Ukraine. His father, Max Nimoy, owned a barbershop in the Mattapan section of the city. His mother, Dora Nimoy (née Spinner), was a homemaker. Nimoy began acting at the age of eight in children's and neighborhood theater. His parents wanted him to attend college and pursue a stable career, or even learn to play the accordion—which, his father advised, Nimoy could always make a living with—but his grandfather encouraged him to become an actor. His first major role was at 17, as Ralphie in an amateur production of Clifford Odets' Awake and Sing!. Nimoy took Drama classes at Boston College in 1953 but failed to complete his studies, and in the 1970s studied photography at the University of California, Los Angeles. He has an MA in Education and an honorary doctorate from Antioch University in Ohio.  Nimoy served as a sergeant in the U.S. Army from 1953 through 1955, alongside fellow actor Ken Berry and architect Frank Gehry.","birthday":"1931-03-26"},{"name":"Leslie Nielsen","photos":[{"url":"http://image.tmdb.org/t/p/original/cZpuTfE1j63tCEXoSL2A7KZjk5d.jpg"},{"url":"http://image.tmdb.org/t/p/original/pRkl5bRx1ZdGKiYdfSAADEe1d6V.jpg"},{"url":"http://image.tmdb.org/t/p/original/u06yDkcwgd5qEDJXckV7T3aRby0.jpg"},{"url":"http://image.tmdb.org/t/p/original/54HurBDL1osMVtVo5nI5tyKkpaL.jpg"},{"url":"http://image.tmdb.org/t/p/original/rR3P8Z2HmG4dVVeX2QByoTmTChd.jpg"},{"url":"http://image.tmdb.org/t/p/original/vaZgvvGeU6alTmUd6fjDXgkLd5W.jpg"},{"url":"http://image.tmdb.org/t/p/original/nNtYfZcB0G658rPaCyjydk3brEl.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nLeslie William Nielsen, OC (11 February 1926 – 28 November 2010) was a Canadian and naturalized American actor and comedian. Nielsen appeared in over one hundred films and 1,500 television programs over the span of his career, portraying over 220 characters. Born in Regina, Saskatchewan, Nielsen enlisted in the Royal Canadian Air Force and worked as a disc jockey before receiving a scholarship to Neighborhood Playhouse. Making his television debut in 1948, he quickly expanded to over 50 television appearances two years later. Nielsen made his film debut in 1956, and began collecting roles in dramas, westerns, and romance films. Nielsen's performances in the films Forbidden Planet (1956) and The Poseidon Adventure (1972) received positive reviews as a serious actor, though he is primarily known for his comedic roles.\n\nAlthough Nielsen's acting career crossed a variety of genres in both television and films, his deadpan delivery in Airplane! (1980) marked a turning point in his career, one that would make him, in the words of film critic Roger Ebert, \"the Olivier of spoofs.\" Nielsen enjoyed further success with The Naked Gun film series (1988 – 1994), based on a short-lived television series Police Squad! in which he starred earlier. His portrayal of serious characters seemingly oblivious to (and complicit in) their absurd surroundings gave him a reputation as a comedian. In the final years of his career, Nielsen appeared in multiple spoof and parody films, many of which were met poorly by critics, but performed well in box office and home media releases. Nielsen married four times and had two daughters from his second marriage. He was recognized with a variety of awards throughout his career, and was inducted into the Canada and Hollywood Walks of Fame.\n\nDescription above from the Wikipedia article Leslie Nielsen, licensed under CC-BY-SA, full list of contributors on Wikipedia","birthday":"1926-02-11"},{"name":"Harrison Ford","photos":[{"url":"http://image.tmdb.org/t/p/original/7CcoVFTogQgex2kJkXKMe8qHZrC.jpg"},{"url":"http://image.tmdb.org/t/p/original/aVKNqtkzZCymupOrvwxozamRyVc.jpg"},{"url":"http://image.tmdb.org/t/p/original/5Vj23wvkRVrx2Lc2lVZh5MEbIwg.jpg"},{"url":"http://image.tmdb.org/t/p/original/7LOTdRfHU1H1qHBxpUv3jT04eWB.jpg"},{"url":"http://image.tmdb.org/t/p/original/4p1AqbCePPXnn2H00Mv4LavVvCK.jpg"},{"url":"http://image.tmdb.org/t/p/original/sjzION7lhDjRNgsaU01wOuFmwlR.jpg"}],"biography":"Legendary Hollywood Icon Harrison Ford was born on July 13, 1942 in Chicago, Illinois.  His family history includes a strong lineage of actors, radio personalities, and models.  Harrison attended public high school in Park Ridge, Illinois where he was a member of the school Radio Station WMTH. Harrison worked as the lead voice for sports reporting at WMTH for several years.  Acting wasn’t a major interest to Ford until his junior year at Ripon College when he first took an acting class.  Harrison Ford’s career started in 1964 when he travelled to California in search of a voice-over job. He never received that position, but instead signed a contract with Columbia Pictures where he earned $150 weekly to play small fill in roles in various films.  Through the 60’s Harrison worked on several TV shows including Gunsmoke, Ironside, Kung Fu, and American Style.  It wasn’t until 1967 that Harrison received his first credited role in the Western film, A Time for Killing. Dissatisfied with the meager roles he was being offered, Ford took a hiatus from acting to work as a self-employed carpenter. This seemingly odd diversion turned out to be a blessing in disguise for Harrison’s acting career when he was soon hired by famous film producer George Lucas.  This was a turning point in Harrison’s life that led to him be casted in milestone roles such as Hans Solo and Indiana Jones.  Since his most famous roles in the Star Wars Trilogy and Raiders of the Lost Ark, Harrison Ford has starred in over 40 films.  Many criticize his recent work, saying his performances have been lackluster leading to commercially disappointing films.  Harrison has always worked hard to protect his off-screen private life, keeping details about his children and marriages quite.  He has a total of five children including one recent adoption with third and current wife Calista Flockhart. In addition to acting Harrison Ford is passionate about environmental conservation, aviation, and archeology.","birthday":"1942-07-13"},{"name":"Alec Baldwin","photos":[{"url":"http://image.tmdb.org/t/p/original/cRJqOew3Tqp629cV3seyvBdzwuM.jpg"},{"url":"http://image.tmdb.org/t/p/original/xaDCkX3RmPjpxsaSBg6T0gLlBS2.jpg"},{"url":"http://image.tmdb.org/t/p/original/zFtp13AZyPbqbj6yHujPWHO5ioh.jpg"},{"url":"http://image.tmdb.org/t/p/original/fLjhSyrd38nTsljqQsUWE5dO4vt.jpg"}],"biography":"Alexander Rae \"Alec\" Baldwin III (born April 3, 1958) is an American actor who has appeared on film, stage, and television. Baldwin first gained recognition through television for his work, for two seasons (6 and 7), on the soap opera Knots Landing, in the role of Joshua Rush. He has since played both leading and supporting roles in films such as Beetlejuice (1988), The Hunt for Red October (1990), The Marrying Man (1991), The Shadow (1994), Notting Hill (1999), Thomas and the Magic Railroad (2000), Final Fantasy: The Spirits Within (2001), The Aviator (2004) and The Departed (2006). His performance in the 2003 film The Cooler garnered him a nomination for the Academy Award for Best Supporting Actor. Since 2006 he has starred as Jack Donaghy on the NBC sitcom 30 Rock, receiving critical acclaim for his performance and winning two Emmy Awards, four Golden Globe Awards, and seven Screen Actors Guild Awards for his work on the show, making him the single male with most SAG's ever. He is the oldest of the Baldwin brothers working in Hollywood. Description above from the Wikipedia article Alec Baldwin, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1958-04-03"},{"name":"Megan Fox","photos":[{"url":"http://image.tmdb.org/t/p/original/e0ORFw5DcpiGEZ649UdYNwTBntr.jpg"},{"url":"http://image.tmdb.org/t/p/original/7LXfjuxXdlq13OgNd4XMqvcUJ7G.jpg"},{"url":"http://image.tmdb.org/t/p/original/vpOdLImqVJie3o6anGFHsvTTB2F.jpg"},{"url":"http://image.tmdb.org/t/p/original/yOnFnJmVw4RuGjcTNREFBso7pEp.jpg"},{"url":"http://image.tmdb.org/t/p/original/dnp8vwurRLUWdezO1mmWqnBEfKw.jpg"},{"url":"http://image.tmdb.org/t/p/original/s9gzaU2F5bJVV0hqxvn4CX2WKvt.jpg"},{"url":"http://image.tmdb.org/t/p/original/dL0Fts9Fji3TywzNEYJwnL5PyYb.jpg"},{"url":"http://image.tmdb.org/t/p/original/n8W4lsUUNK2C8y4CuAjnubt2hx.jpg"},{"url":"http://image.tmdb.org/t/p/original/lENyY9wjnkLdxXDqbJUFgTLGp6a.jpg"},{"url":"http://image.tmdb.org/t/p/original/afJ9vkgRWZt4qPlEf0KLuQ5ccOe.jpg"},{"url":"http://image.tmdb.org/t/p/original/jFK5KpHX0XGzuA8YxItDzfeehiV.jpg"},{"url":"http://image.tmdb.org/t/p/original/j3A2BnBlQfPNNaCV62ycklPnS4k.jpg"},{"url":"http://image.tmdb.org/t/p/original/lvnf2LoBkwO68VJjR0LRL155Ziv.jpg"},{"url":"http://image.tmdb.org/t/p/original/zgQVSHsKIFVDGKC6dXPxFxZJdW1.jpg"},{"url":"http://image.tmdb.org/t/p/original/5mHmVO0fxt02Hkih6eEzLAwD03o.jpg"},{"url":"http://image.tmdb.org/t/p/original/9PQLilN9wbn6LIH1VXsHEfiantI.jpg"},{"url":"http://image.tmdb.org/t/p/original/55eM2dDkNFv4Wkn42RCy9Rae1ma.jpg"},{"url":"http://image.tmdb.org/t/p/original/nWURnyWAjJcUhrUdD41yRAtW9ZH.jpg"},{"url":"http://image.tmdb.org/t/p/original/qtT2Xef44RNHMr5GwBtO9hX9V91.jpg"},{"url":"http://image.tmdb.org/t/p/original/uwEVNrSCOJOAkMD2lTD8dz9DbSl.jpg"},{"url":"http://image.tmdb.org/t/p/original/cI9Z2IEW89oNn0NLVj5PTKuo4bM.jpg"}],"biography":"Megan Denise Fox  (born May 16, 1986, height 5' 4\" (1,63 m)) is an American actress and model. She began her acting career in 2001, with several minor television and film roles, and played a regular role on the Hope &amp; Faith television show. In 2004, she made her film debut with a role in Confessions of a Teenage Drama Queen. In 2007, she co-starred as Mikaela Banes, the love interest of Shia LaBeouf's character, in the blockbuster film, Transformers, which became her breakout role. Fox reprised her role in the 2009 sequel, Transformers: Revenge of the Fallen. Later in 2009, she starred as the eponymous lead in the film Jennifer's Body. Fox is also considered one of the modern female sex symbols and has appeared in magazines such as Maxim, Rolling Stone and FHM.\n\nFox was born in Oak Ridge, Tennessee, the daughter of Gloria Darlene (née Cisson) and Franklin Thomas Fox. She has English, and smaller amounts of Scottish, German, French, Scots-Irish (Northern Irish), and Powhatan Native American, ancestry.She was raised \"very strictly Pentecostal\", but later attended Catholic school for twelve years. Fox's parents divorced when she was young. Fox's mother later remarried, and she and her sister were raised by her mother and her stepfather, Tony Tonachio. She said that the two were \"very strict\" and that she was not allowed to have a boyfriend or invite friends to her house. She lived with her mother until she made enough money to support herself.\n\nFox began her training in drama and dance at age five, in Kingston, Tennessee. She attended a dance class at the community center there and was involved in Kingston Elementary School's chorus and the Kingston Clippers swim team. At 10 years of age, after moving to St. Petersburg, Florida, Fox continued her training. When she was 13 years old, Fox began modeling after winning several awards at the 1999 American Modeling and Talent Convention in Hilton Head, South Carolina. At age 17, she tested out of school via correspondence in order to move to Los Angeles, California.\n\nFox has spoken extensively of her time in education; that in middle school she was bullied and picked on and she ate lunch in the bathroom to avoid being \"pelted with ketchup packets\". She said that the problem was not her looks, but that she had \"always gotten along better with boys\" and that \"rubbed some people the wrong way\". Fox also said of high school that she was never popular and that \"everyone hated me, and I was a total outcast, my friends were always guys, I have a very aggressive personality, and girls didn’t like me for that. I’ve had only one great girlfriend my whole life\". In the same interview, she mentions that she hated school and has never been \"a big believer in formal education\" and that \"the education I was getting seemed irrelevant. So, I was sort of checked out on that part of it\". Source: Wikipedia, the free encyclopedia.","birthday":"1986-05-16"},{"name":"Bradley Cooper","photos":[{"url":"http://image.tmdb.org/t/p/original/6lNwT1T1mwyQZOiujoP3nNJkHl9.jpg"},{"url":"http://image.tmdb.org/t/p/original/nzvYJQSlKKTLZXg3QYp3MG1TCaF.jpg"},{"url":"http://image.tmdb.org/t/p/original/4U4FtnwLw7yLWQJmHdXoruoeuVm.jpg"},{"url":"http://image.tmdb.org/t/p/original/ha9RIqnhDSYbXjndLHALQRP33Uf.jpg"},{"url":"http://image.tmdb.org/t/p/original/1GqyNJUmyo4DPhEM78LlH1tQGoE.jpg"},{"url":"http://image.tmdb.org/t/p/original/vqi0ONGMS5nLpfNGi9uJvisXzhi.jpg"}],"biography":"Bradley Cooper (born January 5, 1975) is an American film, theater, and television actor. He is known for his roles as Will Tippin in the TV series Alias, Phil Wenneck in the 2009 film The Hangover (and its sequels), and Templeton \"Faceman\" Peck in 2010 movie The A-Team.\n\nDescription above from the Wikipedia article Bradley Cooper, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1975-01-05"},{"name":"Linda Fiorentino","photos":[{"url":"http://image.tmdb.org/t/p/original/16aVa4evfjWiAnM6srkLhWYJlpZ.jpg"},{"url":"http://image.tmdb.org/t/p/original/9Op3iGsEEZL61NCYYqvy5t2qJyq.jpg"},{"url":"http://image.tmdb.org/t/p/original/kq7Qbdhep2ZaETYh62nr6tmWZWF.jpg"},{"url":"http://image.tmdb.org/t/p/original/1Dvn2WY9omHH5ntBaIrNl3hoo8R.jpg"},{"url":"http://image.tmdb.org/t/p/original/so0tCng31Wzyr5fcT22ZfKnqlmb.jpg"}],"biography":"Linda Fiorentino (born March 9, 1958) is an American actress. She is known for her roles in films such as Dogma, Vision Quest, Men in Black, After Hours and The Last Seduction.\n\nDescription above from the Wikipedia article Linda Fiorentino, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1958-03-09"},{"name":"Elizabeth Montgomery","photos":[{"url":"http://image.tmdb.org/t/p/original/pCbOD3ftWU8wBoY8kBGQ4U8DGTh.jpg"},{"url":"http://image.tmdb.org/t/p/original/lLCeDAQNmPhKS2pYXrWuMephuz5.jpg"}],"biography":null,"birthday":null},{"name":"Adam Sandler","photos":[{"url":"http://image.tmdb.org/t/p/original/igMZZmqf8Dl4gGHQ5cphP9mS3m9.jpg"},{"url":"http://image.tmdb.org/t/p/original/q3VoN5wg2UFa0GmD2FcZOOp6ZbJ.jpg"},{"url":"http://image.tmdb.org/t/p/original/oLBGNxlNcfMbcVFYtn4l1kqHpVT.jpg"},{"url":"http://image.tmdb.org/t/p/original/de0dw0gJ4VWVJKrOLLCwJaQjpM5.jpg"},{"url":"http://image.tmdb.org/t/p/original/hsABFJZlVqCgQrYpOfuEUSb1Q38.jpg"},{"url":"http://image.tmdb.org/t/p/original/hsABFJZlVqCgQrYpOfuEUSb1Q38.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nAdam Sandler was born on September 9, 1966, in Brooklyn, New York, to Judy and Stanley Sandler. At 17, he took his first step towards becoming a stand-up comedian when he spontaneously took the stage at a Boston comedy club. He found he was a natural comic. He nurtured his talent while at New York University (graduating with a Bachelor of Fine Arts degree in 1991) by performing regularly in clubs and at universities. During his freshman year, he snagged a recurring role as the Huxtable family's friend Smitty on \"The Cosby Show\" (1984). While working at a comedy club in L.A., he was \"discovered\" by Dennis Miller, who recommended him to \"Saturday Night Live\" (1975) producer Lorne Michaels and told him that Sandler had a big talent. This led to his being cast in the show in 1990, which he also wrote for in addition to performing. After \"Saturday Night Live\" (1975), Sandler went on to the movies, starring in such hit comedies as Airheads (1994), Happy Gilmore (1996), Billy Madison (1995) and Big Daddy (1999/I). He has also starred in Mr. Deeds (2002) alongside Winona Ryder; Eight Crazy Nights (2002), an animated movie about the Jewish festival of Chanukah; and Punch-Drunk Love (2002). He also writes and produces many of his own films and has composed songs for several of them, including The Wedding Singer (1998). Sandler has had several of his songs placed on the \"Billboard\" charts, including the classic \"The Chanukah Song\".\n\nDescription above from the Wikipedia article Adam Sandler, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1966-09-09"},{"name":"Ben Affleck","photos":[{"url":"http://image.tmdb.org/t/p/original/YfbiR0Y9JbKXdUDbAlMUR7XpeS.jpg"},{"url":"http://image.tmdb.org/t/p/original/qjYzCYDnsV6SMOph0btVAg8nAru.jpg"},{"url":"http://image.tmdb.org/t/p/original/p64pYVDEYp9zIFhtMK6tOcRgPDi.jpg"},{"url":"http://image.tmdb.org/t/p/original/59ZHP0PIU7qzjtaa8Rgi0zYdlOX.jpg"}],"biography":"From Wikipedia, the free encyclopedia.  \n\nBen Affleck (born Benjamin Géza Affleck-Boldt; August 15, 1972) is an American actor, film director, writer, and producer. He became known in the mid-1990s with his performance in the Kevin Smith films Mallrats (1995) and Chasing Amy (1997). Affleck is an Academy Award as well as a Golden Globe Award winner, along with Matt Damon, for their collaborative screenplay for the 1997 film Good Will Hunting. He established himself as a Hollywood leading man, having starred in several big budget films, such as Armageddon (1998), Pearl Harbor (2001), Changing Lanes (2002), The Sum of All Fears (2002), and Daredevil (2003).\n\nAffleck has drawn critical acclaim for his work as a filmmaker, directing Gone Baby Gone (2007) and The Town (2010), and playing the lead role in the latter. He has worked with his younger brother, actor Casey Affleck, on several projects, including Good Will Hunting and Gone Baby Gone.\n\nAfter a high profile relationship with actress Gwyneth Paltrow in 1998, his relationship with actress/singer Jennifer Lopez attracted worldwide media attention in which Affleck and Lopez were dubbed \"Bennifer\". Following their breakup in 2004, he began dating Jennifer Garner. The two married in June 2005 and have two daughters, Violet Anne, born December 2005, and Seraphina Rose Elizabeth, born January 2009.\n\nAffleck has been actively involved in politics and charitable causes. He and Matt Damon also founded the production company LivePlanet.\n\nDescription above from the Wikipedia article Ben Affleck, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1972-08-15"},{"name":"Sandra Bullock","photos":[{"url":"http://image.tmdb.org/t/p/original/pFudVrL9n8L0AHwMpbcfvsrjUQy.jpg"},{"url":"http://image.tmdb.org/t/p/original/hS8lgGoLAbXnbigTXV03KbQJQ2M.jpg"},{"url":"http://image.tmdb.org/t/p/original/7IGXKpo6n29oBv9VO5VXI9LHzqo.jpg"},{"url":"http://image.tmdb.org/t/p/original/79pX44zaxpihVfwqCXpfbkHQFKu.jpg"},{"url":"http://image.tmdb.org/t/p/original/aCa4ELD1MfsVjLWYAynYbhXHQmu.jpg"},{"url":"http://image.tmdb.org/t/p/original/1Im0NV6nVaKyXMpYjGOfWaj5khS.jpg"},{"url":"http://image.tmdb.org/t/p/original/dRmcWcf5zzHuZr3k9QyKMiricUt.jpg"},{"url":"http://image.tmdb.org/t/p/original/8LZv35G2RHsCLLL1F1tYXNTnhD5.jpg"},{"url":"http://image.tmdb.org/t/p/original/r269EtbaiJt3VkEVdQbwmcNr2D4.jpg"},{"url":"http://image.tmdb.org/t/p/original/ba42ZI0QoKO4GVGO0NvCBpmRvvR.jpg"},{"url":"http://image.tmdb.org/t/p/original/uh8o279melf6MZyNUHXGpgOVmr3.jpg"},{"url":"http://image.tmdb.org/t/p/original/t7HBfsCGFmb5LZnoRvyyzC2PjUH.jpg"},{"url":"http://image.tmdb.org/t/p/original/eC9s7uezxTg06oRzz9BRWfZQhhn.jpg"}],"biography":"Sandra Annette Bullock (born July 26, 1964, height 5' 7½\" (1,71 m)) is an American actress and producer. She rose to fame in the 1990s with roles in films such as Demolition Man (1993), Speed (1994), The Net (1995), While You Were Sleeping (1995), A Time to Kill (1996), and Hope Floats (1998). In the new millennium, Bullock starred in Miss Congeniality (2000), Two Weeks Notice (2002), The Lake House (2006), and the critically acclaimed Crash (2004). In 2007, she was ranked as the 14th richest woman in the entertainment industry with an estimated fortune of $85 million. In 2009, Bullock starred in two of the more financially successful films of her career, The Proposaland The Blind Side. Bullock was awarded the Broadcast Film Critics Association Award for Best Actress, Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role, Golden Globe Award for Best Actress – Motion Picture Drama, and the Academy Award for Best Actress for her role as Leigh Anne Tuohy in The Blind Side.\n\nEarly life\n\nBullock was born in Arlington, Virginia, a suburb of Washington, D.C. Her father, John W. Bullock (born 1925), was a United States Army employee and part-time voice coach; her mother, Helga Mathilde Meyer (1942–2000), was an opera singer and voice teacher.Bullock's father was from Birmingham, Alabama, and had English, Irish, German, and French ancestry, while Bullock's mother was German. Bullock's maternal grandfather was a rocket scientist from Nuremberg, Germany. Bullock's father, then in charge of the Army's Military Postal Service in Europe, was stationed in Nuremberg when he met his wife. They married in Germany and moved to Arlington, where John worked with the Army Materiel Command, before becoming a contractor for The Pentagon.She has a younger sister, Gesine Bullock-Prado, who was formerly the vice-president of Bullock's production company Fortis Films.\n\nBullock was raised in Nuremberg, Germany for twelve years and grew up speaking German.She attended the humanistic Waldorf School. As a child, Bullock frequently accompanied her mother on European opera tours. Bullock studied ballet and vocal arts as a child, taking small parts in her mother's opera productions. She sang in the operas children's choir at the Staatstheater Nürnberg. The scar above her left eye was caused when she fell into a creek as a child. Bullock attended Washington-Lee High School, where she was a cheerleader and performed in high school theater productions. After graduating in 1982, she attended East Carolina University in Greenville, North Carolina, where she received a degree in drama in 1986.She then moved to Manhattan and supported herself as a bartender, cocktail waitress, and coat checker while auditioning for roles.\n\nUntil the age of eighteen, Bullock held German and American dual citizenship. In 2009 Bullock reapplied for German citizenship.\n\nDescription above from the Wikipedia article Sandra Bullock, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1964-07-26"},{"name":"Susan Sarandon","photos":[{"url":"http://image.tmdb.org/t/p/original/tRDPATibAPVKzlv6nC7IBd5rjiF.jpg"},{"url":"http://image.tmdb.org/t/p/original/sT6zE3Bpa2HR5lAS44tB6rWDEtP.jpg"},{"url":"http://image.tmdb.org/t/p/original/i8nTVp9PRHGbUmK1OvOn8qeFO5e.jpg"},{"url":"http://image.tmdb.org/t/p/original/n1xy3X3is9IKKqsyHVkc3lJhj2T.jpg"},{"url":"http://image.tmdb.org/t/p/original/qoJQysmuBuHAs8O89jEosMTizKY.jpg"},{"url":"http://image.tmdb.org/t/p/original/jKyFLxR0F1KbjWGkfiSiEfgPSBs.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nSusan Abigail Sarandon (born October 4, 1946) is an American actress. She has worked in films and television since 1969, and won an Academy Award for Best Actress for her performance in the 1995 film Dead Man Walking. She had also been nominated for the award for four films before that and has received other recognition for her work. She is also noted for her social and political activism for a variety of liberal causes.","birthday":"1946-10-04"},{"name":"Ian McKellen","photos":[{"url":"http://image.tmdb.org/t/p/original/c51mP46oPgAgFf7bFWVHlScZynM.jpg"},{"url":"http://image.tmdb.org/t/p/original/r1ijqvQAzPcIGHHeUxUetCEkwkT.jpg"},{"url":"http://image.tmdb.org/t/p/original/91yYKJspfvOF9xqoyiNVwrBWaXD.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nSir Ian Murray McKellen, CH, CBE (born 25 May 1939) is an English actor. He is the recipient of six Laurence Olivier Awards, a Tony Award, a Golden Globe Award, a Screen Actors Guild Award, a BIF Award, two Saturn Awards, four Drama Desk Awards and two Critics' Choice Awards. He has also received two Academy Award nominations, eight BAFTA film and TV nominations and five Emmy Award nominations. McKellen's work spans genres ranging from Shakespearean and modern theatre to popular fantasy and science fiction. His notable film roles include Gandalf in The Lord of the Rings and The Hobbit trilogies and Magneto in the X-Men films.\n\nMcKellen was appointed Commander of the Order of the British Empire in 1979, was knighted in 1991 for services to the performing arts, and was made a Companion of Honour for services to drama and to equality, in the 2008 New Year Honours.","birthday":"1939-05-25"},{"name":"Bud Spencer","photos":[{"url":"http://image.tmdb.org/t/p/original/9DbwXqkoMLBqZaQYEeSDX934mTG.jpg"},{"url":"http://image.tmdb.org/t/p/original/8Kq2bddjRg7E2lkTZxQget1QUew.jpg"},{"url":"http://image.tmdb.org/t/p/original/8Kq2bddjRg7E2lkTZxQget1QUew.jpg"},{"url":"http://image.tmdb.org/t/p/original/qju7cnYO8HP0OZhtIWwjyJJ7PDD.jpg"},{"url":"http://image.tmdb.org/t/p/original/qx9n6tXieRbopiE2hY82dpq6pOY.jpg"}],"biography":"Bud Spencer is an Italian actor, filmmaker and a former professional swimmer. He is known for past roles in action-comedy films together with his long-time film partner Terence Hill. Growing from a successful swimmer in his youth, he got a degree in law, and has registered several patents. Bud also became a certified commercial airline and helicopter pilot, Bud Spencer also supports and funds many children's charities, including the Spencer Scholarship Fund.\n\nBud Spencer and Terence Hill both appeared, produced and directed over 20 films together and thus became and still remain best friends to this present day.","birthday":"1929-10-31"},{"name":"Lorànt Deutsch","photos":[{"url":"http://image.tmdb.org/t/p/original/r6kF1vGoKMcRVvYxpKfx91Ra4EK.jpg"}],"biography":" ","birthday":"1975-10-27"},{"name":"Jennifer Lawrence","photos":[{"url":"http://image.tmdb.org/t/p/original/yz0s4kVEC7Wc4iqi2zK7Gmfx9h9.jpg"},{"url":"http://image.tmdb.org/t/p/original/uct0BwTPwp9fiX1BEYFD2dFF9nB.jpg"},{"url":"http://image.tmdb.org/t/p/original/kDmvM9BNu23zzRoRRayuG8IMOs7.jpg"},{"url":"http://image.tmdb.org/t/p/original/azuHNYaNurlMxSiFCHD14yolBui.jpg"},{"url":"http://image.tmdb.org/t/p/original/8NW6tjlm4Emooljy5863PY6uKLN.jpg"},{"url":"http://image.tmdb.org/t/p/original/ligHvwYSWAAk6KdHsWYUP375hGM.jpg"},{"url":"http://image.tmdb.org/t/p/original/70IutpJVNLUGcEMQRdSegwnS2U2.jpg"},{"url":"http://image.tmdb.org/t/p/original/vG1xVksFJLMYJylGVXv2blUEdBt.jpg"},{"url":"http://image.tmdb.org/t/p/original/2QkX73ivrG5ChySgVjeOVsJJcP2.jpg"},{"url":"http://image.tmdb.org/t/p/original/7UvW4LhVgmAbb3rVhm6IfmhRG7h.jpg"},{"url":"http://image.tmdb.org/t/p/original/scyzVGtCQUyGNy9m2dMdE8VbpsK.jpg"}],"biography":"Jennifer Shrader Lawrence (born August 15, 1990, height 5' 9\" (1,75 m)) is an American actress.\n\nHer first major role was as a lead cast member on TBS's The Bill Engvall Show (2007–2009) and she subsequently appeared in the independent films The Burning Plain (2008) and Winter's Bone (2010), for which she received nominations for the Academy Award, Golden Globe Award, Satellite Award, Independent Spirit Award, and Screen Actors Guild Award for Best Actress. At age 20, she was the second-youngest actress ever to be nominated for the Academy Award for Best Actress. At age 22, her performance in the romantic comedy Silver Linings Playbook (2012) earned her the Academy Award, Golden Globe Award, Screen Actors Guild Award, Satellite Award and the Independent Spirit Award for Best Actress, amongst other accolades, making her the youngest person ever to be nominated for two Academy Awards for Best Actress and the second-youngest Best Actress winner.\n\nLawrence is also known for playing Raven Darkhölme / Mystique in the 2011 film X-Men: First Class, a role she will reprise in X-Men: Days of Future Past in 2014. In 2012, she achieved international recognition starring as the heroine Katniss Everdeen in The Hunger Games, an adaptation of Suzanne Collins' best-selling novel of the same name. Her performance in the film garnered her notable critical praise and marked her as the highest-grossing action heroine of all time.\n\nLawrence's performances thus far have prompted Rolling Stone to call her \"the most talented young actress in America.\" In 2013, Time named her one of the 100 most influential people in the world. Description above from the Wikipedia article Jennifer Lawrence, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1990-08-15"},{"name":"Christopher Walken","photos":[{"url":"http://image.tmdb.org/t/p/original/t0gzpYe6FOWH1yKeRBOIpTKgFsB.jpg"},{"url":"http://image.tmdb.org/t/p/original/oep5bxG6Jl3XJF0MYC6Bd6EY3dJ.jpg"},{"url":"http://image.tmdb.org/t/p/original/rWWXiw2G9gdi6ZhvIU0Uy0i1pC4.jpg"},{"url":"http://image.tmdb.org/t/p/original/zGTsiTRzuJejuLMX6IxYe7hrHey.jpg"},{"url":"http://image.tmdb.org/t/p/original/mnKBlWdIdJVPfRTUhCXF0wNx3SJ.jpg"}],"biography":"Christopher Walken (born Ronald Walken, usually called \"Chris\") is an American stage and screen actor.\n\nHe has appeared in more than 100 movies and television shows. Walken was born Ronald Walken (named after actor Ronald Colman) into a Methodist family in Astoria, Queens, New York. His mother, Rosalie, was a Scottish immigrant from Glasgow, and his father, Paul Walken, emigrated from Germany in 1928 with his brothers, Wilhelm and Alois. His father was a baker and his mother worked as a window dresser. Influenced by their mother's own dreams of stardom, he and his brothers Kenneth and Glenn were child actors on television in the 1950s. Walken studied at Hofstra University on Long Island, but did not graduate. Walken initially trained as a dancer in music theatre at the Washington Dance Studio before moving on to dramatic roles in theatre and then film. Walken is imitated for his deadpan affect, sudden off-beat pauses, and strange speech rhythm, in a manner similar to William Shatner. He is revered for his quality of danger and menace, but his unpredictable deliveries and expressions make him invaluable in comedy as well. Walken is noted for refusing movie roles only rarely, having stated in interviews that he will decline a role only if he is simply too busy on other projects to take it. He regards each role as a learning experience. Walken has been married to Georgianne Walken (born Thon) since 1969; she is a casting director, most notably for The Sopranos. They live in Connecticut and have no children (Walken has stated in interviews that not having children is one of the reasons he has had such a prolific career). In regard to his villainous roles preceding him when meeting new people, Walken says, \"When they see me in a movie, they expect me to be something nasty ... That's why it's good to defy expectations sometimes.\"","birthday":"1943-03-31"},{"name":"Brad Pitt","photos":[{"url":"http://image.tmdb.org/t/p/original/kc3M04QQAuZ9woUvH3Ju5T7ZqG5.jpg"},{"url":"http://image.tmdb.org/t/p/original/ejYIW1enUcGJ9GS3Bs34mtONwWS.jpg"},{"url":"http://image.tmdb.org/t/p/original/wywUfSkVggWhUnXE4qucoIe1EcA.jpg"},{"url":"http://image.tmdb.org/t/p/original/w8zJQuN7tzlm6FY9mfGKihxp3Cb.jpg"},{"url":"http://image.tmdb.org/t/p/original/cLUacutO7dOMksQK8Zg0q2Gybsx.jpg"},{"url":"http://image.tmdb.org/t/p/original/8Dc4fkdOX4oKZjAqmKY8oWralLV.jpg"},{"url":"http://image.tmdb.org/t/p/original/Byn7JN0BW16DWrVbpdaiXf3cso.jpg"},{"url":"http://image.tmdb.org/t/p/original/iAluHIX58fwmladZbeChmr0bBJS.jpg"}],"biography":"William Bradley \"Brad\" Pitt (born December 18, 1963 height 5' 11\" (1,80 m)) is an American actor and film producer. Pitt has received two Academy Award nominations and four Golden Globe Award nominations, winning one. He has been described as one of the world's most attractive men, a label for which he has received substantial media attention. Pitt began his acting career with television guest appearances, including a role on the CBS prime-time soap opera Dallas in 1987. He later gained recognition as the cowboy hitchhiker who seduces Geena Davis's character in the 1991 road movie Thelma &amp; Louise.  Pitt's first leading roles in big-budget productions came with A River Runs Through It (1992) and Interview with the Vampire (1994). He was cast opposite Anthony Hopkins in the 1994 drama Legends of the Fall, which earned him his first Golden Globe nomination. In 1995 he gave critically acclaimed performances in the crime thriller Seven and the science fiction film 12 Monkeys, the latter securing him a Golden Globe Award for Best Supporting Actor and an Academy Award nomination.\n\nFour years later, in 1999, Pitt starred in the cult hit Fight Club. He then starred in the major international hit as Rusty Ryan in Ocean's Eleven (2001) and its sequels, Ocean's Twelve (2004) and Ocean's Thirteen (2007). His greatest commercial successes have been Troy (2004) and Mr. &amp; Mrs. Smith (2005).\n\nPitt received his second Academy Award nomination for his title role performance in the 2008 film The Curious Case of Benjamin Button. Following a high-profile relationship with actress Gwyneth Paltrow, Pitt was married to actress Jennifer Aniston for five years. Pitt lives with actress Angelina Jolie in a relationship that has generated wide publicity. He and Jolie have six children—Maddox, Pax, Zahara, Shiloh, Knox, and Vivienne.\n\nSince beginning his relationship with Jolie, he has become increasingly involved in social issues both in the United States and internationally. Pitt owns a production company named Plan B Entertainment, whose productions include the 2007 Academy Award winning Best Picture, The Departed.\n\nDescription above from the Wikipedia article Brad Pitt, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1963-12-18"},{"name":"Morgan Freeman","photos":[{"url":"http://image.tmdb.org/t/p/original/oGJQhOpT8S1M56tvSsbEBePV5O1.jpg"},{"url":"http://image.tmdb.org/t/p/original/qKjVdREUNu8PbMpM1uSfb76Y0Eg.jpg"},{"url":"http://image.tmdb.org/t/p/original/8yS5avNboqyPMggMfz9a9Chqoqz.jpg"},{"url":"http://image.tmdb.org/t/p/original/q0NZsDb8DyyU3aiCEXDXay5dkml.jpg"},{"url":"http://image.tmdb.org/t/p/original/iMuyDDJlSihArAkAbkTjeKKG2O2.jpg"},{"url":"http://image.tmdb.org/t/p/original/i4PKnoyTfIW9Qkje5cuAQCWldlr.jpg"},{"url":"http://image.tmdb.org/t/p/original/hsZbWKQ8aOAKBxlyAagoZ6N1ata.jpg"}],"biography":"Morgan Porterfield Freeman, Jr. is an American actor, film director, and narrator. He is noted for his reserved demeanor and authoritative speaking voice. Freeman has received Academy Award nominations for his performances in Street Smart, Driving Miss Daisy, The Shawshank Redemption and Invictus and won in 2005 for Million Dollar Baby. He has also won a Golden Globe Award and a Screen Actors Guild Award.  Morgan Freeman was born in Memphis, Tennessee, the son of Mayme Edna (née Revere) and Morgan Porterfield Freeman, Sr., a barber who died in 1961 from liver cirrhosis. Freeman was sent as an infant to his paternal grandmother in Charleston, Mississippi. He has three older siblings. Freeman's family moved frequently during his childhood, living in Greenwood, Mississippi; Gary, Indiana; and finally Chicago, Illinois. Freeman made his acting debut at age 9, playing the lead role in a school play. He then attended Broad Street High School, currently Threadgill Elementary School, in Mississippi. At age 12, he won a statewide drama competition, and while still at Broad Street High School, he performed in a radio show based in Nashville, Tennessee. In 1955, he graduated from Broad Street High School, but turned down a partial drama scholarship from Jackson State University, opting instead to work as a mechanic in the United States Air Force.  Freeman moved to Los Angeles in the early 1960s and worked as a transcript clerk at Los Angeles Community College. During this period, he also lived in New York City, working as a dancer at the 1964 World's Fair, and in San Francisco, where he was a member of the Opera Ring music group. Freeman acted in a touring company version of The Royal Hunt of the Sun, and also appeared as an extra in the 1965 film The Pawnbroker. He made his off-Broadway debut in 1967, opposite Viveca Lindfors in The Nigger Lovers (about the civil rights era \"Freedom Riders\"), before debuting on Broadway in 1968's all-black version of Hello, Dolly!, which also starred Pearl Bailey and Cab Calloway.  Freeman was married to Jeanette Adair Bradshaw from October 22, 1967, until 1979. He married Myrna Colley-Lee on June 16, 1984. The couple separated in December 2007. Freeman's attorney and business partner, Bill Luckett, announced in August 2008 that Freeman and his wife are in the process of divorce. He has two sons from previous relationships. He adopted his first wife's daughter and the couple also had a fourth child. Freeman lives in Charleston, Mississippi, and New York City. He has a private pilot's license, which he earned at age 65, and co-owns and operates Madidi, a fine dining restaurant, and Ground Zero, a blues club, both located in Clarksdale, Mississippi. He officially opened his second Ground Zero in Memphis, Tennessee on April 24, 2008.  Freeman has publicly criticized the celebration of Black History Month and does not participate in any related events, saying, \"I don't want a black history month. Black history is American history.\" He says the only way to end racism is to stop talking about it, and he notes that there is no \"white history month\". Freeman once said on an interview with 60 Minutes' Mike Wallace: \"I am going to stop calling you a white man and I'm going to ask you to stop calling me a black man.","birthday":"1937-06-01"},{"name":"Marcia Gay Harden","photos":[{"url":"http://image.tmdb.org/t/p/original/ceTCmBJxziHvcF9cDAzmPhuTzP3.jpg"},{"url":"http://image.tmdb.org/t/p/original/wJ8xccf8SPKc45psGBRprZUdWzG.jpg"},{"url":"http://image.tmdb.org/t/p/original/98K3HNjNXiq2qe9AOuxCIBbdnPI.jpg"}],"biography":"​From Wikipedia, the free encyclopedia.            Marcia Gay Harden (born August 14, 1959) is an American film and theatre actress. Harden's breakthrough role was in The First Wives Club (1996) which was followed by several roles which gained her wider fame including the hit comedy Flubber (1997) and Meet Joe Black (1998). She received an Academy Award for Best Supporting Actress for her role as Lee Krasner in Pollock (2000). She has starred in a string of successful mainstream and independent movies, such as Space Cowboys (2000), Into the Wild (2007) and The Mist (2007). Harden’s recent credits include Lasse Hallstrom’s film, The Hoax, opposite Richard Gere, and The Walt Disney Company’s The Invisible, directed by David S Goyer. She was also recently seen in Lakeshore Entertainment’s The Dead Girl, directed by Karen Moncrief and starring Toni Colette, Kerry Washington, Mary Steenburgen and Brittany Murphy. In 2009, Harden received a Tony Award for the Broadway play God of Carnage. She has been nominated for an Emmy Award and the Screen Actors Guild Award two times.  Description above from the Wikipedia article Marcia Gay Harden, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1959-08-14"},{"name":"Halle Berry","photos":[{"url":"http://image.tmdb.org/t/p/original/ilNbzNVhPOd4ICAfKYfJ05VhdBY.jpg"},{"url":"http://image.tmdb.org/t/p/original/hdUqx0on0cqbFuJCZtEGU42UWe5.jpg"},{"url":"http://image.tmdb.org/t/p/original/AmCXHowNbUXpNf41dNrxNB0naM2.jpg"},{"url":"http://image.tmdb.org/t/p/original/w7HRZh4UhimZO2F6GywkYhjgAX3.jpg"},{"url":"http://image.tmdb.org/t/p/original/vlWg3InUftbl3mEFNoOI7AT8Pxz.jpg"},{"url":"http://image.tmdb.org/t/p/original/gmAfxox5RvLwnaV0PK1KaTZLFKt.jpg"},{"url":"http://image.tmdb.org/t/p/original/cDGhjDSZpY0RNDgoyqsjbSGtXf.jpg"},{"url":"http://image.tmdb.org/t/p/original/fU9ld0viEjVS6ghpNZLhSAlgCIO.jpg"},{"url":"http://image.tmdb.org/t/p/original/wjsOp5kvfbG9Vu6QDY8rGCuHs6m.jpg"},{"url":"http://image.tmdb.org/t/p/original/7IGFAnzk62w3W8UqBibquPaG97O.jpg"}],"biography":"Halle Maria Berry is an American actress and former fashion model. She won an Academy Award for Best Actress in 2002 for her performance in Monster's Ball, becoming the first and, as of 2014, the only woman of African-American descent to win an Oscar for a leading role. She is one of the highest paid actresses in Hollywood and has been involved in the production side of several of the films in which she performed. Berry is also a Revlon spokes-model.\n\nBefore becoming an actress, Berry entered and placed in several beauty contests, including the Miss USA Pageant and Miss World Pageants. Her breakthrough film role was in 1992's Boomerang, which led to numerous roles throughout the 1990s, including Introducing Dorothy Dandridge (1999), for which she won the Emmy Award and Golden Globe Award for Best Actress.  Berry reached a higher level of prominence in the 21st Century with prominent action films, including Die Another Day (2002), where she played Bond Girl Jinx.  In addition to her Academy Award win, Berry was awarded a \"worst actress\" Razzie award in 2005 for her controversial role as the titular character in Catwoman. She appeared at the ceremony to accept the award in person (making her the third person, and second actor, ever to do so) with a sense of humor, holding the Academy Award in one hand and the Razzie in the other.    Divorced from baseball player David Justice and musician Eric Benét, Berry has a daughter by model Gabriel Aubry, and a son with her current husband, actor Olivier Martinez.  Berry has routinely been nominated for beauty-based awards in print, including ranking number one in People Magazine’s “50 Most Beautiful People in the World” list in 2003.  Berry continues to star in film roles, while also participating in political activism in support of environmentalism, among other causes.  ","birthday":"1966-08-14"},{"name":"Ushio Shinohara","photos":[],"biography":null,"birthday":null},{"name":"Tim Roth","photos":[{"url":"http://image.tmdb.org/t/p/original/r4jtlboNqWPz2dOHafrPJE4Yd94.jpg"},{"url":"http://image.tmdb.org/t/p/original/feXdqSHZwjAPsgieBZ2DogjIXl9.jpg"},{"url":"http://image.tmdb.org/t/p/original/yTSke0hUtQpl2HIJHYTBD4ktA6L.jpg"},{"url":"http://image.tmdb.org/t/p/original/7As9EwbR7VWCXmSv03PJRP0xzqF.jpg"},{"url":"http://image.tmdb.org/t/p/original/5s6ldvRWvJZ16KZBoQ8teq0WsoB.jpg"}],"biography":"From Wikipedia, the free encyclopedia\n\nSimon Timothy \"Tim\" Roth (born 14 May 1961) is an English film actor and director best known for his roles in the American films Reservoir Dogs, Pulp Fiction, Four Rooms, Planet of the Apes, The Incredible Hulk and Rob Roy, receiving an Academy Award nomination for Best Supporting Actor for the latter. He most recently starred as Cal Lightman in the TV series Lie to Me.\n\nDescription above from the Wikipedia article Tim Roth, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1961-05-14"},{"name":"Clive Owen","photos":[{"url":"http://image.tmdb.org/t/p/original/jm2as6tLcvHCYQvmMYM4VK6JEnr.jpg"},{"url":"http://image.tmdb.org/t/p/original/2Trp7gMKrBRW502sTgkl2ylJA0d.jpg"},{"url":"http://image.tmdb.org/t/p/original/9102Wfqapp3nxlywMwaEqC4uF8m.jpg"},{"url":"http://image.tmdb.org/t/p/original/Apo7iiq9j4ddEcsxPWGcNVCtb1W.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nClive Owen (born 3 October 1964) is an English actor, who has worked on television, stage and film. He first gained recognition in the United Kingdom for portraying the lead in the ITV series Chancer from 1990 to 1991. He then garnered critical acclaim for his work in the film Close My Eyes (1991) before getting international notice for his performance as a struggling writer in Croupier (1998). In 2005, Owen won a Golden Globe and a BAFTA Award and was nominated for an Academy Award for Best Supporting Actor for his appearance in the drama Closer (2004). He has since played leading as well as supporting roles in films such as Sin City (2005), Inside Man (2006), Children of Men (2006), and The International (2009).\n\nDescription above from the Wikipedia article Clive Owen, licensed under CC-BY-SA, full list of contributors on Wikipedia","birthday":"1964-10-03"},{"name":"John Heard","photos":[{"url":"http://image.tmdb.org/t/p/original/nskqE0532LDluEwliY6tarns1xw.jpg"}],"biography":"John Heard, Jr. (born March 7, 1945) is an American actor well known for his recurring role as Peter McCallister, in the first two installments of the Home Alone movie series. More recently he can be seen on CSI: Miami as recurring character Kenwall Duquesne, father of Calleigh Duquesne.","birthday":"1945-03-07"},{"name":"Julia Roberts","photos":[{"url":"http://image.tmdb.org/t/p/original/yzaIyUEKHSnEYDwltXs8gpF4SVC.jpg"},{"url":"http://image.tmdb.org/t/p/original/xdxk3KH47csTeqZblEiRDoPXvkG.jpg"},{"url":"http://image.tmdb.org/t/p/original/7XOfX3z0tBfcyNcUJSoRdMW2ByQ.jpg"},{"url":"http://image.tmdb.org/t/p/original/4LHADUNswei9RjL90G3PwOyyUKo.jpg"},{"url":"http://image.tmdb.org/t/p/original/oVRLNAwHEfRD72UZSPKgbKO7Mjz.jpg"},{"url":"http://image.tmdb.org/t/p/original/ozSje0X8knPQ5gyqpte6KGVPAPP.jpg"},{"url":"http://image.tmdb.org/t/p/original/kH9O6BmPI073OcrUmutOvF5FFRk.jpg"},{"url":"http://image.tmdb.org/t/p/original/cEn3KUbrJ2Ht2uIYam7R27ocKQF.jpg"},{"url":"http://image.tmdb.org/t/p/original/wQAAQEoTnveqVYayE3GNSU3uYIE.jpg"},{"url":"http://image.tmdb.org/t/p/original/5bXxmXkAIdOdFT5bmPtFs7nvB8H.jpg"},{"url":"http://image.tmdb.org/t/p/original/5M7i2NgnVkl6DgX4MD7M0pj6VAd.jpg"}],"biography":"Julia Fiona Roberts was born on October 28, 1967 in Atlanta Georgia. Her brother Eric Roberts, sister Lisa Roberts Gillan and niece Emma Roberts, are also actors. She became a Hollywood star after headlining the 1990's romantic comedy Pretty Woman, which grossed $464 million worldwide. After receiving Academy Award nominations for Steel Magnolias in 1990 and Pretty Woman in 1991, she won the Academy Award for Best Actress in 2001 for her performance in Erin Brockovich.  Roberts made her first big screen appearance in the film Satisfaction, released on February 12, 1988. She had previously performed a small role opposite her brother, Eric, in Blood Red. Her first critical success with moviegoers was her performance in the independent film Mystic Pizza in 1988. The following year, she was featured in Steel Magnolias as a young bride with diabetes and got her first Academy Award nomination as Best Supporting Actress. Roberts became known to worldwide audiences when she co-starred with Richard Gere in Pretty Woman in 1990. The role also earned her a second Oscar nomination, this time as Best Actress. Her next box office success was the thriller Sleeping with the Enemy (1991). Also in 1991, She played Tinkerbell in Steven Spielberg's Hook and also played a nurse in the film Dying Young. This work was followed by a two-year hiatus, during which she made no films other than a cameo appearance in Robert Altman's The Player (1992). In 1993, she co-starred with Denzel Washington in The Pelican Brief, based on the John Grisham novel. In 1994, she starred in the comedy I Love Trouble and in the 1995 comedy-drama Something to Talk About. She then starred alongside Liam Neeson in the 1996 film Michael Collins. Robert’s next commercial and critical success was the film, My Best Friend's Wedding in 1997. She starred with Hugh Grant in the 1999 film Notting Hill. That same year, she also starred in Runaway Bride, her second film with Richard Gere. Also in 1999, she starred in the critically panned film Stepmom alongside Susan Sarandon. In 2001, Roberts received the Academy Award for Best Actress for her portrayal of Erin Brockovich. Later in 2001, she starred in the road gangster comedy The Mexican alongside her longtime friend Brad Pitt. She then starred in the romantic comedy America’s Sweethearts that same year. Roberts would team up with Erin Brockovich director Steven Soderbergh for three more films: Ocean's Eleven (2001), Full Frontal (2002), and Ocean's Twelve (2004). In 2003, Roberts was paid an unprecedented $25 million for her role in the film, Mona Lisa Smile. The following year, she starred alongside Clive Owen, Natalie Portman and Jude Law in the critically acclaimed film Closer (2004), based on the 1997 award winning play by Patrick Marber. Roberts had two films released in 2006, The Ant Bully and Charlotte's Web. Both films were animated features for which she provided voice acting. Also in 2006, Roberts made her Broadway debut as Nan in a revival of Richard Greenberg's 1997 play Three Days of Rain opposite Bradley Cooper and Paul Rudd. Her next film was Charlie Wilson's War, with Tom Hanks (2007) and in 2008; she starred alongside Ryan Reynolds and Willem Dafoe in Fireflies in the Garden, which was released at the Berlin International Film Festival. In her next film, Roberts again starred with Clive Owen in the comedy-thriller Duplicity for which she received her seventh Golden Globe nomination. In 2010, she appeared in the ensemble romantic comedy Valentine's Day, with Bradley Cooper, and starred in the film adaptation of Eat Pray Love. As of 2011, Roberts is set to star alongside Tom Hanks in comedy-drama Larry Crowne. In addition to acting, Roberts has brought to life some of the books from American Girl as films, serving as executive producer alongside her sister Lisa. Roberts had become one of the highest-paid actresses in the world, topping the Hollywood Reporter's annual \"power list\" of top-earning female stars from 2005 to 2006. As of 2010, Roberts's net worth was estimated to be $140 million. Roberts is married to cameraman Daniel Moder. Together they have three children.","birthday":"1967-10-28"},{"name":"Pierce Brosnan","photos":[{"url":"http://image.tmdb.org/t/p/original/ihpZeNwh3Lexcy7oIeihRiSz6LW.jpg"},{"url":"http://image.tmdb.org/t/p/original/kiBmIxghB6vC4arQX1g1GKkdCXG.jpg"},{"url":"http://image.tmdb.org/t/p/original/pT2fviqp6X3IMHPBnWrqyD8vwug.jpg"},{"url":"http://image.tmdb.org/t/p/original/792GO8LFEDpCc4UA90dBacuXBmj.jpg"},{"url":"http://image.tmdb.org/t/p/original/witexDWuIDj0hlCJXXHq0bOatol.jpg"},{"url":"http://image.tmdb.org/t/p/original/A2VjhqFFGovqet8JKQz13MNbgL3.jpg"},{"url":"http://image.tmdb.org/t/p/original/pE52jEPBWkAyML5DnIlltQcKLzb.jpg"},{"url":"http://image.tmdb.org/t/p/original/pGeEdnXY0d11K0ds30bF3CIp60G.jpg"}],"biography":"Pierce Brendan Brosnan, OBE (16 May 1953) is an Irish actor, film producer and environmentalist who holds Irish and American citizenship. After leaving school at 16, Brosnan began training in commercial illustration, but trained at the Drama Centre in London for three years. Following a stage acting career he rose to popularity in the television series Remington Steele (1982–87).\n\nAfter Remington Steele, Brosnan took the lead in many films such as Dante's Peak and The Thomas Crown Affair. In 1995, he became the fifth actor to portray secret agent James Bond in the official film series, starring in four films between 1995 and 2002. He also provided his voice and likeness to Bond in the 2004 video game James Bond 007: Everything or Nothing. Since playing Bond, he has starred in such successes as The Matador (nominated for a Golden Globe, 2005), Mamma Mia! (National Movie Award, 2008), and The Ghost Writer (2010). In 1996, along with Beau St. Clair, Brosnan formed Irish DreamTime, a Los Angeles-based production company. In later years, he has become known for his charitable work and environmental activism.\n\nHe was married to Australian actress Cassandra Harris from 1980 until her death in 1991. He married American journalist and author Keely Shaye Smith in 2001, becoming an American citizen in 2004.","birthday":"1953-05-16"},{"name":"Cliff Robertson","photos":[{"url":"http://image.tmdb.org/t/p/original/brkuCYbMRJqPAucyIf3szNhA5h5.jpg"},{"url":"http://image.tmdb.org/t/p/original/kJLXCNcWMQX7jMGBraDKo3JYnHy.jpg"},{"url":"http://image.tmdb.org/t/p/original/7ex8aMhkJhxDuS5Kvpm0jwZbNKs.jpg"},{"url":"http://image.tmdb.org/t/p/original/7ex8aMhkJhxDuS5Kvpm0jwZbNKs.jpg"}],"biography":"From Wikipedia, the free encyclopedia  Clifford Parker \"Cliff\" Robertson, III (born September 9, 1923) is an American actor with a film and television career that spans half of a century. Robertson won the 1968 Academy Award for Best Actor for his role in the movie Charly. His most recent film roles were as \"Uncle Ben Parker\" in the Spider-Man film series.  Description above from the Wikipedia article Cliff Robertson, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1923-09-09"},{"name":"Famke Janssen","photos":[{"url":"http://image.tmdb.org/t/p/original/zGnbcZOdy9ZKk0bamPfzkhqq0Xx.jpg"},{"url":"http://image.tmdb.org/t/p/original/oMWKQtyTDkn5UEzziRqbIkdEWui.jpg"},{"url":"http://image.tmdb.org/t/p/original/xGsT7Os6RFI6bTPTToBCdPkXX1W.jpg"},{"url":"http://image.tmdb.org/t/p/original/h7GMyajklMJO7Ex2hfSkeeNtyyV.jpg"},{"url":"http://image.tmdb.org/t/p/original/shSWQ91FNeHjgO4eygCxFA0zwxD.jpg"},{"url":"http://image.tmdb.org/t/p/original/9YHoMbJoS1gRf5sFd6V4KWOwTlU.jpg"},{"url":"http://image.tmdb.org/t/p/original/7YiRUUgpGlGVofcMJ1LFd1zYFao.jpg"}],"biography":"Famke Beumer Janssen (pron.: /ˈfɑːmkə ˈjænsən/; born 5 November 1965) is a Dutch actress, director, screenwriter, and former fashion model. She is known for playing the villainous Bond girl Xenia Onatopp in GoldenEye (1995), Jean Grey/Phoenix in the X-Men film series (2000–2013), and Lenore Mills in Taken (2008), and its sequel, Taken 2 (2012). In 2008, she was appointed a Goodwill Ambassador for Integrity by United Nations. She made her directorial debut with Bringing Up Bobby in 2011.\n\n[Source: Wikipedia]","birthday":"1965-11-05"},{"name":"Gene Hackman","photos":[{"url":"http://image.tmdb.org/t/p/original/qEKcmwc1XstymEniGuCs3KIsGfP.jpg"},{"url":"http://image.tmdb.org/t/p/original/npCKZylNfITsstSLGiGC7VuSLjg.jpg"},{"url":"http://image.tmdb.org/t/p/original/oNlqdUXWzi8WdrG2ox7QJjGD7sA.jpg"},{"url":"http://image.tmdb.org/t/p/original/od670x0f93SfODt6NesrwivqrHE.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nEugene Allen \"Gene\" Hackman (born January 30, 1930) is a retired American actor and novelist.\n\nNominated for five Academy Awards, winning two, Hackman has also won three Golden Globes and two BAFTAs in a career that spanned four decades. He first came to fame in 1967 with his performance as Buck Barrow in Bonnie and Clyde. His major subsequent films include I Never Sang for My Father (1970); his role as Jimmy \"Popeye\" Doyle in The French Connection (1971) and its sequel French Connection II (1975); The Poseidon Adventure (1972); The Conversation (1974); A Bridge Too Far (1977); his role as arch-villain Lex Luthor in Superman (1978), Superman II (1980), and Superman IV: The Quest for Peace (1987); Under Fire (1983); Twice in a Lifetime (1985); Hoosiers (1986); No Way Out (1987); Mississippi Burning (1987); Unforgiven (1992); Wyatt Earp (1994); The Quick and the Dead, Crimson Tide and Get Shorty (all 1995); Enemy of the State (1998); The Royal Tenenbaums (2001); and his final film role before retirement, in Welcome to Mooseport (2004).\n\nDescription above from the Wikipedia article Gene Hackman, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1930-01-30"},{"name":"Woody Harrelson","photos":[{"url":"http://image.tmdb.org/t/p/original/9qm3h0sYJhEIKrhC8DrILQ2THU2.jpg"},{"url":"http://image.tmdb.org/t/p/original/kjh1CbAf5cTptG6ft6aOtT5pop0.jpg"},{"url":"http://image.tmdb.org/t/p/original/7RqTsm8NlqGx5ZjPmhdOYFhLqk2.jpg"},{"url":"http://image.tmdb.org/t/p/original/48xG8HX5DOo3GjpF6FbWJIkqh1O.jpg"},{"url":"http://image.tmdb.org/t/p/original/cXWp7AuzW2dmiwHfM362epUHTKG.jpg"}],"biography":"Woodrick Tracy \"Woody\" Harrelson (born July 23, 1961) is an American actor and comedian. Harrelson's breakthrough role came in the television sitcom Cheers as bartender Woody Boyd. Notable film characters include basketball hustler Billy Hoyle in White Men Can't Jump, bowler Roy Munson in Kingpin, serial killer Mickey Knox in Natural Born Killers, magazine publisher Larry Flynt in The People vs. Larry Flynt, country singer Dusty in A Prairie Home Companion, bounty hunter Carson Wells in No Country for Old Men, zombie killer Tallahassee in Zombieland, blind piano player/meat salesman Ezra Turner in Seven Pounds, conspiracy nut Charlie Frost in 2012, a delusional man who believes that he is a superhero named Defendor in Defendor and Cpt. Tony Stone in The Messenger. For The People vs. Larry Flynt and The Messenger, Harrelson earned Academy Award nominations for Best Actor and Best Supporting Actor, respectively. Description above from the Wikipedia article Woody Harrelson, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1961-07-23"},{"name":"Gerard Butler","photos":[{"url":"http://image.tmdb.org/t/p/original/wRKkVe5uugkx4KnmphBSjJUWPTo.jpg"},{"url":"http://image.tmdb.org/t/p/original/ezRgcFS6wjv9XfBfnCw7H6Ruytg.jpg"},{"url":"http://image.tmdb.org/t/p/original/wZDpT4wQlD0SgFN1p37Q0GGra44.jpg"},{"url":"http://image.tmdb.org/t/p/original/xstsB3SXLpO8JPVVC2lGWSWlCNV.jpg"}],"biography":"Gerard James Butler (born 13 November 1969) is a Scottish actor who has appeared on film, stage, and television.\n\nA trained lawyer, Butler turned to acting in the mid-1990s with small roles in productions such as the James Bond film Tomorrow Never Dies (1997), which he followed with steady work on television, most notably in the American miniseries Attila (2001).\n\nHe garnered critical acclaim for his breakthrough work as the lead in Joel Schumacher's 2004 film adaptation of the musical The Phantom of the Opera. In 2007, Butler gained worldwide recognition through his portrayal of King Leonidas in the film 300. Since then, he has appeared in projects including P.S. I Love You (2007), Nim's Island (2008), RocknRolla (2008), The Ugly Truth (2009), Gamer (2009), Law Abiding Citizen (2009), The Bounty Hunter (2010), and How to Train Your Dragon (2010). Description above from the Wikipedia article Gerard Butler, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1969-11-13"},{"name":"James McAvoy","photos":[{"url":"http://image.tmdb.org/t/p/original/vlFpTsXSmyaAXHTj2aA4bf0jQnu.jpg"},{"url":"http://image.tmdb.org/t/p/original/26UEbgEJ8sH3JUgQd6qDaNnJEbS.jpg"},{"url":"http://image.tmdb.org/t/p/original/gH3YT7191SxCx5RtKeFXOlaBgaq.jpg"},{"url":"http://image.tmdb.org/t/p/original/x58NHalu5FIYH6JPkGAri4S81gh.jpg"},{"url":"http://image.tmdb.org/t/p/original/iJghZruMECvdKl0ueC8LrfjSU96.jpg"},{"url":"http://image.tmdb.org/t/p/original/3VSa7p5luALustAiVd7p8a1tlys.jpg"},{"url":"http://image.tmdb.org/t/p/original/723hDDkWbTyEwHNy9Gau4FE2jLp.jpg"},{"url":"http://image.tmdb.org/t/p/original/eYKkyZkugT59m36s4gooHGDMpoe.jpg"},{"url":"http://image.tmdb.org/t/p/original/lNhx9cyNsffQpDDJKr0IA2P8tSp.jpg"},{"url":"http://image.tmdb.org/t/p/original/ozIsq1sNpE9D0dQaKe37o5GQKLh.jpg"},{"url":"http://image.tmdb.org/t/p/original/j2nxpnl3AwxMQtsW0VjJ6oH2u70.jpg"},{"url":"http://image.tmdb.org/t/p/original/i0UMOUxhILfRx8xr4k6iJcEUp2p.jpg"}],"biography":"​From Wikipedia, the free encyclopedia.\n\nJames Andrew McAvoy  (born 21 April 1979) is a Scottish stage and screen actor. His best-known work includes the films The Last King of Scotland and Atonement, both of which earned him BAFTA Award nominations, and the TV series Shameless. McAvoy has won the BAFTA Rising Star Award and a BAFTA Scotland award. He has also been nominated for an ALFS Award, a European Film Award, and a Golden Globe award.\n\nDescription above from the Wikipedia article James McAvoy, licensed under CC-BY-SA, full list of contributors on Wikipedia","birthday":"1979-04-21"},{"name":"Bruce Willis","photos":[{"url":"http://image.tmdb.org/t/p/original/kI1OluWhLJk3pnR19VjOfABpnTY.jpg"},{"url":"http://image.tmdb.org/t/p/original/zoTPQXh3qLd0Nj8JCVZqdWowQw7.jpg"},{"url":"http://image.tmdb.org/t/p/original/szRtf6oUR9cT6whTbRc5sCQGi8a.jpg"},{"url":"http://image.tmdb.org/t/p/original/5V9vDRFw7MWt0TNTDbLSc6NN0Dw.jpg"},{"url":"http://image.tmdb.org/t/p/original/j5QJ0UNqBeu7goKUrpfwCRQG7wU.jpg"}],"biography":"Walter Bruce Willis, better known as Bruce Willis, is an American actor and producer. His career began in television in the 1980s and has continued both in television and film since, including comedic, dramatic, and action roles. He is well known for the role of John McClane in the Die Hard series.\n\nWillis was born in Idar-Oberstein, West Germany, the son of a Kassel-born German, Marlene, who worked in a bank, and David Willis, an American soldier. Willis is the eldest of four children.\n\nAt the premiere for the film Stakeout, Willis met actress Demi Moore. They married on November 21, 1987 and had three daughters before the couple divorced on October 18, 2000.\n\nSince the divorce he has dated models Maria Bravo Rosado and Emily Sandberg; he was engaged to Brooke Burns until they broke up in 2004 after ten months together. He married Emma Heming on March 21, 2009.","birthday":"1955-03-19"},{"name":"Sigourney Weaver","photos":[{"url":"http://image.tmdb.org/t/p/original/gxBIAr3CnBjkNRoPovVJCvEGqP0.jpg"},{"url":"http://image.tmdb.org/t/p/original/uXUxgbWWdHnUDLYFNg4jviTjTnq.jpg"},{"url":"http://image.tmdb.org/t/p/original/hSMEOTRb8Ut6iR5G2IjC2BS0iYa.jpg"},{"url":"http://image.tmdb.org/t/p/original/wlg55BTcp3kqfTb3zDtqOFyqhDR.jpg"},{"url":"http://image.tmdb.org/t/p/original/66nTZ5zsiGNiYiztpcf6ORJ8Hos.jpg"},{"url":"http://image.tmdb.org/t/p/original/zb8EJ9b1vBVoYnkF94U5LJgzO4F.jpg"},{"url":"http://image.tmdb.org/t/p/original/2paG1UPL3QxKr0jlo71gsEXudgx.jpg"}],"biography":"Sigourney Weaver (born October 8, 1949, height 5' 11\" (1,80 m)) is an American actress best known for her role as Ellen Ripley in the Alien film series, a role for which she has received worldwide recognition. Other notable roles include the Ghostbusters films, Gorillas in the Mist, The Ice Storm, Working Girl, Death and the Maiden, Prayers for Bobby and Avatar.\n\nShe is a three-time Academy Award nominee for her performances in Aliens (1986), Gorillas in the Mist (1988), and Working Girl (1988) winning Golden Globe Awards in the latter two films. Weaver has been called \"The Sci-Fi Queen\" by many on account of her many science fiction and fantasy films.","birthday":"1949-10-08"},{"name":"Kate Beckinsale","photos":[{"url":"http://image.tmdb.org/t/p/original/7nY6t4cIfTTBauYc9z9lBvmjtHz.jpg"},{"url":"http://image.tmdb.org/t/p/original/5dHSHnOZkY1ZKkx9OzE5Gy6BGJY.jpg"},{"url":"http://image.tmdb.org/t/p/original/5gYZdl13vzVnrFW93P6wnGlY9bq.jpg"},{"url":"http://image.tmdb.org/t/p/original/tYCW4fz8kS3i1v2kcWwda7WOPz9.jpg"},{"url":"http://image.tmdb.org/t/p/original/g8oqSS5A3ULOKsmEHqCfOnHJDc3.jpg"},{"url":"http://image.tmdb.org/t/p/original/65dTlhxeyKq98VMgCY4k2HLkwH1.jpg"},{"url":"http://image.tmdb.org/t/p/original/6sDaaLyWVLVjDeze6fgF9g2FDwM.jpg"},{"url":"http://image.tmdb.org/t/p/original/90fFSQpUf0m5NGc3nI1vI3N27aG.jpg"},{"url":"http://image.tmdb.org/t/p/original/39bVYB5jkZqjJWm2RsBzZt0BLCb.jpg"}],"biography":"Kathryn Bailey \"Kate\" Beckinsale is an English actress. She first gained notice, while a student at Oxford University, for making her debut in the film adaptation of Shakespeare's Much Ado About Nothing. Throughout the 1990s, she worked on both film and television, most notably by portraying the title character in the 1996 BBC television series Emma. In 2001, Beckinsale garnered international recognition when she was cast as the romantic lead opposite Ben Affleck in her breakthrough film, Pearl Harbor (2001). Since then, she has portrayed a variety of characters in projects such as Underworld (2003), The Aviator (2004), and Van Helsing (2004). In 2008, she earned a Critic's Choice Award nomination for her performance in Nothing But the Truth. Born in Finsbury Park, London, Beckinsale is the daughter of actor Richard Beckinsale, who died from a heart attack in 1979, and actress Judy Loe. She has a paternal half-sister, Samantha, who is also an actress. Her paternal grandfather was half Burmese, and she has said that she was \"very oriental-looking\" as a child.","birthday":"1973-07-26"},{"name":"Danny Glover","photos":[{"url":"http://image.tmdb.org/t/p/original/42TMGmTGgCvVtHMEmueUgLylUeO.jpg"},{"url":"http://image.tmdb.org/t/p/original/AevopuJHyFS9Ywf3D7ymyE9CicW.jpg"},{"url":"http://image.tmdb.org/t/p/original/jSNTEnm0Sxm8FRtoBfJmhmQyozH.jpg"}],"biography":"From Wikipedia, the free encyclopedia\n\nDanny Lebern Glover (born July 22, 1946) is an American actor, film director, and political activist. Glover is perhaps best known for his roles as Detective Roger Murtaugh in the Lethal Weapon film franchise.\n\nDescription above from the Wikipedia article Danny Glover, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1946-07-22"},{"name":"Clancy Brown","photos":[{"url":"http://image.tmdb.org/t/p/original/pwiG1ljLoqfcmFH2zFp5NP2ML4B.jpg"},{"url":"http://image.tmdb.org/t/p/original/dWXiusNVmRArPEWUzZU81gA02TQ.jpg"},{"url":"http://image.tmdb.org/t/p/original/qlVLsKdg6lC4YJ5dTcB1QwnDpfa.jpg"},{"url":"http://image.tmdb.org/t/p/original/p3NpzBVNm0tMBHqbtGfLKgH51ST.jpg"},{"url":"http://image.tmdb.org/t/p/original/zJW6YxbZ5NANqDwIbN5hWDPrln3.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nClarence J. \"Clancy\" Brown III (born January 5, 1959 height 6' 3½\" (1,92 m)) is an American film, television and voice actor. He is known for his live-action roles as Captain Byron Hadley in the award-winning The Shawshank Redemption; The Kurgan in the film Highlander; Brother Justin Crowe in HBO's critically acclaimed Carnivàle and Career Sergeant Zim in Starship Troopers. Brown is most famous for providing the voices of animated characters such as Mr. Eugene H. Krabs in the animated series SpongeBob SquarePants; Lex Luthor throughout various DC projects; Captain Black and Ratso in Jackie Chan Adventures; Otto in Super Robot Monkey Team Hyperforce Go!; Dr. Neo Cortex in the original Crash Bandicoot video games and Savage Opress in Star Wars: The Clone Wars. Early life\n\nBrown was born in Urbana, Ohio in 1959 and had an older sister Beth (1958–1965). Their mother Joyce (née Eldridge) was a conductor, composer, and concert pianist. Their father Clarence J. \"Bud\" Brown, Jr. helped manage the Brown Publishing Company, the family-owned newspaper business started by Clancy's grandfather, Congressman Clarence J. Brown. From 1965 to 1983 Bud Brown also served as a US Congressman, and later as chairman of the board of Brown Publishing. The family operated the business until 2010.Brown graduated from St. Albans School in Washington, D.C., as his family lived there much of the time when his father served in Congress. He earned a scholarship to Northwestern University, where he became a member of the Sigma Chi Fraternity.\n\nBrown is often cast in roles of villains or authority figures. His career has tended to alternate among mainstream TV/cable; major-studio and independent-studio movies; and a large repertoire of voice work for animated and video game roles.\n\nPersonal life\n\nBrown has been married to Jeanne Johnson since 1993; they have a son and daughter.","birthday":"1959-01-05"},{"name":"Frances McDormand","photos":[{"url":"http://image.tmdb.org/t/p/original/jodV4NuQAvxQWIHxqnop1jUX77N.jpg"},{"url":"http://image.tmdb.org/t/p/original/wJMOOPSGT3570psxm0K1OFEsUo.jpg"},{"url":"http://image.tmdb.org/t/p/original/998HnAg7HsxlH7SJy9pURlMmSW1.jpg"},{"url":"http://image.tmdb.org/t/p/original/heJwM65BLMfJGcXuphhZiv9unTo.jpg"}],"biography":"American film, stage and television actress Frances Louise\nMcDormand began her career on stage and made her screen debut in the 1984 film Blood\nSimple having since appeared in several theatrical and television roles.\n\nMcDormand has been recognized for her performances in Mississippi\nBurning, Almost Famous, and North Country and was nominated for four Golden\nGlobes, four Academy Awards, three BAFTA Awards, and an Emmy award. She won the\nAcademy Award for Best Actress in 1996 for her role as Marge Gunderson in\nFargo.  She also won Best Supporting\nActress from the Broadcast Film Critics Association, the Florida Film Critics\nCircle, and the Los Angeles Film Critics Association for her performance in\nWonder Boys (2000). McDormand returned to the stage in the David Lindsay-Abaire\nplay Good People on Broadway from February 8, 2011 to April 24, 2011.\n\nMcDormand has been married to director Joel Coen since 1984,\nthey reside in New York City along with their adopted son Pedro. ","birthday":"1957-06-23"},{"name":"Vin Diesel","photos":[{"url":"http://image.tmdb.org/t/p/original/qwyfzMKIhxJ7ols66FgEf7eGdcI.jpg"},{"url":"http://image.tmdb.org/t/p/original/3RdYMTLoL1X16djGF52cFtJovDT.jpg"},{"url":"http://image.tmdb.org/t/p/original/ndRu249xQrsyLBOVNKP7RvPtCyn.jpg"},{"url":"http://image.tmdb.org/t/p/original/S8zM18TqzG0qlg1ly5nOEUjCqW.jpg"},{"url":"http://image.tmdb.org/t/p/original/cZ4VR2eV5qTfceRxukYAMT2HWlJ.jpg"},{"url":"http://image.tmdb.org/t/p/original/7HUKBKr0XRW8xlLAxPHYzBb8G1V.jpg"}],"biography":"Vin Diesel is an American actor, producer, director, and screenwriter. He came to prominence in the late 1990s, and first became known for appearing in Steven Spielberg's Saving Private Ryan in 1998. He is most known for his portrayals of Riddick in The Chronicles of Riddick trilogy (2001–2013), and of Dominic Toretto in The Fast and the Furious film series (2001–present), two franchises in which he also acted as producer. He also starred in xXx (2002) and Sidney Lumet's Find Me Guilty (2006). His voice acting work includes Brad Bird's The Iron Giant (1999), the video games of The Chronicles of Riddick franchise, and the upcoming Guardians of the Galaxy adaptation of the Marvel comics of the same name. As a filmmaker, Diesel directed, wrote, produced and starred in the drama film Strays, as well as in two short films. He is also the founder of the production companies One Race Films, Racetrack Records, and Tigon Studios.\n\nFrom Wikipedia","birthday":"1967-07-18"},{"name":"Elijah Wood","photos":[{"url":"http://image.tmdb.org/t/p/original/c4fB3WAS7jN78rihw2kB81v6sez.jpg"},{"url":"http://image.tmdb.org/t/p/original/r3XfDLyaaMb3RKWcsmGggRTMEhe.jpg"},{"url":"http://image.tmdb.org/t/p/original/qwWrgijNw23w3nVcHyP1O1SRhi7.jpg"},{"url":"http://image.tmdb.org/t/p/original/6dvNdfUJof0DxXDAL8fYojO5UrG.jpg"},{"url":"http://image.tmdb.org/t/p/original/vAYpEfdK892aM2xqJ2O0QQgWRih.jpg"},{"url":"http://image.tmdb.org/t/p/original/y9PuwU2B9lm6YbRqhzl5Lg7k6Vi.jpg"}],"biography":"Elijah Jordan Wood ( born January 28, 1981) is an American actor. He made his film debut with a minor part in Back to the Future Part II (1989), then landed a succession of larger roles that made him a critically acclaimed child actor by age 9. He is best known for his high-profile role as Frodo Baggins in Peter Jackson's critically acclaimed The Lord of the Rings trilogy. Since then, he has resisted typecasting by choosing varied roles in critically acclaimed films such as Bobby, Eternal Sunshine of the Spotless Mind, Sin City, Green Street and Everything Is Illuminated. He starred in the film Day Zero (2007) and provided the voice of the main character, Mumble, in the award-winning animated film Happy Feet. He played an American tourist turned vampire in Paris, je t'aime. In 2005, he started his own record label, Simian Records. He was cast in the lead role of an Iggy Pop biopic to be called The Passenger, but after years of development, the project now appears to be shelved.\n\nDescription above from the Wikipedia article Elijah Wood, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1981-01-28"},{"name":"James Caan","photos":[{"url":"http://image.tmdb.org/t/p/original/g4bxNXWft1jLZX8gKk4G6ypkTUf.jpg"},{"url":"http://image.tmdb.org/t/p/original/pOWD208UoTOMljUsmV69wcu1zN8.jpg"},{"url":"http://image.tmdb.org/t/p/original/2oCVwcp2xymKo32KXzpCdd8hvTu.jpg"},{"url":"http://image.tmdb.org/t/p/original/45YBILiM87XPrF5Tw77hwNWFxWk.jpg"},{"url":"http://image.tmdb.org/t/p/original/meFNtKexQKIarIpg1qhDscyt1t4.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nJames Caan  (born March 26, 1940) is an American actor. He is best-known for his starring roles in The Godfather, Thief, Misery, A Bridge Too Far, Brian's Song, Rollerball, Kiss Me Goodbye, Elf, and El Dorado. He also starred as \"Big Ed\" Deline in the television series Las Vegas.","birthday":"1940-03-26"},{"name":"Anne Hathaway","photos":[{"url":"http://image.tmdb.org/t/p/original/fFknpgRCCyzE3SAotzm02IvxHVx.jpg"},{"url":"http://image.tmdb.org/t/p/original/9cRFZOcyLCHCSJvFCZCnVPoeoRh.jpg"},{"url":"http://image.tmdb.org/t/p/original/mRBYFpi5DdSo1mzSDesurXl5Qw9.jpg"},{"url":"http://image.tmdb.org/t/p/original/rgRR3Xhbz7ka0OC3HKMIRHnlbbp.jpg"},{"url":"http://image.tmdb.org/t/p/original/fVTWJMjMDjdFJC4J0RjyKatKbSo.jpg"},{"url":"http://image.tmdb.org/t/p/original/lv988iZU9eBqj9yVoa6sKX9HcO3.jpg"},{"url":"http://image.tmdb.org/t/p/original/3LrDNcdtfd8wP7Nl53a8HsVWYxz.jpg"},{"url":"http://image.tmdb.org/t/p/original/dqlAZDSUCaFpFGE4VaRWhv5TTlC.jpg"},{"url":"http://image.tmdb.org/t/p/original/2jrgonBBztT8W209xEMqdq3dJoQ.jpg"},{"url":"http://image.tmdb.org/t/p/original/tCLYPoQPMSqqxp3rZDjZePJjqnF.jpg"},{"url":"http://image.tmdb.org/t/p/original/aGPaduoEBRB4diLfu5XW8pGYc6I.jpg"},{"url":"http://image.tmdb.org/t/p/original/nBtmMKuLBKqxx9ZYiamzqJXRmzu.jpg"},{"url":"http://image.tmdb.org/t/p/original/xENM3XJAtdpolwELYDy9iaCtU4m.jpg"},{"url":"http://image.tmdb.org/t/p/original/sEvs9JeK2sTAu0PSxgvL9WSk66K.jpg"},{"url":"http://image.tmdb.org/t/p/original/jAlF838pfGFpC5gUFomj2TPcTIh.jpg"},{"url":"http://image.tmdb.org/t/p/original/sCHncKtqimicSOMDnizBBFnRYbl.jpg"},{"url":"http://image.tmdb.org/t/p/original/nrj4TieYy9dp0oNDTEARFQ5ro3q.jpg"},{"url":"http://image.tmdb.org/t/p/original/yXDkhihLaw4eLkKHkNviTL0Xa4X.jpg"},{"url":"http://image.tmdb.org/t/p/original/dhFSEzrhOdzWXv2c8pDabAwGzqY.jpg"},{"url":"http://image.tmdb.org/t/p/original/jnUPTfWyWK8fa1G72ViQLOG9jr4.jpg"},{"url":"http://image.tmdb.org/t/p/original/r95MfssT4Dr12sthxdUfWXy8p0e.jpg"},{"url":"http://image.tmdb.org/t/p/original/7obqkzJEuiwxXgImu7KsU3GkmOD.jpg"}],"biography":"From Wikipedia, the free encyclopedia\n\nAnne Jacqueline Hathaway (born November 12, 1982) is an American actress. After several stage roles, she appeared in the 1999 television series Get Real. She played Mia Thermopolis in The Princess Diaries (2001). Over the next three years, Hathaway reprised that role for The Princess Diaries 2: Royal Engagement, and starred in family films, appearing as the title character in Ella Enchanted, both in 2004.\n\nHathaway had dramatic roles in Havoc and Brokeback Mountain, both in 2005. She starred in The Devil Wears Prada (2006) and in Becoming Jane (2007) as Jane Austen. In 2008, she was acclaimed for her lead role in Rachel Getting Married, for which she won awards and was nominated for the Academy Award for Best Actress. In 2010, she starred in the box office hits Valentine's Day and Tim Burton's Alice In Wonderland, as well as Love and Other Drugs. In 2011, she had a voice role in the animated box office Rio. She is scheduled to play Selina Kyle/Catwoman in Christopher Nolan's The Dark Knight Rises.\n\nPeople magazine named her one of its breakthrough stars of 2001, and she first appeared on its list of the world's 50 Most Beautiful People in 2006.\n\nDescription above from the Wikipedia article Anne Hathaway (actress), licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1982-11-12"},{"name":"Keye Luke","photos":[{"url":"http://image.tmdb.org/t/p/original/1mnlwICoRFyz6nmER2MGtXgocWk.jpg"},{"url":"http://image.tmdb.org/t/p/original/6z0PUG54c9DV3H3wB7lHnfsDiqy.jpg"}],"biography":null,"birthday":"1904-06-18"},{"name":"Shia LaBeouf","photos":[{"url":"http://image.tmdb.org/t/p/original/anP0tygzniIok6L3OxcSZ9TYCF3.jpg"},{"url":"http://image.tmdb.org/t/p/original/fc6q2rJqKW1r6CC7x7SoZbBHu7c.jpg"},{"url":"http://image.tmdb.org/t/p/original/u27LB3YxgiDo3DrIsFMKI3pP4Dg.jpg"},{"url":"http://image.tmdb.org/t/p/original/cFNNkVCIJY7J4J2z4DIpQTxsJZx.jpg"},{"url":"http://image.tmdb.org/t/p/original/s7ntMknvODKR0q1HJATgXnfTdzE.jpg"},{"url":"http://image.tmdb.org/t/p/original/6dqxucKnrqCwWNnwC37ckNfTJkZ.jpg"}],"biography":"Shia Saide LaBeouf is an American actor, voice actor, and comedian. LaBeouf began his comedy career when he was 10 years old, and then launched his acting career in 1998 at the age of 12. He became known among younger audiences for his part in the Disney Channel series Even Stevens, also appearing in three Disney TV movies. In 2003, LaBeouf made his theatrical film debut in Holes, also appearing in the lead role in The Battle of Shaker Heights that same year.\n\nIn 2005, LaBeouf made his transition into more mature roles with The Greatest Game Ever Played. In 2007, he starred as the leads in Disturbia and Transformers, and the following year he appeared in Indiana Jones and the Kingdom of the Crystal Skull as Indiana's son. In 2009, LaBeouf reprised his role as Sam Witwicky in the Transformers sequel Transformers: Revenge of the Fallen, and appeared in New York, I Love You. His upcoming films include the lead roles in Wall Street: Money Never Sleeps, Transformers 3 and The Associate. In 2004, he made his directorial debut by directing \"Lets Love Hate\" with Lorenzo Eduardo. Five years later he also directed Cage's music video for the single \"I Never Knew You\". LaBeouf has been in one long-term relationship, which began in 2004 and lasted three years. He is currently in a relationship with Carey Mulligan; the two began dating in the summer of 2009. In November 2007, LaBeouf was arrested for misdemeanor criminal trespassing in a Chicago Walgreens after refusing to leave; the criminal charges were dropped the following month. In July 2008, LaBeouf was involved in a car accident, which was caused by the other driver. LaBeouf was arrested at the scene of the car accident for misdemeanor drunk driving, and his driver's license was suspended for one year because he refused a breathalyzer examination. As a result of the injuries he sustained from the accident, he has undergone multiple surgeries on his left hand, which has permanent damage and scarring.","birthday":"1986-06-11"},{"name":"John Carradine","photos":[{"url":"http://image.tmdb.org/t/p/original/iWHObxmwHuUS7g4uJFT2SS2hHXu.jpg"},{"url":"http://image.tmdb.org/t/p/original/iv9pZ2JRddIUNe2RgYAKmUR55WO.jpg"},{"url":"http://image.tmdb.org/t/p/original/iv9pZ2JRddIUNe2RgYAKmUR55WO.jpg"}],"biography":"From Wikipedia, the free encyclopedia\n\nJohn Carradine (born Richmond Reed Carradine; February 5, 1906 – November 27, 1988) was an American actor, best known for his roles in horror films and Westerns as well as Shakespearean theater. He was one of the most prolific character actors in Hollywood history and the patriarch of an acting dynasty that includes four of his sons and four of his grandchildren.\n\nDescription above from the Wikipedia article John Carradine, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1906-02-05"},{"name":"Liam Neeson","photos":[{"url":"http://image.tmdb.org/t/p/original/59cs4jtsUkzsUZDkLjeEH8Emkf8.jpg"},{"url":"http://image.tmdb.org/t/p/original/oVHFXLhJ0tmR9IQ420P4gMRtHk0.jpg"},{"url":"http://image.tmdb.org/t/p/original/tqrkCNJKDQ4rhFLRlh1y4Xykpba.jpg"},{"url":"http://image.tmdb.org/t/p/original/u0FoylMRZU0gJG2cmIKHZMPLWTw.jpg"},{"url":"http://image.tmdb.org/t/p/original/f00vogoZH3Aypz1ky3trY1SYsFT.jpg"}],"biography":"William John \"Liam\" Neeson OBE (born 7 June 1952) is an Irish actor who has been nominated for an Oscar, a BAFTA and three Golden Globe Awards.\n\nHe has starred in a number of notable roles including Oskar Schindler in Schindler's List, Michael Collins in Michael Collins, Peyton Westlake in Darkman, Jean Valjean in Les Misérables, Qui-Gon Jinn in Star Wars Episode I: The Phantom Menace, Alfred Kinsey in Kinsey, Ras Al Ghul in Batman Begins and the voice of Aslan in The Chronicles of Narnia film series. He has also starred in several other notable films, from major Hollywood studio releases (ie. Excalibur, The Dead Pool, Nell, Rob Roy, The Haunting, Love Actually, Kingdom of Heaven, Taken, Clash of the Titans, The A-Team, Unknown) to smaller arthouse films (ie. Deception, Breakfast on Pluto, Chloe).\n\nHe was born in Ballymena, County Antrim, Northern Ireland and educated at Saint Patrick's College, Ballymena Technical College and Queen's University Belfast. He moved to Dublin after university to further his acting career, joining the renowned Abbey Theatre. In the early 1990s, he moved again to the United States, where the wide acclaim for his performance in Schindler's List led to more high-profile work. He is widowed and lives in New York with his two sons.\n\nDescription above from the Wikipedia article Liam Neeson, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1952-06-07"},{"name":"Jim Caviezel","photos":[{"url":"http://image.tmdb.org/t/p/original/lTMYovuTJcaT2coWEHqpkyD7aJ7.jpg"},{"url":"http://image.tmdb.org/t/p/original/oK45UnNJezfBWJEyzv8x7FtD03n.jpg"},{"url":"http://image.tmdb.org/t/p/original/ngIaGBVPqPBJ6tUY72y1SoaYl64.jpg"},{"url":"http://image.tmdb.org/t/p/original/kiN9h4hbjxyHVyPdT629kxNhPKU.jpg"},{"url":"http://image.tmdb.org/t/p/original/5XqzAJEjCdOphCzSpTib8Tvcvny.jpg"},{"url":"http://image.tmdb.org/t/p/original/5F9tvdKOyzoO2dvfzZyxDuJBjFZ.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nJames Patrick Caviezel, Jr. (born September 26, 1968) is an American film actor, sometimes credited as Jim Caviezel. He is known for the roles of Jesus Christ in the 2004 film The Passion of the Christ, Bobby Jones in Bobby Jones: A Stroke of Genius, Edmond Dantès in The Count of Monte Cristo, Catch in Angel Eyes and Private Witt in The Thin Red Line.\n\nDescription above from the Wikipedia article James Caviezel, licensed under CC-BY-SA, full list of contributors on Wikipedia​","birthday":"1968-09-26"},{"name":"Warren Ellis","photos":[],"biography":"","birthday":"1968-02-16"},{"name":"Monica Bellucci","photos":[{"url":"http://image.tmdb.org/t/p/original/q43uYYScKuxtoKb1xtwGlWurpe2.jpg"},{"url":"http://image.tmdb.org/t/p/original/6UajY6KO7zwXyklRxPDxCCPfvUR.jpg"},{"url":"http://image.tmdb.org/t/p/original/iS2xgJ9QBDYsb0CPEY3qyc0AqLb.jpg"},{"url":"http://image.tmdb.org/t/p/original/wKGbdFZZOCgEq1XO3NFaBiuRD5S.jpg"},{"url":"http://image.tmdb.org/t/p/original/jHYrCpvWEB6zLjzTc7Fr5CxI3gi.jpg"},{"url":"http://image.tmdb.org/t/p/original/206QvYXy5qcPkEMZ2EPxTw8Vwtj.jpg"},{"url":"http://image.tmdb.org/t/p/original/lLrokXfUyTsZs723dKp0Eggi5oc.jpg"},{"url":"http://image.tmdb.org/t/p/original/dc81Ds6MbwzQgoOp18ZikMU7ZJN.jpg"},{"url":"http://image.tmdb.org/t/p/original/xEnw4SkHjR4M2jxLbzn0dlHRhWf.jpg"},{"url":"http://image.tmdb.org/t/p/original/fJPgCame5aOuH1ukx6yZbYyrj7i.jpg"},{"url":"http://image.tmdb.org/t/p/original/yHdu4dGZQNToGKG3H0tDzNC0f3T.jpg"},{"url":"http://image.tmdb.org/t/p/original/dcECyxyQGKvtStOSZIUGzYhZEKq.jpg"},{"url":"http://image.tmdb.org/t/p/original/oYwHzFolJ5qbz6fKVY1KS05L66h.jpg"},{"url":"http://image.tmdb.org/t/p/original/f1lhZSkcN5hHLf4Qq1enSCpZCLj.jpg"},{"url":"http://image.tmdb.org/t/p/original/8UTZ1tOY9XCAjb5G2eEvvTxvG6V.jpg"},{"url":"http://image.tmdb.org/t/p/original/1rellBDeZyNKlkifjpUpOw6zIrH.jpg"},{"url":"http://image.tmdb.org/t/p/original/eRZr9vovvLZxQDlIZuIXYpUa5m5.jpg"},{"url":"http://image.tmdb.org/t/p/original/f3Ajum5ZUzSmHfoHI1ozHWGKPAT.jpg"},{"url":"http://image.tmdb.org/t/p/original/8vJUC5lzPlR4NEaeSeDqrzsUsM.jpg"},{"url":"http://image.tmdb.org/t/p/original/dofKosepJLCN8HDphQcDkJSJ7BC.jpg"},{"url":"http://image.tmdb.org/t/p/original/up8mIHyQZPRb3MYHtFJ63y5e0a2.jpg"},{"url":"http://image.tmdb.org/t/p/original/7ucvCVITNtI20JxeCGzjfbk1uBN.jpg"},{"url":"http://image.tmdb.org/t/p/original/dZMduzfchg4KaZ9ZMTA2pwgZNte.jpg"},{"url":"http://image.tmdb.org/t/p/original/9DmhXv3a2x0GheLX5th8DDeKNEG.jpg"},{"url":"http://image.tmdb.org/t/p/original/5LnSjCmy4Fka1cy6qxvXnrq2xO4.jpg"}],"biography":"Monica Bellucci (born 30 September 1964) is an Italian actress and fashion model.\n\nBellucci's film career began in the early 1990s. She played some minor roles in La Riffa (1991) and Bram Stoker's Dracula (1992).\n\nIn 1996 she was nominated for a César Award for best supporting actress for her portrayal of Lisa in The Apartment and strengthened her position as an actress. She became known and popular with worldwide audiences, following her roles in Malèna (2000), Brotherhood of the Wolf, \"Under Suspicion\", and Irréversible (2002). She has since played in many films from Europe and Hollywood like Tears of the Sun (2003), The Matrix Reloaded (2003), The Passion of the Christ (2004), The Brothers Grimm (2005), Le Deuxième souffle (2007), Don't Look Back (2009), and The Sorcerer's Apprentice (2010).\n\nShe was supposed to be seen portraying Indian politician Sonia Gandhi in the biopic Sonia, originally planned for release in 2007, but it has been shelved. Bellucci dubbed her own voice for the French and Italian releases of the film Shoot 'Em Up (2007). She also voiced Kaileena in the video game Prince of Persia: Warrior Within, and the French voice of Cappy for the French version of the 2005 animated film Robots.\n\nEmpire magazine selected her as twenty-first on their list of \"The Sexiest 25 Characters in Cinema - The Women\" for her role of \"Persephone\" in the Matrix series.\n\nDescription above from the Wikipedia article Monica Bellucci, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1964-09-30"},{"name":"Val Kilmer","photos":[{"url":"http://image.tmdb.org/t/p/original/AlhPeiH8R4reMNGNQ9ag1FPbuW9.jpg"}],"biography":"Val Edward Kilmer (born December 31, 1959) is an American actor. Originally a stage actor, Kilmer became popular in the mid-1980s after a string of appearances in comedy films, starting with Top Secret! (1984), then the cult classic Real Genius (1985), as well as blockbuster action films, including a role in Top Gun and a lead role in Willow.\n\nDuring the 1990s, Kilmer gained critical respect after a series of films that were also commercially successful, including his roles as Jim Morrison in The Doors, Doc Holliday in 1993's Tombstone, Batman in 1995's Batman Forever, Chris Shiherlis in 1995's Heat and Simon Templar in 1997's The Saint. During the early 2000s, Kilmer appeared in several well-received roles, including The Salton Sea, Spartan, and supporting performances in Kiss Kiss Bang Bang, Alexander, and as the voice of KITT in Knight Rider.\n\nDescription above from the Wikipedia article Val Kilmer, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1959-12-31"},{"name":"Dennis Hopper","photos":[{"url":"http://image.tmdb.org/t/p/original/56nj2DfMVU3F9qUagZWMePLbrKF.jpg"},{"url":"http://image.tmdb.org/t/p/original/rq1n4dbFRXkaBspAbNzmNgyFMp.jpg"},{"url":"http://image.tmdb.org/t/p/original/6ALSbjV7w4VgZlS9xL4hXxVQ67a.jpg"},{"url":"http://image.tmdb.org/t/p/original/5SihBqB4HNPn0rmbjRs81ZLcTrp.jpg"},{"url":"http://image.tmdb.org/t/p/original/xzWhFUVTQ4umq8mfOeJlTvkftpU.jpg"}],"biography":"Dennis Lee Hopper (May 17, 1936 – May 29, 2010) was an American actor, filmmaker and artist. As a young man, Hopper became interested in acting and eventually became a student of the Actors' Studio. He made his first television appearance in 1954, and appeared in two films featuring James Dean, Rebel Without a Cause (1955) and Giant (1956). During the next 10 years, Hopper appeared frequently on television in guest roles, and by the end of the 1960s had played supporting roles in several films. He directed and starred in Easy Rider (1969), winning an award at the Cannes Film Festival and was nominated for an Academy Award for Best Original Screenplay as co-writer. \"With its portrait of counterculture heroes raising their middle fingers to the uptight middle-class hypocrisies, Easy Rider became the cinematic symbol of the 1960s, a celluloid anthem to freedom, macho bravado and anti-establishment rebellion.\" Film critic Matthew Hays notes that \"no other persona better signifies the lost idealism of the 1960s than that of Dennis Hopper.\" He was unable to build on his success for several years, until a featured role in Apocalypse Now (1979) brought him attention. He subsequently appeared in Rumble Fish (1983) and The Osterman Weekend (1983), and received critical recognition for his work in Blue Velvet and Hoosiers, with the latter film garnering him an Academy Award nomination for Best Supporting Actor. He directed Colors (1988) and played the villain in Speed (1994). Hopper's later work included a leading role in the television series Crash. Hopper's last performance was filmed just before his death: The Last Film Festival, slated for a 2011 release. Hopper was also a prolific and acclaimed photographer, a profession he began in the 1960s.\n\nDescription above from the Wikipedia article Dennis Hopper, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1936-05-17"},{"name":"Danny Trejo","photos":[{"url":"http://image.tmdb.org/t/p/original/7b8cDfrmeheQbgryfCm7MeJOxxM.jpg"},{"url":"http://image.tmdb.org/t/p/original/p88bF0qtdFE1xaSQxLtaQBkmVwk.jpg"},{"url":"http://image.tmdb.org/t/p/original/fFuXQYzzVrNl9u5EJFzSFIFsDGT.jpg"},{"url":"http://image.tmdb.org/t/p/original/46TvhlkX8s8R9OnuZyS8Up1sXsr.jpg"},{"url":"http://image.tmdb.org/t/p/original/p6d7KuMBi1IsIdfMbEwI1dzMjvJ.jpg"},{"url":"http://image.tmdb.org/t/p/original/1nBjgjOqvQgVzi52hkdFZLHKVaj.jpg"},{"url":"http://image.tmdb.org/t/p/original/dkll8h1uYzgmliLrnTE0429WLjp.jpg"},{"url":"http://image.tmdb.org/t/p/original/aUBFe6YveVufucbXza1lXORw4VX.jpg"}],"biography":"Dan \"Danny\" Trejo born May 16, 1944 - Height: 5' 7\" (1,70 m)) is an American actor who has appeared in numerous Hollywood films, often as hypermasculine characters, villains and anti-heroes. Some of his notable films include Heat, Con Air, Machete and Desperado, the latter two with frequent collaborator Robert Rodriguez. Early life\n\nDan Trejo was born in- the Echo Park neighborhood of Los Angeles, California. He is the son of Alice Rivera and Dan Trejo, a construction worker. He is of Alice Rivera and Dan Trejo, a construction worker. He is of Mexican descent. He is a second cousin of filmmaker Robert Rodriguez, though the two were unaware that they were related until the filming of Desperado.\n\nThroughout the 1960s, Trejo was in and out of jail and prison in California. There are conflicting accounts of his prison chronology. By one account, his final stint in custody ended in 1972; by another account, he did time in a juvenile offenders' camp and six California prisons between 1959 and 1969. He recalled that his last prison term was five years. While serving in San Quentin Prison, he became a champion boxer in lightweight and welterweight divisions within that prison.During this time, Trejo became a member of a twelve-step program, which he credits with his success in overcoming drug addiction. In 2011, he recalled that he had been sober for 42 years. Upon his final release he enrolled in Pitzer College located in Claremont, California but subsequently left after one semester of attendance.\n\nPersonal life\n\nTrejo is married to Debbie Shreve. He has four children: Danny Boy (b. 1981), Gilbert (b. 1988), Danielle (b. 1990), Jose (b. 1991) who are all from previous relationships. He also has a daughter Esmeralda M. Trejo who is married and has three children in Austin, Texas.\n\nDescription above from the Wikipedia article Danny Trejo, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1944-05-16"},{"name":"Kelsey Grammer","photos":[{"url":"http://image.tmdb.org/t/p/original/8h3ThicYhj6fEMSMtSdzFXrUyx2.jpg"},{"url":"http://image.tmdb.org/t/p/original/q9tw6lV9XlS66GeJr5bUT16odz6.jpg"},{"url":"http://image.tmdb.org/t/p/original/qvbLq1WqWAIiKGThnN6EmhGlWgz.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nAllen Kelsey Grammer (born February 21, 1955) is a 5-time Emmy Award-winning American actor and comedian. He is most widely known for his two-decade portrayal of psychiatrist Dr. Frasier Crane in the NBC sitcoms Cheers and Frasier. He has been nominated for fourteen Emmys, including one for playing his character on three sitcoms (the third being a guest appearance on Wings), as well as portraying the part on an episode of The John Larroquette Show, and has also worked as a television producer, director, writer, and as a voice artist. He has received many accolades for his role as the voice of Sideshow Bob on The Simpsons.\n\nDescription above from the Wikipedia article Kelsey Grammer, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1955-02-21"},{"name":"Jeremy Suarez","photos":[{"url":"http://image.tmdb.org/t/p/original/ktydBVBvNUlmfJj56aYwJ0O31JN.jpg"},{"url":"http://image.tmdb.org/t/p/original/ktydBVBvNUlmfJj56aYwJ0O31JN.jpg"},{"url":"http://image.tmdb.org/t/p/original/ojcgfafhW1m2V5ZMKE19X4o8Oj9.jpg"}],"biography":"​From Wikipedia, the free encyclopedia.  \n\nJeremy Steven Suarez (born July 6, 1990) is an American actor perhaps best known for his starring role of Jordan Thomkins, Bernie Mac's nephew, on The Bernie Mac Show. His first major movie role was in the 1996 film, Jerry Maguire, in which he played Tyson Tidwell, son of Cuba Gooding Jr.'s character Rod Tidwell. He had an uncredited role on Sister, Sister in 1996, on Season 4 episode, \"Kid-Napped\". He voiced Koda in Disney's 2003 movie Brother Bear and reprised the role in Brother Bear 2. He was amongst the thousands of mourners at the funeral of Bernie Mac and gave a heartfelt speech during the eulogy, appearing on Larry King Live in 2008 with his fellow cast to discuss the death of the man. Suarez is also a voice actor and has played roles in many television shows, such as The Wayans Bros., Chicago Hope and King of the Hill and has recently voiced a puppet on Nike commercials during the 2009 NBA Playoffs.\n\nDescription above from the Wikipedia article  Jeremy Suarez, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1990-07-06"},{"name":"Joel Kinnaman","photos":[{"url":"http://image.tmdb.org/t/p/original/kn3AcrSxa0ApgQVcjQ8m6YsWVq.jpg"},{"url":"http://image.tmdb.org/t/p/original/vZf9kSGtPeQ5LTavveY9czipDpC.jpg"},{"url":"http://image.tmdb.org/t/p/original/cDVzJp2fi5ZI88lOUJpY6IgpH7Y.jpg"},{"url":"http://image.tmdb.org/t/p/original/aylKCZLLFuuT9OB5RyaTtNBr0kn.jpg"},{"url":"http://image.tmdb.org/t/p/original/vTxJ2sYb5T7msyPjvNM4eaVgeTu.jpg"},{"url":"http://image.tmdb.org/t/p/original/zaYpVXSN1qoQV15scpPJgeJod5o.jpg"},{"url":"http://image.tmdb.org/t/p/original/e2YyHTyQZIZzf1x4JB6ViFxXGD9.jpg"},{"url":"http://image.tmdb.org/t/p/original/1U7PhJEuqan6cqpGxDxpoyOg2XG.jpg"}],"biography":"Joel Kinnaman (born Charles Joel Nordström; 25 November 1979) is a Swedish-American actor from Stockholm. He is best known for playing the lead role in the Swedish film Easy Money and for his role as Frank Wagner in the Johan Falk film series – a role that earned him a Guldbagge Award nomination in the \"Best Supporting Actor\" category. As of 2012 he stars in AMC's The Killing.\n\nDescription above from the Wikipedia article Joel Kinnaman, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1979-11-25"},{"name":"Chris Sarandon","photos":[{"url":"http://image.tmdb.org/t/p/original/1Wf3WoXEdPqGyO6onKfFkseDFef.jpg"},{"url":"http://image.tmdb.org/t/p/original/18y8Tkbwqqf5Mbc4A8fmHruHg5e.jpg"},{"url":"http://image.tmdb.org/t/p/original/18y8Tkbwqqf5Mbc4A8fmHruHg5e.jpg"},{"url":"http://image.tmdb.org/t/p/original/fnPawv8xOWpyKtSDmghz6cPJCEP.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nChris Sarandon (born July 24, 1942) is an American actor best known for playing Prince Humperdinck in the film The Princess Bride, the vampire Jerry Dandridge in Fright Night and Detective Mike Norris in the first entry of the Child's Play series, and providing the speaking voice of Jack Skellington from The Nightmare Before Christmas. He was nominated for an Academy Award for Best Supporting Actor for his performance as Leon in Dog Day Afternoon.\n\nDescription above from the Wikipedia article Chris Sarandon, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1942-07-24"},{"name":"Anna Paquin","photos":[{"url":"http://image.tmdb.org/t/p/original/uufIqxI0qmZ0rq9S85u59LD5H6Q.jpg"},{"url":"http://image.tmdb.org/t/p/original/j3RX1tlVxuSPc7LhvOLzeT0ntCi.jpg"},{"url":"http://image.tmdb.org/t/p/original/bxgfCT9g4j8Vp9R33jC4a6q4L7W.jpg"},{"url":"http://image.tmdb.org/t/p/original/iySXWlzamjpklYtSYd3Sz77uRvJ.jpg"},{"url":"http://image.tmdb.org/t/p/original/9Dz1QVSMBDyb0xRy4K2hTl9xy0p.jpg"},{"url":"http://image.tmdb.org/t/p/original/texEcKYvE0u2UHaxJtIa84fh26o.jpg"}],"biography":"Anna Paquin is the star of several major motion pictures, including her first Oscar winning performance in The Piano (1993), the role of the young Jane in the 1996 film Jane Eyre (1996), and the role of Amy Alden in the charming family film, Fly Away Home (1996). With a well-developed vocabulary and gentle sense of humor, Paquin proves herself to be the most enchanting young talent working today. Paquin's rising stardom has often been a cause of charming media shyness, where it is obvious that she is an ordinary girl who happens to posses an extraordinary talent. She has two agents, Gail Cowan in New Zealand, and the William Morris agency in Los Angeles, but neither these nor her parents have much influence in deciding what she films. \"In the end\", she says, \"it's my decision\". Paquin's parents separated while she was filming Fly Away Home (1996) in Canada. On Oscar night in 1993, Anna Paquin was the surprise (and surprised) winner of the Academy Award for Best Supporting Actress. She stood, wide-eyed and gulping for breath at the microphone for a full twenty-something-odd seconds before delivering a gracious, though rather breathless thank-you speech.","birthday":"1982-07-24"},{"name":"Bruce Davison","photos":[{"url":"http://image.tmdb.org/t/p/original/ytAfscmMvFFKcfxRzT0C6rAGjqb.jpg"},{"url":"http://image.tmdb.org/t/p/original/kYFBIffblcsbLMITDZYHhVf5c9f.jpg"}],"biography":"​From Wikipedia, the free encyclopedia.  \n\nBruce Davison (born June 28, 1946) is an American actor and director.\n\nDescription above from the Wikipedia article Bruce Davison, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1946-06-28"},{"name":"Colin Farrell","photos":[{"url":"http://image.tmdb.org/t/p/original/9FDzNq8cixv5PzJwjNXx1mJKAhU.jpg"},{"url":"http://image.tmdb.org/t/p/original/mmFfPFw9n3ObTqE3nx20uwpnilI.jpg"},{"url":"http://image.tmdb.org/t/p/original/tFMWlEeZNmgG8WsWgPm4Mjd6Tgc.jpg"},{"url":"http://image.tmdb.org/t/p/original/3hYkEGBl3fxWftER0XiZLmokNxl.jpg"},{"url":"http://image.tmdb.org/t/p/original/7rs4Sc4E1G9Tx46VJorR8CS2OqE.jpg"},{"url":"http://image.tmdb.org/t/p/original/zIprPli5hs3lV8EFEzFlR0go7qT.jpg"},{"url":"http://image.tmdb.org/t/p/original/zdhejlYAPKMDlg2iPCHeXB7vsas.jpg"}],"biography":"From Wikipedia, the free encyclopedia\n\nColin James Farrell (born 31 May 1976) is an Irish actor, who has appeared in films including Tigerland, Daredevil, Miami Vice, Minority Report, Phone Booth, The Recruit, Alexander, S.W.A.T., and In Bruges.\n\nDescription above from the Wikipedia article Colin Farrell, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1976-05-31"},{"name":"Florence Thomassin","photos":[{"url":"http://image.tmdb.org/t/p/original/dTl02iZ9mgxbXOLElidgqr79ZDX.jpg"},{"url":"http://image.tmdb.org/t/p/original/bOk2Ton3SoaQcB4Lq2VBRnSmUy9.jpg"}],"biography":null,"birthday":"1966-06-24"},{"name":"Ben Kingsley","photos":[{"url":"http://image.tmdb.org/t/p/original/n0cVP5K2VxlohkAf7LoRwPt4xhu.jpg"},{"url":"http://image.tmdb.org/t/p/original/tTk1PfnmObZdYnuijjLg5uaGZUu.jpg"},{"url":"http://image.tmdb.org/t/p/original/wawYPHU128BjRVF2tEGnEtpSW58.jpg"},{"url":"http://image.tmdb.org/t/p/original/fb7St3RI9kOvpyP8hwAEHkuqPY0.jpg"}],"biography":"Sir Ben Kingsley, CBE (born 31 December 1943), born Krishna Pandit Bhanji , is a British actor. He has won an Oscar, BAFTA, Golden Globe and Screen Actors Guild awards in his career. He is known for starring as Mohandas Gandhi in the film Gandhi in 1982, for which he won the Academy Award for Best Actor. He is also known for his performances in the films Schindler's List (1993), Prince of Persia: The Sands of Time (2010), and House of Sand and Fog.\n\nDescription above from the Wikipedia article Ben Kingsley, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1943-12-31"},{"name":"Amanda Bynes","photos":[{"url":"http://image.tmdb.org/t/p/original/s0dGdLgukzuex9urPJPBGepFGgm.jpg"},{"url":"http://image.tmdb.org/t/p/original/5iIyeC9DDk1yC0pnbj86Uzub9mk.jpg"},{"url":"http://image.tmdb.org/t/p/original/cX6rrg6q3ADGlJ3ovqtu3CSGNpF.jpg"},{"url":"http://image.tmdb.org/t/p/original/l3HhnBo68a3qRKWnUMk7p3mKeEX.jpg"},{"url":"http://image.tmdb.org/t/p/original/pOxx3W5MGGgpxCu9i4YF4mrcwpt.jpg"},{"url":"http://image.tmdb.org/t/p/original/lfHkW2pbe14X8YzEHd1PnQUDIeF.jpg"},{"url":"http://image.tmdb.org/t/p/original/y4QJ1dbRy8DLVL57QGavoISnH6R.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nAmanda Laura Bynes (born April 3, 1986) is an American actress, fashion designer and singer. Bynes appeared in several successful television series, such as All That and The Amanda Show, on Nickelodeon in the mid to late 1990s and early 2000s, and in 2002, she starred in the TV series, What I Like About You. She transitioned to a film career, starring in several films aimed at teenage audiences, including What a Girl Wants (2003), Love Wrecked (2005), She's the Man (2006), Hairspray (2007), and Easy A (2010).\n\nShe was named one of Teen People's \"25 Hottest Stars Under 25\" in 2006, and in 2007, Forbes listed her as the fifth highest paid celebrity under 21, with earnings of $2.5 million.\n\nDescription above from the Wikipedia article Amanda Bynes, licensed under CC-BY-SA, full list of contributors on Wikipedia","birthday":"1986-04-03"},{"name":"Orlando Bloom","photos":[{"url":"http://image.tmdb.org/t/p/original/vq90ECKinICxJYYZpbga4pMwch.jpg"},{"url":"http://image.tmdb.org/t/p/original/bHCyTOxc6q3INLaFOKmrEXjoYCt.jpg"},{"url":"http://image.tmdb.org/t/p/original/jLF5zDGkxhSkea49CeOrpyMFipN.jpg"},{"url":"http://image.tmdb.org/t/p/original/3G6baESq7EV676WttQYdUDiz4X2.jpg"},{"url":"http://image.tmdb.org/t/p/original/84yfhHJsB0m3qHpj2ICBbb8GdPT.jpg"}],"biography":"Orlando Jonathan Blanchard Bloom is an English actor. He had his break-through roles in 2001 as the elf-prince Legolas in The Lord of the Rings and starting in 2003 as blacksmith Will Turner in the Pirates of the Caribbean trilogy of films, and subsequently established himself as a lead in Hollywood films, including Elizabethtown and Kingdom of Heaven. He appeared in the ensemble film New York, I Love You, and will have roles in Sympathy for Delicious and Main Street. Bloom made his professional stage debut in West End's In Celebration at the Duke of York's Theatre, St. Martin's Lane, which ended its run on 15 September 2007.\n\nOrlando Bloom was born in Canterbury, Kent, England. His mother, Sonia Constance Josephine (née Copeland), was born in the British section of Kolkata, India, the daughter of Betty Constance Josephine Walker and Francis John Copeland, who was a physician and surgeon. During his childhood, Bloom was told that his father was his mother's husband, South African-born Jewish anti-Apartheid novelist Harry Saul Bloom; but when he was thirteen (nine years after Harry's death), Bloom's mother revealed to him that his biological father was actually Colin Stone, his mother's partner and family friend. Stone, the principal of the Concorde International language school, was made Orlando Bloom's legal guardian after Harry Bloom's death. Bloom, who is named after the 16th century composer Orlando Gibbons, has one sister, Samantha Bloom, who was born in 1975.\n\nBloom's first appearance on the screen was as a rent boy in the 1997 film Wilde - he had a small part. Two days after graduating from Guildhall in 1999, he was cast in his first major role, playing Legolas in The Lord of the Rings (2001–2003). He had originally auditioned for the part of Faramir, who doesn't appear until the second movie but the director, Peter Jackson, cast him as Legolas instead.\n\nBloom met American actress Kate Bosworth outside a coffee shop in 2002, where he was introduced to her by a mutual friend. He met her again at the premiere of The Lord of the Rings: The Two Towers later that year. The two had an \"on-and-off relationship\" from 2002 until splitting up in September 2006. In late 2007, Bloom began dating Australian model Miranda Kerr. The couple's engagement was announced on June 21, 2010.\n\nBloom has said that he tries \"not to exclude [himself] from real life as much as possible\". He is a Manchester United fan and lives in London. During filming in Morocco for Kingdom of Heaven, Bloom rescued and adopted a dog, Sidi (a black Saluki mix with a white mark on his chest). Bloom is a practising Buddhist. In 2004, he became a full member of Soka Gakkai International, a lay Buddhist association affiliated with the teachings of Nichiren. Bloom has also been a part of Global Green, an environmental company, since the early 2000s. As part of his environmental involvement, he has renovated his London home to use solar panels, incorporate recycled materials, and utilize energy efficient lightbulbs. Bloom has been approached by UNICEF to act as an international ambassador.","birthday":"1977-01-13"},{"name":"Daniel Craig","photos":[{"url":"http://image.tmdb.org/t/p/original/h8pfDEYJEIFhIuhwiYZGmgtwc8s.jpg"},{"url":"http://image.tmdb.org/t/p/original/lxdrcaBp2UvnbrkJBeTxKbCUil5.jpg"},{"url":"http://image.tmdb.org/t/p/original/cwTsJUyZlNX4eesdJRrGcNNjv1e.jpg"},{"url":"http://image.tmdb.org/t/p/original/wPm5y3mzbxiybQOMk5UhICoqpom.jpg"}],"biography":"Daniel Wroughton Craig (born 2 March 1968) is an English actor, best known for playing British secret agent James Bond since 2006.  Craig is an alumnus of the National Youth Theatre and graduated from the Guildhall School of Music and Drama in London and began his career on stage. His early on screen appearances were in the films Elizabeth, The Power of One and A Kid in King Arthur's Court, and on Sharpe's Eagle and Zorro in television. His appearances in the British films Love Is the Devil, The Trench and Some Voices attracted the industry's attention, leading to roles in bigger productions such as Lara Croft: Tomb Raider, Road to Perdition, Layer Cake and Munich.","birthday":"1968-03-02"},{"name":"Jackie Chan","photos":[{"url":"http://image.tmdb.org/t/p/original/pmKJ4sGvPQ3imzXaFnjW4Vk5Gyc.jpg"},{"url":"http://image.tmdb.org/t/p/original/tEJazyboCJcsvxnhKH3Hf33Bmgj.jpg"},{"url":"http://image.tmdb.org/t/p/original/j4WC8lWhpwvPWuu7YDQecA3bmqc.jpg"}],"biography":"Jackie Chan, born Chan Kong-sang, is a Hong Kong actor, action choreographer, filmmaker, comedian, producer, martial artist, screenwriter, entrepreneur, singer and stunt performer.  In his movies, he is known for his acrobatic fighting style, comic timing, use of improvised weapons, and innovative stunts. Jackie Chan has been acting since the 1970s and has appeared in over 100 films. Chan has received stars on the Hong Kong Avenue of Stars and the Hollywood Walk of Fame.\r\nAs a cultural icon, Chan has been referenced in various pop songs, cartoons, and video games. Chan is also a Cantopop and Mandopop star, having released a number of albums and sung many of the theme songs for the films in which he has starred.  Chan was born on April 7, 1954, in Victoria Peak, in the former Crown colony of Hong Kong, as Chan Kong-sang (meaning \"born in Hong Kong\") to Charles and Lee-Lee Chan, refugees from the Chinese Civil War. He was nicknamed Paopao (Chinese: 炮炮, literally meaning \"Cannonball\") because he was such a big baby, weighing 12 pounds, or about 5.4 kgs. Since his parents worked for the French Consul to Hong Kong, Chan spent his formative years within the grounds of the consul's residence in the Victoria Peak district.  Chan attended the Nah-Hwa Primary School on Hong Kong Island, where he failed his first year, after which his parents withdrew him from the school. In 1960, his father immigrated to Canberra, Australia, to work as the head cook for the American embassy, and Chan was sent to the China Drama Academy, a Peking Opera School run by Master Yu Jim-yuen. Chan trained rigorously for the next decade, excelling in martial arts and acrobatics. He eventually became part of the Seven Little Fortunes, a performance group made up of the school's best students, gaining the stage name Yuen Lo in homage to his master. Chan became close friends with fellow group members Sammo Hung and Yuen Biao, the three of them later to be known as the Three Brothers or Three Dragons.  At the age of 17, he worked as a stuntman in the Bruce Lee films Fist of Fury and Enter the Dragon under the stage name Chan Yuen Lung.   He received his first starring role later that year, in Little Tiger of Canton, which had a limited release in Hong Kong in 1973.","birthday":"1954-04-07"},{"name":"Cameron Diaz","photos":[{"url":"http://image.tmdb.org/t/p/original/ahFkUN9Sm8oF1txUHE5JcJ95Ere.jpg"},{"url":"http://image.tmdb.org/t/p/original/kEfFsxHYMUtpKHLa4DBCCjCB3XN.jpg"},{"url":"http://image.tmdb.org/t/p/original/cjdLUT2rNrMNQfuGOVZJJvZ6fnH.jpg"},{"url":"http://image.tmdb.org/t/p/original/id0R8BRRWWfsqGBhbNcOPpYAMYY.jpg"},{"url":"http://image.tmdb.org/t/p/original/ypTZKoFDjteXzT2a7U353rKWd9B.jpg"},{"url":"http://image.tmdb.org/t/p/original/6ixtldL0LEzAG2dWVj5V4nt4JNi.jpg"},{"url":"http://image.tmdb.org/t/p/original/jaOLURYGtsygeAiFk3BA0rHjefd.jpg"},{"url":"http://image.tmdb.org/t/p/original/n1jMFGpusK5IBtl0uKgE70k7H6w.jpg"},{"url":"http://image.tmdb.org/t/p/original/tlnpEjAOV16eTGvbyJhctO3H2mX.jpg"},{"url":"http://image.tmdb.org/t/p/original/5kTXNXGv0RIfaHp4DWGMU8Ppjns.jpg"},{"url":"http://image.tmdb.org/t/p/original/d5Ac2T3F3APe2nHliJ3rnHwzgIa.jpg"},{"url":"http://image.tmdb.org/t/p/original/w6MSITqZjbjipeabzzHJ0WeQyyU.jpg"},{"url":"http://image.tmdb.org/t/p/original/bQYqYRWM8cHAixp3Maim1wwwnFW.jpg"},{"url":"http://image.tmdb.org/t/p/original/aMUo4eeBq7gb7zSfypkl3vBisHt.jpg"},{"url":"http://image.tmdb.org/t/p/original/6Gjlaci1hDbldvocmwXmUHILRDH.jpg"},{"url":"http://image.tmdb.org/t/p/original/5qkxiD0gWCcgR2DddRqvhfz9uAp.jpg"},{"url":"http://image.tmdb.org/t/p/original/b1auoGTWTBUUHhw4a24OkyPs7hJ.jpg"},{"url":"http://image.tmdb.org/t/p/original/ke8yXJ1G3mPr2LvhXW97gqpH6PK.jpg"}],"biography":"Cameron Michelle Diaz (born August 30, 1972 height 5' 9\" (1,75 m)) is an American actress and former model. She rose to prominence during the 1990s with roles in the movies The Mask, My Best Friend's Wedding and There's Something About Mary. Other high-profile credits include the two Charlie's Angels films, voicing the character Princess Fiona in the Shrek series, Any Given Sunday, Knight and Day, The Holiday, The Green Hornet and Bad Teacher.  Diaz has received four Golden Globe Award nominations for her performances in the movies, Being John Malkovich, Vanilla Sky, Gangs of New York, and There's Something About Mary for which she also won the New York Film Critics Best Lead Actress Award. She is also a BAFTA Nominee. In 2013, Diaz was named the highest paid actress over 40 in Hollywood.\n\nCameron Diaz was born in San Diego, California. Her mother, Billie Joann (née Early), is an import-export agent, and her father, Emilio Luis Diaz (1949–2008), worked for the California oil company UNOCAL for more than 20 years as a field gauger. Diaz has an older sister, Chimene. Her father's family were Cuban (of Spanish descent), and settled in Tampa's Ybor City, later moving to California, where Emilio was born. Her mother has English, German, and Scots-Irish ancestry. Diaz was raised in Long Beach, California, and attended Long Beach Polytechnic High School","birthday":"1972-08-30"},{"name":"Sylvester Stallone","photos":[{"url":"http://image.tmdb.org/t/p/original/gnmwOa46C2TP35N7ARSzboTdx2u.jpg"},{"url":"http://image.tmdb.org/t/p/original/lKqJ34HBEedGH16hTllV0bd5PqO.jpg"},{"url":"http://image.tmdb.org/t/p/original/gNj8nWBZBD4im1PbWzxowk9dGII.jpg"},{"url":"http://image.tmdb.org/t/p/original/iU0QlvPbS6Fgi3YC7T6EQYFxeDz.jpg"}],"biography":"Michael Sylvester Gardenzio Stallone (born July 6, 1946), commonly known as Sylvester Stallone, and nicknamed Sly Stallone, is an American actor, filmmaker, screenwriter, film director and occasional painter. Stallone is known for his machismo and Hollywood action roles. Two of the notable characters he has portrayed include boxer Rocky Balboa and soldier John Rambo. The Rocky and Rambo franchises, along with several other films, strengthened his reputation as an actor and his box office earnings.\n\nStallone's film Rocky was inducted into the National Film Registry as well as having its film props placed in the Smithsonian Museum. Stallone's use of the front entrance to the Philadelphia Museum of Art in the Rocky series led the area to be nicknamed the Rocky Steps. Philadelphia has a statue of his Rocky character placed permanently near the museum, on the right side before the steps. It was announced on December 7, 2010 that Stallone was voted into boxing's Hall of Fame.\n\nDescription above from the Wikipedia article Sylvester Stallone, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1946-07-06"},{"name":"Joan Blondell","photos":[{"url":"http://image.tmdb.org/t/p/original/2KnL9VyFPBxZ4xIxpvCUTMicVY2.jpg"},{"url":"http://image.tmdb.org/t/p/original/2KnL9VyFPBxZ4xIxpvCUTMicVY2.jpg"},{"url":"http://image.tmdb.org/t/p/original/7nS5gqycNArcTdnRO2lXj9rYnkG.jpg"}],"biography":"From Wikipedia, the free encyclopedia\n\nRose Joan Blondell (August 30, 1906 – December 25, 1979) was an American actress.\n\nAfter winning a beauty pageant, Blondell embarked upon a film career. Establishing herself as a sexy wisecracking blonde, she was a Pre-code staple of Warner Brothers and appeared in more than 100 movies and television productions. She was most active in films during the 1930s, and during this time she co-starred with Glenda Farrell in nine films, in which the duo portrayed gold-diggers. Blondell continued acting for the rest of her life, often in small character roles or supporting television roles. She was nominated for an Academy Award for Best Supporting Actress for her work in The Blue Veil (1951).\n\nBlondell was seen in featured roles in two films released shortly before her death from leukemia, Grease (1978) and the remake of The Champ (1979).\n\nDescription above from the Wikipedia article Joan Blondell, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1906-08-30"},{"name":"Brian Cox","photos":[{"url":"http://image.tmdb.org/t/p/original/m15C58NWii5WCIg57Llr7hejnfy.jpg"},{"url":"http://image.tmdb.org/t/p/original/kCNr8Q1T1xXFBsnxotNmFq5gozB.jpg"},{"url":"http://image.tmdb.org/t/p/original/xhSqRl3HYqmPrTfeTCZPmGoiUwy.jpg"},{"url":"http://image.tmdb.org/t/p/original/m6etRMuSvkvWNzcDMqgLQ0TIiF3.jpg"},{"url":"http://image.tmdb.org/t/p/original/wUPNvfGs6SHiOIAjZssfHden9T9.jpg"}],"biography":"​Brian Denis Cox, CBE (born 1 June 1946) is a Scottish actor. He is known for his work with the Royal Shakespeare Company, where he gained recognition for his portrayal of King Lear. He has also appeared in many Hollywood productions playing parts such as Dr. Guggenheim in Rushmore and William Stryker in X2. He was the first actor to portray Hannibal Lecter on film in the 1986 production Manhunter.  Description above from the Wikipedia article Brian Cox , licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1946-06-01"},{"name":"Kim Hunter","photos":[{"url":"http://image.tmdb.org/t/p/original/nB44EysedphcIWftSqyyG2qBYk8.jpg"},{"url":"http://image.tmdb.org/t/p/original/xn1E7MwK8Duwis2dA9UzeEx88PV.jpg"},{"url":"http://image.tmdb.org/t/p/original/xn1E7MwK8Duwis2dA9UzeEx88PV.jpg"}],"biography":"From Wikipedia, the free encyclopedia\n\nKim Hunter (November 12, 1922 – September 11, 2002) was an American film, theatre, and television actress. She won both an Academy Award and a Golden Globe Award, each as Best Supporting Actress, for her performance as Stella Kowalski in the 1951 film A Streetcar Named Desire. Decades later she received a Daytime Emmy Award for her work on the long running soap The Edge of Night.\n\nDescription above from the Wikipedia article Kim Hunter, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1922-11-12"},{"name":"Garry Marshall","photos":[{"url":"http://image.tmdb.org/t/p/original/yStHgyFdboxzvHTbCsmPQqfnagt.jpg"}],"biography":"From Wikipedia, the free encyclopedia\n\nGarry Kent Marshall (born November 13, 1934) is an American actor, director, writer and producer. His notable credits include creating Happy Days and The Odd Couple and directing Nothing In Common, Pretty Woman, Runaway Bride, Valentine's Day, and The Princess Diaries.\n\nDescription above from the Wikipedia article Garry Marshall, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1934-11-13"},{"name":"Robert Loggia","photos":[{"url":"http://image.tmdb.org/t/p/original/7xtU12KT12xjy4UY1O6VKpw7FLx.jpg"},{"url":"http://image.tmdb.org/t/p/original/7xtU12KT12xjy4UY1O6VKpw7FLx.jpg"},{"url":"http://image.tmdb.org/t/p/original/zohf2pn24OHYYlJnw6r9dFF8Asm.jpg"}],"biography":"​From Wikipedia, the free encyclopedia.  \n\nRobert Loggia (born Salvatore Loggia; January 3, 1930) is an American film and television actor and director, who specializes in character parts.\n\nDescription above from the Wikipedia article Robert Loggia, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1930-01-03"},{"name":"Mark Ruffalo","photos":[{"url":"http://image.tmdb.org/t/p/original/isQ747u0MU8U9gdsNlPngjABclH.jpg"},{"url":"http://image.tmdb.org/t/p/original/w5yqDZo2IZV0vsrsMWUqloNiutb.jpg"},{"url":"http://image.tmdb.org/t/p/original/th6P1UM0uzXIoE1d4AiPOumXEZw.jpg"},{"url":"http://image.tmdb.org/t/p/original/xs26A4XmOA8GT9JpRz5r7A4FXSW.jpg"},{"url":"http://image.tmdb.org/t/p/original/8k1QQzdVOTwAqnZIV6eww8z9PBQ.jpg"},{"url":"http://image.tmdb.org/t/p/original/7nidJKw9EG21X2CnEyy9AhfRdGW.jpg"},{"url":"http://image.tmdb.org/t/p/original/vnVl4vnEb0UELwcVUGXylZ1YSb7.jpg"}],"biography":"Mark Alan Ruffalo (born November 22, 1967) is an American actor, director, producer and screenwriter. He has worked in films including Eternal Sunshine of the Spotless Mind, Zodiac, Shutter Island, Just Like Heaven, You Can Count on Me and The Kids Are All Right for which he received an Academy Award nomination for Best Supporting Actor.\n\nDescription above from the Wikipedia article Mark Ruffalo, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1967-11-22"},{"name":"Donnie Yen","photos":[{"url":"http://image.tmdb.org/t/p/original/vlKBbOc0htUsDGvcxeULcFXDMRo.jpg"},{"url":"http://image.tmdb.org/t/p/original/rvohG0TNnAoSYvtEM05zcnK9w78.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nDonnie Yen (born 27 July 1963) is a Hong Kong actor, martial artist, film director, action choreographer and film producer. Apart from being a well-known film and television actor in Hong Kong, Yen has also gained international recognition for appearing in many films together with other prominent and internationally-known actors such as Jackie Chan, Jet Li and Michelle Yeoh. He is considered to be Hong Kong's top action star; director Peter Chan mentioned that he \"is the 'it' action person right now\" and \"has built himself into a bona fide leading man, who happens to be an action star.\"\n\nDescription above from the Wikipedia article Donnie Yen , licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1963-07-27"},{"name":"Loretta Devine","photos":[{"url":"http://image.tmdb.org/t/p/original/qRN7om4pWfRU9Oe2mL3A8IwjOIq.jpg"},{"url":"http://image.tmdb.org/t/p/original/6f6anuuV9tumLyybnOEjhDTwVA3.jpg"},{"url":"http://image.tmdb.org/t/p/original/4V2vVP6BMLywpA3hR3wmhBpOTkN.jpg"},{"url":"http://image.tmdb.org/t/p/original/nBeMeev7NlXsjhSKlrsHcEc7V60.jpg"},{"url":"http://image.tmdb.org/t/p/original/zLQFwQTFtHkb8sbFdkPNamFI7jv.jpg"},{"url":"http://image.tmdb.org/t/p/original/9d5N0l3ylagkFZCc8pt743GfFZv.jpg"}],"biography":"Loretta Devine was born on August 21, 1949 in Houston, Texas. She graduated from the University of Houston in 1971 with a Bachelor of Arts in Speech and Drama and BrandeisUniversity in 1976 with a MFA in Theater. Devine is a member of The Epsilon Lambda Chapter of the Alpha Kappa Alpha Sorority. She began her career on Broadway starring in Dreamgirls. Minor roles for Devine followed in films such as Little Nikita (1988) and Stanley & Iris (1990). She also appeared in the first season of the TV series A Different World. In 1995, she landed a high-profile role as Gloria Matthews in Waiting to Exhale, joined in the cast by Whitney Houston, Gregory Hines, and Angela Bassett, among others. The role earned her an NAACP Image Award for Best Supporting Actress, as did her next movie, The Preacher's Wife, her second movie with Houston and Hines. In 2000, Devine took on the role of impassioned high school teacher Marla Hendricks on the Fox TV drama Boston Public. Devine won three more Image Awards for her work in the series. She also continued to work in film, playing prominent roles in Urban Legend, Urban Legends: Final Cut, and I Am Sam. Devine earned yet another Image Award nomination and an Independent Spirit Award nomination for her work in the 2004 film Woman Thou Art Loosed. She also appeared in the 2005 Academy Awards Best Picture winning film Crash. She also plays Rochelle's mother, Maxine on the sitcom, Everybody Hates Chris. In 2007, she appeared in This Christmas, co-starring Delroy Lindo, Mekhi Phifer, and Regina King. Devine also appeared in Grey's Anatomy as Adele Webber. She played Patti on Eli Stone, an ABC television series which began airing in 2008 an in 2009, Devine starred in the TV series Cold Case. Most recently she can be seen in Lottery Ticket (2010), For Colored Girls (2010), Death at a Funeral and Madea’s Big Happy Family (2011).","birthday":"1949-08-21"},{"name":"Xu Fan","photos":[{"url":"http://image.tmdb.org/t/p/original/62uS3HDdkWflEbiWItuvuFoE8tt.jpg"},{"url":"http://image.tmdb.org/t/p/original/7mZNBQuzNXjrRrQpnT8iTMT9JuX.jpg"}],"biography":"","birthday":"1967-01-15"},{"name":"Octavia Spencer","photos":[{"url":"http://image.tmdb.org/t/p/original/1LpTalOkLCSjm0UraIjn3BCtVje.jpg"},{"url":"http://image.tmdb.org/t/p/original/aii7wrNglEH07xjQvtRBEGSUEvT.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nOctavia Spencer (born 25 May 1972) is an American actress. She is perhaps best known for her role on Ugly Betty as Constance Grady, the INS Agent turned stalker of Betty's father, Ignacio Suarez","birthday":"1972-05-25"},{"name":"Donald Sutherland","photos":[{"url":"http://image.tmdb.org/t/p/original/tPLVaPjxEscGPKS3ieByloa8Mqj.jpg"},{"url":"http://image.tmdb.org/t/p/original/luKIiU3wAAZ5C6j2053g35cRhzE.jpg"},{"url":"http://image.tmdb.org/t/p/original/lNWraDxGFvRBt6FQ2dIPnL0bxu9.jpg"},{"url":"http://image.tmdb.org/t/p/original/A9T6a9anb2fkP1A9wVUD98CrwAE.jpg"},{"url":"http://image.tmdb.org/t/p/original/o7o1C3j9DrfjZPVBXqvGhUN5fgm.jpg"}],"biography":"Donald McNicol Sutherland, OC (born 17 July 1935) is a Canadian character actor with a film career spanning nearly 50 years. Some of Sutherland's more notable movie roles included offbeat warriors in such war movies as \"The Dirty Dozen\" in 1967, and \"MASH\" and \"Kelly's Heroes\" in 1970, as well as in such popular films as \"Klute\", \"Invasion of the Body Snatchers\", and \"Ordinary People\".  His more recent credits include \"Reign Over Me\" with Don Cheadle and Adam Sandler; \"Ask the Dust,\" written and directed by Robert Towne; \"Land of the Blind,\" with Ralph Fiennes; \"An American Haunting,\" opposite Sissy Spacek; \"American Gun,\" with Marcia Gay Harden and Forest Whitaker; and \"Fierce People,\" directed by Griffin Dunne. He is the father of actor Kiefer Sutherland.  Above description from the Wikipedia article Donald Sutherland, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1935-07-17"},{"name":"Charles Haid","photos":[{"url":"http://image.tmdb.org/t/p/original/Wna0bUskkYJAMFY5UiJMUbPG93.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nCharles Maurice Haid III (born June 2, 1943) is an American actor and director, with notable work in both movies and television. He is known for his portrayal of Officer Andy Renko in Hill Street Blues.\n\nHaid was born in San Francisco, California, the son of Grace Marian (née Folger) and Charles Maurice Haid, Jr. He attended Carnegie Institute of Technology (now Carnegie Mellon University), where he met Steven Bochco. He was associate producer of the original stage production of Godspell in 1971, which was developed at CMU.\n\nHaid's acting credits include the 1976/1977 police drama series Delvecchio as Sgt. Paul Schonski and the 1980s police drama series Hill Street Blues, as Officer Andy Renko, and as Dr. Mason Parrish in the 1980 movie Altered States. His directing credits include an episode of ER which earned him a Directors Guild Award, and DGA nominations for the TV-movie Buffalo Soldiers and an episode of NYPD Blue. He is a regular director on the FX series Nip/Tuck. He has also directed for the FX series Sons of Anarchy. He is a regular director for the CBS series Criminal Minds. He also portrayed serial killer Randall Garner (aka \"The Fisher King\") on Criminal Minds.\n\nDuring a visit to New Zealand in the 1980s, Haid was interviewed for a television news program, and surprised many viewers when he discussed his Shakespearean background, and love of live stage work.\n\nIn 2004-2005 Haid played C. T. Finney, a corrupt New York police captain on the sixth season of the NBC show Third Watch.\n\nHaid provided the voice of the one-legged rabbit \"Lucky Jack\" in the 2004 Disney animated film Home On The Range. Twenty years earlier, Haid voiced main character \"Montgomery Moose\" in the pilot episode of The Get Along Gang, produced by Nelvana. He was replaced by Sparky Marcus for the subsequent series.\n\nHaid is a cousin of television talk show host Merv Griffin.\n\nDescription above from the Wikipedia article Charles Haid, licensed under CC-BY-SA, full list of contributors on Wikipedia​","birthday":"1943-06-02"},{"name":"Jason Statham","photos":[{"url":"http://image.tmdb.org/t/p/original/PhWiWgasncGWD9LdbsGcmxkV4r.jpg"},{"url":"http://image.tmdb.org/t/p/original/egXMvQT6SXFgJmIjaBeWPbGi0em.jpg"},{"url":"http://image.tmdb.org/t/p/original/tzX4MTzgKYyvk4hjW9yzfoGCvr2.jpg"}],"biography":"Jason Statham (born 12 September 1967) is an English actor and martial artist, known for his roles in the Guy Ritchie crime films Lock, Stock and Two Smoking Barrels; Revolver; and Snatch.\n\nStatham appeared in supporting roles in several American films, such as The Italian Job, as well as playing the lead role in The Transporter, Crank, The Bank Job, War (opposite martial arts star Jet Li), and Death Race. Statham solidified his status as an action hero by appearing alongside established action film actors Sylvester Stallone, Arnold Schwarzenegger, Bruce Willis, Jet Li and Dolph Lundgren in The Expendables. He normally performs his own fight scenes and stunts. Description above from the Wikipedia article Jason Statham, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1967-09-12"},{"name":"Jamie Kennedy","photos":[{"url":"http://image.tmdb.org/t/p/original/lOoXGQ1hxwthTjlzZaCJny65lTp.jpg"},{"url":"http://image.tmdb.org/t/p/original/syX4gaueHNr26znP5ecuDWjgvnw.jpg"},{"url":"http://image.tmdb.org/t/p/original/fwvClPv21iaeAsF8Xdg1I0nF8ls.jpg"},{"url":"http://image.tmdb.org/t/p/original/mGer0ckdTe4Ge42Hcoe9bikniYW.jpg"},{"url":"http://image.tmdb.org/t/p/original/nuicJFppGUwU5oDZJG9iyRKLjYh.jpg"},{"url":"http://image.tmdb.org/t/p/original/nuicJFppGUwU5oDZJG9iyRKLjYh.jpg"}],"biography":"​From Wikipedia, the free encyclopedia\n\nJames Harvey \"Jamie\" Kennedy (born May 25, 1970) is an American comedian, rapper and actor.\n\nDescription above from the Wikipedia article Jamie Kennedy, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1970-05-25"},{"name":"Billy Bob Thornton","photos":[{"url":"http://image.tmdb.org/t/p/original/sgCqytliDMD19d0VP45YgUmMCqH.jpg"},{"url":"http://image.tmdb.org/t/p/original/gPCPKXh7HvobcrldRGj5QchW34p.jpg"},{"url":"http://image.tmdb.org/t/p/original/ctV9zGM5RDTtIUmTlsTqsJqpixp.jpg"},{"url":"http://image.tmdb.org/t/p/original/9DhPhx7AqyVVUNnxzfXp9WahOx9.jpg"},{"url":"http://image.tmdb.org/t/p/original/6b8d1M3qEEE6b9ZyNRsgiMUJmyD.jpg"},{"url":"http://image.tmdb.org/t/p/original/r6pB7C7IjXAmFbgFc8K6Iq0x4O9.jpg"}],"biography":"From Wikipedia, the free encyclopedia.  \n\nBilly Bob Thornton (born August 4, 1955) is an American actor, screenwriter, director and musician. Thornton gained early recognition as a cast member on the CBS sitcom Hearts Afire and in several early 1990s films including On Deadly Ground and Tombstone. In the mid-1990s, after writing, directing, and starring in the independent film Sling Blade, he won an Academy Award for Best Adapted Screenplay. He appeared in several major film roles following Sling Blade 's success, including 1998's Armageddon and A Simple Plan. During the late 1990s, Thornton began a career as a singer-songwriter. He has released three albums and was the singer of a blues rock band.\n\nDescription above from the Wikipedia article Billy Bob Thornton, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1955-08-04"},{"name":"Mel Brooks","photos":[{"url":"http://image.tmdb.org/t/p/original/ndFo3LOYNCUghQTK833N1Wtuynr.jpg"},{"url":"http://image.tmdb.org/t/p/original/9j7VvYMl0oNXnRvfwoq6ajth757.jpg"},{"url":"http://image.tmdb.org/t/p/original/2dbR4MKxHqfmgiSytbtzucjDQBx.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nMel Brooks (born Melvin Kaminsky, June 28, 1926) is an American film director, screenwriter, composer, lyricist, comedian, actor and producer. He is best known as a creator of broad film farces and comic parodies. Brooks is a member of the short list of entertainers with the distinction of having won an Emmy, a Grammy, an Oscar and a Tony award. Three of his films ranked in the American Film Institute's list of the top 100 comedy films of all-time: Blazing Saddles at number 6, The Producers at number 11, and Young Frankenstein at number 13.","birthday":"1926-06-28"},{"name":"Götz Otto","photos":[{"url":"http://image.tmdb.org/t/p/original/fz5cvc45ljfDm2okVeTWL6EeAbC.jpg"},{"url":"http://image.tmdb.org/t/p/original/xl82gVjp9s2gSwx0QA52uRsM6Jt.jpg"}],"biography":"​From Wikipedia, the free encyclopedia.  \n\nGötz Otto (born 15 October 1967) is a German actor known for his very tall stature. He is 196 cm (6 ft 6 inches) tall and is often characterised by bleached blonde hair in his films.\n\nDescription above from the Wikipedia article Götz Otto, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1967-10-15"},{"name":"Brenton Thwaites","photos":[{"url":"http://image.tmdb.org/t/p/original/cGk7TA4mcacQAdSOWAXC8br7GEp.jpg"}],"biography":"","birthday":""},{"name":"Cleo King","photos":[{"url":"http://image.tmdb.org/t/p/original/IGNLC61hEWKOLzC9PkhrhuL0G.jpg"}],"biography":"Cleo King is an actress.","birthday":"1962-08-21"},{"name":"Channing Tatum","photos":[{"url":"http://image.tmdb.org/t/p/original/fes96sycbYbaKQrRpCc70WcnNPu.jpg"},{"url":"http://image.tmdb.org/t/p/original/gJKRcw8jojmUQhSwSEtis7w51eK.jpg"},{"url":"http://image.tmdb.org/t/p/original/8WSelG0drtuZn2VEkoCq8Oi8Gti.jpg"},{"url":"http://image.tmdb.org/t/p/original/mdirc6a5ThTGOm2Mo4Ii1VuDYEI.jpg"},{"url":"http://image.tmdb.org/t/p/original/b5VLx5ld1WIQN4WHdF21Db2VSHv.jpg"},{"url":"http://image.tmdb.org/t/p/original/50rOiDhhGKuIj94YFDaExCegTws.jpg"},{"url":"http://image.tmdb.org/t/p/original/5PobM1vU5oZxWpWwmLaCiMTG5vc.jpg"}],"biography":"Channing Matthew Tatum (born April 26, 1980) is an American actor and film producer. He began his career as a fashion model before turning to film roles, having starred in She's the Man (2006), Step Up (2006), Fighting (2009), Public Enemies (2009), G.I. Joe: The Rise of Cobra (2009), and Dear John (2010).\n\nDescription above from the Wikipedia article Channing Tatum, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1980-04-26"},{"name":"Jaime Pressly","photos":[{"url":"http://image.tmdb.org/t/p/original/cm6MuKjGwLSwHg0UDHOFRUf8njm.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nJaime Elizabeth Pressly (born July 30, 1977) is an American actress and model. She is best known for playing Joy Turner on the NBC sitcom My Name Is Earl, for which she was nominated for two Emmy Awards, winning one, for a Golden Globe Award and for a Screen Actors Guild Award. She has also appeared in films such as Joe Dirt, DOA: Dead or Alive and I Love You, Man.\n\nDescription above from the Wikipedia article Jaime Pressly, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1977-07-30"},{"name":"Madeleine Stowe","photos":[{"url":"http://image.tmdb.org/t/p/original/jqd70MNVUs3nTbxn3B3G6UNV4Oc.jpg"},{"url":"http://image.tmdb.org/t/p/original/dvFnsB8xHGvn5NOaJPlol6fyMbl.jpg"},{"url":"http://image.tmdb.org/t/p/original/hBxjbLkedeKbLa1K5ktGMZMCydo.jpg"}],"biography":"Madeleine Stowe (born August 18, 1958) is an American actress. Description the Wikipedia article Madeleine Stowe, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1958-08-18"},{"name":"Carrie Fisher","photos":[{"url":"http://image.tmdb.org/t/p/original/1Kpvl1B7SRrdLKjqDfT6kb7nyRB.jpg"},{"url":"http://image.tmdb.org/t/p/original/7ZCxLwUqcyE1h9KdhPTJx5RNEXm.jpg"}],"biography":"Carrie Frances Fisher (born October 21, 1956) is an American actress, novelist, screenwriter, and lecturer. She is most famous for her portrayal of Princess Leia Organa in the original Star Wars trilogy, her bestselling novel Postcards from the Edge, for which she wrote the screenplay to the film of the same name, and her autobiography Wishful Drinking.\n\nDescription above from the Wikipedia article Carrie Fisher, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1956-10-21"},{"name":"Jordi Mollà","photos":[{"url":"http://image.tmdb.org/t/p/original/A648UpxxLlgdqziafgSCAVaR0Sc.jpg"},{"url":"http://image.tmdb.org/t/p/original/bT4DvORFqkQcAJkzmkLCgEuLSEr.jpg"},{"url":"http://image.tmdb.org/t/p/original/2Jp71KUhh7A8UiMIG8OesaC1EEi.jpg"},{"url":"http://image.tmdb.org/t/p/original/kyEfa0CZlBiWVKkUWj6OM1OpN47.jpg"},{"url":"http://image.tmdb.org/t/p/original/fYbkpd7NQMSELc9kO4g4JChzPCK.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nJordi Mollà Perales (born 1 July 1968) is a Spanish actor, filmmaker, writer and artist from Catalonia.\n\nMollà's artwork is represented in the Carmen De la Guerra Gallery in Madrid, Picasso Mio Gallery in Madrid and Barcelona and Cold Creation Gallery in Barcelona. In the summer of 2002, he exhibited in ARCO at the Carmen de la Guerra Gallery, along with a number of other artists.\n\nAs an actor, Mollà is most recognized in the United States for his role as Diego Delgado in Blow (Ted Demme, 2001), his debut Hollywood film. Mollà also has directed three films and written two books.\n\nBad Boys II co-star Gabrielle Union labeled Mollà as \"The Tom Cruise of Spain,\" when praising his charismatic performance as Johnny Tapia.\n\nDescription above from the Wikipedia article Jordi Mollà, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1968-07-01"},{"name":"Keanu Reeves","photos":[{"url":"http://image.tmdb.org/t/p/original/cEIZlUQvnlXfoxF0mPJsvDPh2Po.jpg"},{"url":"http://image.tmdb.org/t/p/original/vqSFu6uQY9y3AS5CS5fy3A5IslU.jpg"},{"url":"http://image.tmdb.org/t/p/original/glCFGnKkX3QWxeLRYUMU1XTESHf.jpg"},{"url":"http://image.tmdb.org/t/p/original/jmjeALlAVaPB8SonLR3qBN5myjc.jpg"},{"url":"http://image.tmdb.org/t/p/original/nXdeRYDpxieTxh08cduEEEZrzKc.jpg"},{"url":"http://image.tmdb.org/t/p/original/ieYCB65ZfZlUiiB8SGktyEF3qU1.jpg"},{"url":"http://image.tmdb.org/t/p/original/rdHVDISJlvnwJeBnvaoFzbkaQBY.jpg"}],"biography":"Keanu Charles Reeves is a Canadian actor. Reeves is known for his roles in Bill &amp; Ted's Excellent Adventure, Speed, Point Break, and The Matrix trilogy as Neo. He has collaborated with major directors such as Stephen Frears (in the 1988 period drama Dangerous Liaisons); Gus Van Sant (in the 1991 independent film My Own Private Idaho); and Bernardo Bertolucci (in the 1993 film Little Buddha). Referring to his 1991 film releases, The New York Times' critic, Janet Maslin, praised Reeves' versatility, saying that he \"displays considerable discipline and range. He moves easily between the buttoned-down demeanor that suits a police procedural story and the loose-jointed manner of his comic roles.\" A repeated theme in roles he has portrayed is that of saving the world, including the characters of Ted Logan, Buddha, Neo, Johnny Mnemonic, John Constantine and Klaatu.","birthday":"1964-09-02"},{"name":"Christian Bale","photos":[{"url":"http://image.tmdb.org/t/p/original/pPXnqoGD91znz4FwQ6aKuxi6Pcy.jpg"},{"url":"http://image.tmdb.org/t/p/original/vecCvACI2QhSE5fOoANeWDjxGKM.jpg"},{"url":"http://image.tmdb.org/t/p/original/5gR7CiLF6rtfusggiL8yeSm2Lgl.jpg"},{"url":"http://image.tmdb.org/t/p/original/4fX9DrbC85ZgGY31SLTnwCAhULB.jpg"},{"url":"http://image.tmdb.org/t/p/original/8ejEdLh3lGq5c6uSwGf1XFzrAUH.jpg"},{"url":"http://image.tmdb.org/t/p/original/yGY8Ij3UadP39Vunmm9FDWDbBPJ.jpg"},{"url":"http://image.tmdb.org/t/p/original/58LvLSjmVBWBtirGo2s0f4Hh4fE.jpg"},{"url":"http://image.tmdb.org/t/p/original/uTxHV6uwGZcuhiESezrdGHquoAt.jpg"}],"biography":"Christian Charles Philip Bale is an English actor. In addition to starring roles in big budget Hollywood films, he has long been heavily involved in films produced by independent producers and art houses.\n\nBale first caught the public eye when he was cast in the starring role of Steven Spielberg's Empire of the Sun at the age of 13, playing an English boy who is separated from his parents and subsequently finds himself lost in a Japanese internment camp during World War II. Since then, he has portrayed a wide range of characters. Bale is especially noted for his cult following: the tenth anniversary issue of Entertainment Weekly hailed him as one of the \"Top 8 Most Powerful Cult Figures of the Past Decade\", citing his cult status on the Internet. EW called Bale one of the \"Most Creative People in Entertainment\" in anticipation of the release American Psycho (2000). The Guardian named Bale as one of the best actors never to have received an Academy Award nomination.\n\nBale was born in Wales to parents of English descent. His father, David Bale, was an entrepreneur, commercial pilot, and talent manager and his mother, Jenny James, was a circus clown and performer. He is the youngest of four children. After leaving Wales in 1976, Bale spent his childhood in several countries, including England, Portugal and the United States.\n\nSettling for four years in Bournemouth and Henley-on-Thames, Bale was educated at Shiplake C of E Primary School, the independent Dolphin School in Berkshire, and at Bournemouth School. He participated actively in rugby union. Bale has described his childhood, with respect to his mother being in the circus, as \"interesting\". He recalled his first kiss was with an acrobat named Barta. As a child, he trained in ballet and guitar. His sister Louise's work in theatre also influenced his decision to become an actor. Bale's father was very supportive of his son's acting, resigning from his job as a commercial pilot to travel and manage Bale's burgeoning career.\n\nBale's first foray into acting was a commercial for the fabric softener Lenor in 1982, when he was eight years old. He appeared in a Pac-Man cereal commercial playing a child rock star a year later] and in 1984 made his stage debut in The Nerd, opposite Rowan Atkinson.\n\nOn 29 January, 2000, Bale married Sandra \"Sibi\" Blažić (born 1970), a one-time model, make-up artist and personal assistant to Winona Ryder; the couple have a daughter, Emmeline, who was born on 27 March 2005, in Santa Monica, California. Since 1992, Bale has resided in Los Angeles.\n\nBale has three elder sisters – Erin Bale, a musician; Sharon Bale, a computer professional; and Louise Bale, a theatre actress and director. The Bale family is deeply rooted in show business, especially theatre. Bale is a distant relative of British actress Lillie Langtry, while his uncle, Rex Bale and maternal grandfather were actors as well.\n\nLike his late father, businessman David (1941–2003), Christian Bale actively supports environmental groups such as Greenpeace and the World Wildlife Fund. Feminist activist Gloria Steinem became Bale's stepmother, and a first-time bride (at the age of 66), when she married David Bale on 3 September 2000. They were together until the death of David Bale in 2003.\n\nDuring an interview promoting his 2009 film Public Enemies Bale said he is a video game fan, specifically of the Metal Gear Solid series. When questioned if he was in the running to play Solid Snake, Bale stated that he prefers to devote his spare time to more constructive things and dislikes talking about his personal life.","birthday":"1974-01-30"},{"name":"Jeffrey Tambor","photos":[{"url":"http://image.tmdb.org/t/p/original/vZKPzKDdqMbxMaJXmnoXXh3YQcw.jpg"},{"url":"http://image.tmdb.org/t/p/original/2HHZqaZkr1WCDgFS1vTrTU41TVp.jpg"},{"url":"http://image.tmdb.org/t/p/original/vXMQi13vHN9upxX9DUq5J3jJVcy.jpg"},{"url":"http://image.tmdb.org/t/p/original/ng9gn3ohZUBuoqSWeH4J8MxWElp.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nJeffrey Michael Tambor (born July 8, 1944) is an American actor, perhaps best known for his roles as George Bluth Sr. and Oscar Bluth on Arrested Development and Hank Kingsley on The Larry Sanders Show.\n\nDescription above from the Wikipedia article Jeffrey Tambor, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1944-07-08"},{"name":"Michael Paré","photos":[{"url":"http://image.tmdb.org/t/p/original/g1cVLWWAgl3J1nNFhg67qXs8GUT.jpg"}],"biography":"Michael Kevin Paré (born October 9, 1958) is an American actor. Description above from the Wikipedia article Michael Paré, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1958-10-09"},{"name":"Alex Borstein","photos":[{"url":"http://image.tmdb.org/t/p/original/2cXAomdqdd3PsgHcobS2JsF1gTa.jpg"},{"url":"http://image.tmdb.org/t/p/original/2cXAomdqdd3PsgHcobS2JsF1gTa.jpg"},{"url":"http://image.tmdb.org/t/p/original/oV5qWA6263qgQtEqu01EnnbLLEj.jpg"},{"url":"http://image.tmdb.org/t/p/original/AjthMjh7k3MqaZBgrenhm13Uxf6.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nAlexandrea \"Alex\" Borstein (born February 15, 1973) is an American actress, singer, voice actress, writer and comedian. She is best known for her long-running role as Lois Griffin on the animated television series Family Guy, and as a cast member on the sketch comedy series MADtv.\n\nA native of Highland Park, Illinois, Borstein is a graduate of San Francisco State University, where she studied rhetoric. She was trained in improvisational comedy at the ACME Comedy Theatre, near Hollywood, California, and was selected to join MADtv after being scouted by talent agents who noticed her work at the theatre. She was a writer and voice actor for several television shows, including Casper, Pinky and the Brain and Power Rangers: Zeo, before joining the cast of MADtv as a featured player, and later as a repertory player in 1997.\n\nAs an actress, she has made appearances in such films as The Lizzie McGuire Movie, Catwoman and Dinner for Schmucks.\n\nDescription above from the Wikipedia article Alex Borstein, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1971-02-15"},{"name":"Roynald Aji P","photos":[],"biography":null,"birthday":null},{"name":"Alba Rohrwacher","photos":[{"url":"http://image.tmdb.org/t/p/original/tfhqbny6xRlHNBbyL9Jai5KDb2B.jpg"}],"biography":null,"birthday":null},{"name":"Clint Howard","photos":[{"url":"http://image.tmdb.org/t/p/original/fIaMzJ5qbInzseGGjZi57Rx7Gv3.jpg"},{"url":"http://image.tmdb.org/t/p/original/fIaMzJ5qbInzseGGjZi57Rx7Gv3.jpg"},{"url":"http://image.tmdb.org/t/p/original/d9QW5feIgNwDRdkKK1j7gmmOQXT.jpg"}],"biography":"​From Wikipedia, the free encyclopedia\n\nClinton \"Clint\" Howard (born April 20, 1959) is an American film and television actor. He is a character actor with numerous brief appearances on television and films, usually noted for his unusual appearance. He has played many bit parts in movies directed by his brother, actor-turned-director Ron Howard. He is also the uncle of actress Bryce Dallas Howard\n.\nDescription above from the Wikipedia article Clint Howard, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1959-04-20"},{"name":"Scott Plank","photos":[],"biography":"From Wikipedia, the free encyclopedia\n\nScott Plank (November 11, 1958 — October 24, 2002) was an American film and television actor, best known for playing Nick Reardon on Melrose Place, and as Wiley Farrell on Air America.\n\nDescription above from the Wikipedia article Scott Plank, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1958-11-11"},{"name":"Matt Long","photos":[{"url":"http://image.tmdb.org/t/p/original/b3ittJNh8NfvwkgfcoiSimHD3Xq.jpg"},{"url":"http://image.tmdb.org/t/p/original/x7Wy5xRl7EzNME1h6xb0sm3A7I3.jpg"},{"url":"http://image.tmdb.org/t/p/original/b3ittJNh8NfvwkgfcoiSimHD3Xq.jpg"},{"url":"http://image.tmdb.org/t/p/original/a62ssMJgPK0ZLfw7eHhroFsVd9T.jpg"}],"biography":"From Wikipedia, the free encyclopedia\n\nMatthew Clayton \"Matt\" Long (born May 18, 1980) is an American actor. He played the teenaged Jack McCallister on Jack & Bobby, the younger Johnny Blaze in Ghost Rider, and Tyler Prince in Sydney White.\n\nLong was born in Winchester, Kentucky. He has one younger sibling, Zac. He attended Western Kentucky University where he met his wife, Lora Chaffins. He was also a member of Sigma Alpha Epsilon fraternity. After graduation, Long moved to New York City where he worked as an actor throughout various theaters. He now resides in Hollywood, California.\n\nDescription above from the Wikipedia article Matt Long, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1980-05-18"},{"name":"Richard B. Shull","photos":[{"url":"http://image.tmdb.org/t/p/original/eDosLV4XIsZoARHm77evMPACHUs.jpg"},{"url":"http://image.tmdb.org/t/p/original/1WNdROQsEfl9yjsvGFyRCiP4q3N.jpg"}],"biography":null,"birthday":"1929-02-24"},{"name":"Aimi Satsukawa","photos":[{"url":"http://image.tmdb.org/t/p/original/i0vP2GXQnVqm1wceSxb2uwBRxLW.jpg"},{"url":"http://image.tmdb.org/t/p/original/s0LrKKMzjgJaewlAQS2pxzqsvck.jpg"}],"biography":null,"birthday":null},{"name":"Marco Rossetti","photos":[],"biography":null,"birthday":null},{"name":"Sarah Drew","photos":[{"url":"http://image.tmdb.org/t/p/original/kK4EDmOyOAfn2V8Q61R5phiaZMm.jpg"},{"url":"http://image.tmdb.org/t/p/original/uK6gHEeN58XEj9KdR8VLQ7GyoLP.jpg"}],"biography":"Sarah Drew is an actress.","birthday":"1980-10-01"},{"name":"Darick Robertson","photos":[],"biography":null,"birthday":null},{"name":"Willem Dafoe","photos":[{"url":"http://image.tmdb.org/t/p/original/4Wuww8ORt6nrHyBSUBLTHWt24EZ.jpg"},{"url":"http://image.tmdb.org/t/p/original/a9BHgl7HC29h6CDZ5Nmfv1rYwlq.jpg"},{"url":"http://image.tmdb.org/t/p/original/kCOph07H7xLfM9mNNLZQHXi4DkI.jpg"},{"url":"http://image.tmdb.org/t/p/original/9hZUHbgfqOu8ooJjmn3fxlgkRlj.jpg"},{"url":"http://image.tmdb.org/t/p/original/4hwc84Q2dl1kWYpr56pIjlVe56a.jpg"}],"biography":"Willem Dafoe (born July 22, 1955) is an American film, stage, and voice actor, and a founding member of the experimental theatre company The Wooster Group. He has had roles in a wide range of films, including Streets of Fire, To Live and Die in L.A., Platoon, Born on the Fourth of July, The English Patient, The Last Temptation of Christ, Mississippi Burning, Wild at Heart, The Boondock Saints, Inside Man, The Life Aquatic with Steve Zissou, Spider-Man, Shadow of the Vampire, The Aviator, American Psycho, Antichrist, and voice roles in Fantastic Mr. Fox and Finding Nemo.\n\nDafoe has been nominated for the Academy Award for Best Supporting Actor twice. The first was for his role in Platoon in 1986 and the second time for his performance in Shadow of the Vampire in 2000.\n\nDescription above from the Wikipedia article Willem Dafoe, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1955-07-22"},{"name":"Peter Cushing","photos":[{"url":"http://image.tmdb.org/t/p/original/iFE9Xi5B0eZcNFqvCx78UUzmUfI.jpg"},{"url":"http://image.tmdb.org/t/p/original/45Kj30LzM0dYMJXqqCxXNzSzKl2.jpg"},{"url":"http://image.tmdb.org/t/p/original/7yZ2HfonKyGG7Oq0CCbE4mRZqyr.jpg"},{"url":"http://image.tmdb.org/t/p/original/7yZ2HfonKyGG7Oq0CCbE4mRZqyr.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nPeter Wilton Cushing, OBE  (26 May 1913 – 11 August 1994) was an English actor, known for his many appearances in Hammer Films, in which he played Baron Frankenstein and Dr. Van Helsing, amongst many other roles, often appearing opposite Christopher Lee, and occasionally Vincent Price. A familiar face on both sides of the Atlantic, his most famous roles outside of \"Hammer Horror\" include his many appearances as Sherlock Holmes, as Grand Moff Tarkin in Star Wars (1977) and as the mysterious Doctor Who in Doctor Who and the Daleks and Daleks - Invasion Earth 2150 AD in 1965 and 1966, two cinema films based on the television series Doctor Who.\n\nDescription above from the Wikipedia article Peter Cushing, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1913-05-26"},{"name":"Chris Hemsworth","photos":[{"url":"http://image.tmdb.org/t/p/original/2zY86WDlmCQKH4yJYvZvY8S1tyk.jpg"},{"url":"http://image.tmdb.org/t/p/original/lGio1EwNzzzyOLJC2uriCIB8ykp.jpg"},{"url":"http://image.tmdb.org/t/p/original/dnJBzh5uF1EbXp6de8Jq3sHrK1V.jpg"},{"url":"http://image.tmdb.org/t/p/original/AmDEfrcKEsFxlxeLGdlkltFgsri.jpg"},{"url":"http://image.tmdb.org/t/p/original/gXTQlQLkUiLgdcfeCAfvNW7RocQ.jpg"}],"biography":"Chris Hemsworth (born 11 August 1983) is an Australian actor.\n\nHe played the role of Kim Hyde in the Australian soap opera Home and Away and the titular character in the Marvel Studios film, Thor. Hemsworth will portray Thor again in the upcoming film The Avengers. Description above from the Wikipedia article Chris Hemsworth, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1983-08-11"},{"name":"Carla Gugino","photos":[{"url":"http://image.tmdb.org/t/p/original/rEnVfc4Xb0M5T1QvtN1k2xJ8RbX.jpg"},{"url":"http://image.tmdb.org/t/p/original/72fz51l5P8HTnp1eHZCEwfBDQVa.jpg"},{"url":"http://image.tmdb.org/t/p/original/efxx1M11Yop7ilvzHDPNyItm9Cs.jpg"},{"url":"http://image.tmdb.org/t/p/original/ooN6QGIddjFlkisvJI3Dh29ObPU.jpg"},{"url":"http://image.tmdb.org/t/p/original/qe83QXEfwETlVPmQQgsDWw3e9v2.jpg"},{"url":"http://image.tmdb.org/t/p/original/wVTVni6Rjc358KWQe8m8cFJE9vi.jpg"},{"url":"http://image.tmdb.org/t/p/original/ok5tNuxGzrnz4lQhHQ71AqmKfdH.jpg"},{"url":"http://image.tmdb.org/t/p/original/kx3tdvvEYEKizBKdEY7eT9SCEYo.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nCarla was born in Sarasota, Florida. Moved with her mother to Paradise, California, when Carla was just five years old. During her childhood, they moved many times within the state. But she remained a straight-A student throughout high school and graduated as valedictorian. A major modeling agency discovered Carla in San Diego and sent her to New York to begin a new career when she was 15. New York was more than she could handle at that young age, so she returned to LA in the summer, modeling and enrolling in an acting class at the suggestion of her aunt, Carol Merrill, known from \"Let's Make a Deal\" (1963). During her free time, Carla enjoys yoga, traveling and spending time with her friends in Los Angeles.\n\nDescription above from the Wikipedia article Carla Gugino, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1971-08-29"},{"name":"Robert Redford","photos":[{"url":"http://image.tmdb.org/t/p/original/b4mJIBWvEyzB8yyZWbmvfzwrdtp.jpg"},{"url":"http://image.tmdb.org/t/p/original/pFtyzWLs8W8IsUaJ9fVoG8SkBlG.jpg"},{"url":"http://image.tmdb.org/t/p/original/yrmON5mOxDG71u3g1XOVkMNP7KW.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nCharles Robert Redford Jr. (born August 18, 1936), better known as Robert Redford, is an American actor, film director, producer, businessman, model, environmentalist, philanthropist, and founder of the Sundance Film Festival. He has received two Oscars: one in 1981 for directing Ordinary People, and one for Lifetime Achievement in 2002. His popular films include Butch Cassidy and the Sundance Kid (1969), Jeremiah Johnson (1972), The Candidate (1972), The Sting (1973), The Way We Were (1973), The Great Gatsby (1974), Three Days of the Condor (1975), All the President's Men (1976), The Natural (1984), Out of Africa (1985), and Sneakers (1992). As a filmmaker, his notable films include Ordinary People (1980), A River Runs Through It (1992), Quiz Show (1994), The Horse Whisperer (1998), and The Legend of Bagger Vance (2000).\n\nDescription above from the Wikipedia article Robert Redford, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1937-08-18"},{"name":"Emily Blunt","photos":[{"url":"http://image.tmdb.org/t/p/original/A3fiIXjP1xvDn4fESU2Hl7pfmuL.jpg"},{"url":"http://image.tmdb.org/t/p/original/mqK8zWWDODcaaphXRpz4U8I5WcV.jpg"},{"url":"http://image.tmdb.org/t/p/original/4Yax0mGuITudQ6EbZAqKol2GFka.jpg"},{"url":"http://image.tmdb.org/t/p/original/6jtmPECVIvTcKDgE1GOcwedhr3q.jpg"},{"url":"http://image.tmdb.org/t/p/original/437gWQ7WmMZOu3ceDRMlKRSkKiM.jpg"},{"url":"http://image.tmdb.org/t/p/original/muGK6IYJeCIwTLoCrpnKUTKFqAx.jpg"},{"url":"http://image.tmdb.org/t/p/original/a3ZrlD3ROnAvXICiaFNIaq2sIg5.jpg"},{"url":"http://image.tmdb.org/t/p/original/du654Sfcusv9p12RVhQCmcHyjq.jpg"},{"url":"http://image.tmdb.org/t/p/original/aXei1zPPcPp0OQFVIDLp3ZvmIjU.jpg"},{"url":"http://image.tmdb.org/t/p/original/9WFG8gMMgGyqPhUCU542KWS1UxM.jpg"},{"url":"http://image.tmdb.org/t/p/original/gnftbELprg060rLwg2RCV2nukoJ.jpg"},{"url":"http://image.tmdb.org/t/p/original/4nagstkhNGJZIzR0VAv3g18cwtN.jpg"},{"url":"http://image.tmdb.org/t/p/original/1IKBjSp8xoCt0mmGZ43uwnUjOvl.jpg"},{"url":"http://image.tmdb.org/t/p/original/j20DfiJ8H94PqWXDDTSy76Ofe4M.jpg"},{"url":"http://image.tmdb.org/t/p/original/64NYKwTjUeJTHTHFPEAq8lfo8nz.jpg"},{"url":"http://image.tmdb.org/t/p/original/A7w50CGbOhjI4smJ928OIXeZbH.jpg"},{"url":"http://image.tmdb.org/t/p/original/9s6AjsKBO0ANSDGVnPvgfdsOq2n.jpg"},{"url":"http://image.tmdb.org/t/p/original/5EurU6Q6IlG9ZaSJf6PdFRTT8DH.jpg"},{"url":"http://image.tmdb.org/t/p/original/1IBijog64yAOw4BtpEnT7PaV0aD.jpg"},{"url":"http://image.tmdb.org/t/p/original/xFiEGT2qqOp3tbzEBh95Iz7XOTE.jpg"},{"url":"http://image.tmdb.org/t/p/original/xMdR0SSgFlrm2rc3hf3DpEGANzD.jpg"},{"url":"http://image.tmdb.org/t/p/original/5Ac6Lfc5Emxad0P1C5MNw0MxQF4.jpg"},{"url":"http://image.tmdb.org/t/p/original/rbJY7jdfDiUqdkldBd60kz55Maj.jpg"},{"url":"http://image.tmdb.org/t/p/original/bClXjYrFoTQOJ6fcEmZjei26fZ6.jpg"},{"url":"http://image.tmdb.org/t/p/original/jNmOb3U32wUGbylaB3i2FdZgZHp.jpg"},{"url":"http://image.tmdb.org/t/p/original/knRL48UuuwSNEJqL1zdveF2fx5k.jpg"},{"url":"http://image.tmdb.org/t/p/original/1tZjC2OE01rtxKH67KuIHPsQcoD.jpg"},{"url":"http://image.tmdb.org/t/p/original/vn83Omm8cyb21KAp38wYh4Vug4d.jpg"},{"url":"http://image.tmdb.org/t/p/original/e88CvENEkYzb7yNNZ6uhESmCEbs.jpg"},{"url":"http://image.tmdb.org/t/p/original/vg5b2J9yD6K2JxgrnNtuMJlAJ2Z.jpg"},{"url":"http://image.tmdb.org/t/p/original/feG3yfzqMSrfd3lYll8o18oPGv9.jpg"},{"url":"http://image.tmdb.org/t/p/original/paXiQrb3bEF8n7CMCbNaGaJ5ULE.jpg"},{"url":"http://image.tmdb.org/t/p/original/tC0qTPWh3B4vzcxoyMeGhnTNCZZ.jpg"},{"url":"http://image.tmdb.org/t/p/original/iGFzmqYykR1MoNGBPXFrtfEjwOQ.jpg"},{"url":"http://image.tmdb.org/t/p/original/lFwSCMx8oygCuRG16QS9IeczvQR.jpg"},{"url":"http://image.tmdb.org/t/p/original/wvgFVWQziDuKnxiNWWaR1ZRHj9p.jpg"},{"url":"http://image.tmdb.org/t/p/original/b2plBm23KKm743419IuU90PEjTl.jpg"},{"url":"http://image.tmdb.org/t/p/original/4iWyWOkgYWWYuuMqryf0QhfnNaV.jpg"},{"url":"http://image.tmdb.org/t/p/original/aFrSFG1tW0EPDNNFXBszFf6TPBX.jpg"},{"url":"http://image.tmdb.org/t/p/original/dRkn4VGzlHy0gihzdbMTZIONvpO.jpg"},{"url":"http://image.tmdb.org/t/p/original/lxjKWCkkdTB5YpXvh4hQ754o2VM.jpg"},{"url":"http://image.tmdb.org/t/p/original/v9qYFOUbyQc427vWWL6JOYWTIwU.jpg"},{"url":"http://image.tmdb.org/t/p/original/cOZhbiA7cXfNy847ZgwcezG5bpl.jpg"},{"url":"http://image.tmdb.org/t/p/original/bNmfR2u2DgtDUlN2zjg9vx2IaE8.jpg"},{"url":"http://image.tmdb.org/t/p/original/3UyR8u1deccSwoJUqgNaworUu7L.jpg"},{"url":"http://image.tmdb.org/t/p/original/80BRI3svoCI6BEcS6VFPulW0AFH.jpg"},{"url":"http://image.tmdb.org/t/p/original/8N7s8OPqvP2lT8w2W8FzdxnwAVm.jpg"},{"url":"http://image.tmdb.org/t/p/original/3yZudHcyvBxAtQBL5wFZkUZhPhT.jpg"}],"biography":"Emily Olivia Leah Blunt (born 23 February 1983) is an English actress. Blunt's first major film role came in the British drama My Summer of Love (2004). She then appeared in The Devil Wears Prada (2006) for which she was nominated for a Golden Globe and a BAFTA. She has since appeared in a number of American and British productions, including Charlie Wilson's War (2007), The Young Victoria (2009), The Wolfman (2010), Wild Target (2010), and The Adjustment Bureau (2011).\n\nIn 2007, Blunt won a Golden Globe Award for her performance in the 2005 BBC television film Gideon's Daughter.","birthday":"1983-02-23"},{"name":"Elsa Lanchester","photos":[{"url":"http://image.tmdb.org/t/p/original/2iuHeYDsEEzDScdvYOrIY673Q5N.jpg"},{"url":"http://image.tmdb.org/t/p/original/hTeBNBxPHJZniFe7CSKbPFjuBvi.jpg"},{"url":"http://image.tmdb.org/t/p/original/8Z8nPhIfcyEtrU4mwmwpYIMhHYi.jpg"},{"url":"http://image.tmdb.org/t/p/original/8Z8nPhIfcyEtrU4mwmwpYIMhHYi.jpg"}],"biography":"​From Wikipedia, the free encyclopedia.\n\nElsa Sullivan Lanchester  (28 October 1902 – 26 December 1986) was an English-American character actress with a long career in theatre, film and television.\nLanchester studied dance as a child and after the First World War began performing in theatre and cabaret, where she established her career over the following decade. She met the actor Charles Laughton in 1927, and they were married two years later. She began playing small roles in British films, including the role of Anne of Cleves with Laughton in The Private Life of Henry VIII (1933). Laughton's success in American films resulted in the couple moving to Hollywood, where Lanchester played small film roles.\nHer role as the bride in Bride of Frankenstein (1935), brought her recognition, and came to be one of the roles most closely associated with her throughout her life. Lanchester played supporting roles through the 1940s and 1950s. She was nominated for the Academy Award for Best Supporting Actress for Come to the Stable (1949) and Witness for the Prosecution (1957), the last of twelve films in which she appeared with Laughton. Following Laughton's death in 1962, Lanchester resumed her career with appearances in such Disney films as Mary Poppins (1964), That Darn Cat! (1965) and Blackbeard's Ghost (1968). The horror film, Willard, (1971) was highly successful and one of her last roles was in Murder By Death (1976).\n\nDescription above from the Wikipedia article Elsa Lanchester, licensed under CC-BY-SA, full list of contributors on Wikipedia","birthday":"1902-10-28"},{"name":"Russell Crowe","photos":[{"url":"http://image.tmdb.org/t/p/original/784nHLVWdenOyVkrZEbNLLOpU5a.jpg"},{"url":"http://image.tmdb.org/t/p/original/ktuOAyUHM2u2YPPChH8gAArxJ7b.jpg"},{"url":"http://image.tmdb.org/t/p/original/k4LmSjEuW43i96LDwr8J4OvTo75.jpg"},{"url":"http://image.tmdb.org/t/p/original/sfW4uCAonXAGOjUUeSj4fFmhEFk.jpg"},{"url":"http://image.tmdb.org/t/p/original/24vfC8rV4V87aUJK70vZ1LFLYWS.jpg"},{"url":"http://image.tmdb.org/t/p/original/mM2idgQvN0VmxV7RP1gDjNuz587.jpg"},{"url":"http://image.tmdb.org/t/p/original/8yIKdodT4tpZirpxcnSXpwdnvEu.jpg"},{"url":"http://image.tmdb.org/t/p/original/rE3AJ7hI3UDq7AW7WvFRCPkSyR9.jpg"},{"url":"http://image.tmdb.org/t/p/original/6HdXiJQA3V4ukADzq9hUIFuFsJ1.jpg"}],"biography":"Russell Ira Crowe (born 7 April 1964) is a New Zealand-born Australian actor and musician. His acting career began in the late 1980s with roles in Australian television series including Police Rescue and Neighbours. In the early 1990s, Crowe's local prominence peaked when he won the Australian Film Industry Award for Best Actor for his portrayal of an inner-city skinhead in the Geoffrey Wright film, Romper Stomper. In the late 1990s, Crowe transferred his acting ambitions to the USA with his breakout role in L.A. Confidential (1997). Crowe won the Academy Award for Best Actor for Gladiator in 2001 and has received three Academy Award nominations for Best Actor in a Leading Role: The Insider (1999), Gladiator (2000) and A Beautiful Mind (2001). He is also co-owner of National Rugby League team the South Sydney Rabbitohs.\n\nDescription above from the Wikipedia article Russell Crowe, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1964-04-07"},{"name":"Jude Law","photos":[{"url":"http://image.tmdb.org/t/p/original/4077Cyuo1mw53u1gNjLyQkqeZN0.jpg"},{"url":"http://image.tmdb.org/t/p/original/yzVboK3mSpWRr39EXBlYTo4ndcn.jpg"},{"url":"http://image.tmdb.org/t/p/original/zj6HehQ644tui3jnTMevSU8FahB.jpg"}],"biography":"David Jude Heyworth Law (born 29 December 1972), known professionally as Jude Law, is an English actor, film producer and director.\n\nHe began acting with the National Youth Music Theatre in 1987, and had his first television role in 1989. After starring in films directed by Andrew Niccol, Clint Eastwood and David Cronenberg, he was nominated for the Academy Award for Best Supporting Actor in 1999 for his performance in Anthony Minghella's The Talented Mr. Ripley. In 2000 he won a Best Supporting Actor BAFTA Award for his work in the film. In 2003, he was nominated for the Academy Award for Best Actor for his performance in another Minghella film, Cold Mountain.\n\nIn 2006, he was one of the top ten most bankable movie stars in Hollywood. In 2007, he received an Honorary César and he was named a Chevalier of the Ordre des Arts et des Lettres by the French government. In April 2011, it was announced that he would be a member of the main competition jury at the 2011 Cannes Film Festival.\n\nDescription above from the Wikipedia article Jude Law, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1972-12-29"},{"name":"Bryan Cranston","photos":[{"url":"http://image.tmdb.org/t/p/original/9dvZ0Id5RtnCGianoayNJBFrNVU.jpg"},{"url":"http://image.tmdb.org/t/p/original/kp3Cb0zOZcG5L3tSEYrARSIVg7S.jpg"},{"url":"http://image.tmdb.org/t/p/original/cw8lXm8lBRhIlTzE4cjrso8BvKt.jpg"},{"url":"http://image.tmdb.org/t/p/original/r7lIrYTLyXjj9BNjSvVKKwXyeqq.jpg"},{"url":"http://image.tmdb.org/t/p/original/qXWgFCk4OJqmLRUBEj7cbp8dnkx.jpg"},{"url":"http://image.tmdb.org/t/p/original/rzcDn4V8WDq9N8q1VQlJce1zlhX.jpg"},{"url":"http://image.tmdb.org/t/p/original/vpZLuRqLYMqebXtkaq0PI1yVgXM.jpg"}],"biography":"Bryan Lee Cranston (born March 7, 1956) is an American actor, voice actor, writer and director.\n\nHe is perhaps best known for his roles as Hal, the father in the Fox situation comedy \"Malcolm in the Middle\", and as Walter White in the AMC drama series Breaking Bad, for which he has won three consecutive Outstanding Lead Actor in a Drama Series Emmy Awards. Other notable roles include Dr. Tim Whatley on Seinfeld, Doug Heffernan's neighbor in The King of Queens, Astronaut Buzz Aldrin in From the Earth to the Moon, and Ted Mosby's boss on How I Met Your Mother. Description above from the Wikipedia article Bryan Cranston, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1956-03-07"},{"name":"Erik Estrada","photos":[{"url":"http://image.tmdb.org/t/p/original/l3kWJbNFMaxRtN4F6J6P2KqoCNg.jpg"},{"url":"http://image.tmdb.org/t/p/original/l3kWJbNFMaxRtN4F6J6P2KqoCNg.jpg"},{"url":"http://image.tmdb.org/t/p/original/5KEwyCj4BvKGXDFmNgTZJE8qNSS.jpg"},{"url":"http://image.tmdb.org/t/p/original/sjnMAkWUYioDkHVKZAuhxLA2qMt.jpg"}],"biography":null,"birthday":"1949-03-16"},{"name":"Jessica Stroup","photos":[{"url":"http://image.tmdb.org/t/p/original/jEdzGM493u3a7GSZdXmW4Gk1L5f.jpg"},{"url":"http://image.tmdb.org/t/p/original/aLtrnzBSPAR3hYkSCbiQGg4Jbmm.jpg"},{"url":"http://image.tmdb.org/t/p/original/30JedNf9vBlCqDRoAyEGf3HFHum.jpg"},{"url":"http://image.tmdb.org/t/p/original/bcvBwGi9XsjD1xS7jS5kOztDyRk.jpg"},{"url":"http://image.tmdb.org/t/p/original/yRBUPPMSGLb4ytud3MG6WKIPT87.jpg"},{"url":"http://image.tmdb.org/t/p/original/yGEnpUFFDhcOKKbML4rL5K6OGgz.jpg"},{"url":"http://image.tmdb.org/t/p/original/1ZaWQGGTMZHyJw47qn1rq5awKXg.jpg"}],"biography":"From Wikipedia, the free encyclopedia.  Jessica Leigh Stroup (born October 23, 1986) is an American actress and fashion model. Stroup is best known for her role as Erin Silver on The CW television series 90210, a spin-off to the original Beverly Hills, 90210. She is also known for starring in such feature length films such as Prom Night and The Hills Have Eyes 2.\n\nDescription above from the Wikipedia article Jessica Stroup, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1986-10-23"},{"name":"Emma Stone","photos":[{"url":"http://image.tmdb.org/t/p/original/gKa8QO8h9ld2kgw2QfyXjoKxM8c.jpg"},{"url":"http://image.tmdb.org/t/p/original/dcBFknIkihfBDzuqXS9X0J2mFeM.jpg"},{"url":"http://image.tmdb.org/t/p/original/9K1GePA2pOAQva6MoFkib8CXudL.jpg"},{"url":"http://image.tmdb.org/t/p/original/lPyR5mKhdqFmgxaCMJK6w3g1OAT.jpg"},{"url":"http://image.tmdb.org/t/p/original/9LIDJoI7s27BEQqGCnA5lVantjq.jpg"},{"url":"http://image.tmdb.org/t/p/original/cpLX7O6rzoIYjKbCTq09c1HB8Dh.jpg"},{"url":"http://image.tmdb.org/t/p/original/vN18GVPHssvxQZBCoNE4ub0N3ON.jpg"},{"url":"http://image.tmdb.org/t/p/original/A0gSS7DIUKqWyqMSEbZEqfWZ0Fl.jpg"},{"url":"http://image.tmdb.org/t/p/original/uSWjNjAfUVIvvkPHoEncYJhcMAk.jpg"},{"url":"http://image.tmdb.org/t/p/original/3drfsC0vIgRlq6aQdPs9q57773L.jpg"},{"url":"http://image.tmdb.org/t/p/original/jUMGHUSGbIXqrWNJhm18svXdOTa.jpg"},{"url":"http://image.tmdb.org/t/p/original/6d6tJqBqBmy6ypYdH6307Ke33f.jpg"},{"url":"http://image.tmdb.org/t/p/original/m15JPu2PnKZEkUdbjl6UOYfIbJT.jpg"},{"url":"http://image.tmdb.org/t/p/original/vIeMk0uuAhOxMtY0HSDjSYKzXyA.jpg"},{"url":"http://image.tmdb.org/t/p/original/nAQmzCNybyFgEYocboyhr2diCHG.jpg"},{"url":"http://image.tmdb.org/t/p/original/hfxExEqcrkGbNH092WGpTRk5BhG.jpg"},{"url":"http://image.tmdb.org/t/p/original/1EoLUc6SSE9ZuAw7ppMHLXyNRxL.jpg"},{"url":"http://image.tmdb.org/t/p/original/xaVbkdhLThQZ5rQr1PCLzAgCEeB.jpg"},{"url":"http://image.tmdb.org/t/p/original/lvi04zEbs2WQXADN1x8bTMrGvbd.jpg"},{"url":"http://image.tmdb.org/t/p/original/hPmoMB8E5NfTj4PUiZmM60k05mV.jpg"},{"url":"http://image.tmdb.org/t/p/original/kN6imSZuWp8clvdMWmi9U7yUqjj.jpg"}],"biography":"Emily Jean \"Emma\" Stone is an American actress best known for her deadpan acting style, husky voice, and red hair. Having been born in Arizona she dropped out of high school at age 15 to move to Hollywood and pursue acting. Though naturally a blonde her first role ever was landed after dying her hair brunette and eventually red by director Judd Apatow for her breakout role in Superbad. Her notable low voice is a side effect from incessant screaming as a baby.","birthday":"1988-11-06"},{"name":"Jean-Claude Van Damme","photos":[{"url":"http://image.tmdb.org/t/p/original/aqZ9RjL5j44HMlBMvTaawhHiGOH.jpg"},{"url":"http://image.tmdb.org/t/p/original/hAl5RFgKQNXXYNn6ZXoBQzg4AjG.jpg"},{"url":"http://image.tmdb.org/t/p/original/t9to1GoMzx7IDSBXwzwe1huakFk.jpg"},{"url":"http://image.tmdb.org/t/p/original/91tnydZkMMFyc98BF3AqlSYFKRA.jpg"},{"url":"http://image.tmdb.org/t/p/original/xnBB7HoPfp4t7FUffFxQrRPYPOp.jpg"},{"url":"http://image.tmdb.org/t/p/original/gkPsUV5i4Bwfizpj2g4g4uMp3cC.jpg"},{"url":"http://image.tmdb.org/t/p/original/34KPd7QKcOtp7bxIZhg7LOMwvnR.jpg"},{"url":"http://image.tmdb.org/t/p/original/rkNB7VpGEdLILWEYcMIaPGvntQe.jpg"}],"biography":"Jean-Claude Camille François Van Varenberg (born 18 October 1960), professionally known as Jean-Claude Van Damme , is a Belgian martial artist and actor. Van Damme is best known for his martial arts action movies. His most successful films include Bloodsport (1988), Kickboxer (1989), Double Impact (1991), Universal Soldier (1992), Hard Target (1993), Timecop (1994), and JCVD (2008). Due to his physique and his Belgian background, he is known as \"The Muscles from Brussels.\"\n\nAfter studying martial arts intensively from the age of ten, Van Damme achieved national success in Belgium as a martial artist and bodybuilder, earning the \"Mr. Belgium\" bodybuilding title. He emigrated to the United States in 1982 to pursue a career in film, and achieved success with Bloodsport (1988), based on a story written by Frank Dux. He attained subsequent box office success with Timecop (1994), which grossed over $100 million worldwide and became his most financially successful film.\n\nDescription above from the Wikipedia article Jean-Claude Van Damme, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1960-10-18"},{"name":"Idina Menzel","photos":[{"url":"http://image.tmdb.org/t/p/original/s2AjAX3qr0cZpfEdiEyYko9SGrZ.jpg"},{"url":"http://image.tmdb.org/t/p/original/ofTM4E0KENBiNCG3EoohDnFY5k3.jpg"},{"url":"http://image.tmdb.org/t/p/original/xaa9SLB1QpddvvdZoQMGWOuheIv.jpg"},{"url":"http://image.tmdb.org/t/p/original/mNcCJqo4uboEaI5VTMvYOj8enOz.jpg"},{"url":"http://image.tmdb.org/t/p/original/lzCTPQycO0ONyudofNS5xjs7Ah0.jpg"},{"url":"http://image.tmdb.org/t/p/original/fLO2HPuNvHTMqem94X6O6g9DlHh.jpg"},{"url":"http://image.tmdb.org/t/p/original/2Ewq6VBvNetFyLVxytacNbAa6I1.jpg"},{"url":"http://image.tmdb.org/t/p/original/cBVCPQYFr3Ke4apnVfM3uhvicZI.jpg"}],"biography":"Idina Menzel (/ɪˈdiːnə mɛnˈzɛl/; born Idina Kim Mentzel; May 30, 1971) is an American actress, singer, and songwriter. She rose to prominence for her performance as Maureen Johnson in the Broadway musical Rent, a role which she reprised for the 2005 feature film adaptation. In 2004, she won the Tony Award for originating the role of Elphaba in the Broadway blockbuster Wicked. In 2014, she will be returning to Broadway in the musical If/Then. Menzel is also known for her portrayal of Shelby Corcoran, the biological mother of Lea Michele's character Rachel Berry, on the Fox musical comedy-drama series Glee, and as the voice of snow queen Elsa in the Disney animated film, Frozen.","birthday":"1971-05-30"},{"name":"H.M. Wynant","photos":[],"biography":"From Wikipedia, the free encyclopedia.\n\nH.M. Wynant (born February 12, 1927 in Detroit, Michigan) is an American film and television actor.\n\nAmong his many television credits are appearances on shows such as Playhouse 90, Hawaiian Eye, The Wild Wild West, Perry Mason, Gunsmoke, Get Smart, Hawaii Five-O, Mission: Impossible, and Dallas.\n\nOne of his more memorable appearances was in the Twilight Zone episode \"The Howling Man\". Decades later, he would return to \"TZ\" for a number of radio productions...including \"Of Late I Think of Cliffordville\", in which he filled the Albert Salmi role.\n\nAmong his film credits are Run Silent, Run Deep, Marlowe, and Conquest of the Planet of the Apes.\n\nDescription above from the Wikipedia article H.M. Wynant, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1927-02-12"},{"name":"Ross Elliott","photos":[{"url":"http://image.tmdb.org/t/p/original/tYEwSVPt29T6vd1lYNM3dRiehP0.jpg"}],"biography":null,"birthday":"1917-06-18"},{"name":"Philippe Noiret","photos":[{"url":"http://image.tmdb.org/t/p/original/cxqfBaHzXOOMVcxHYfAewhG2Cjc.jpg"},{"url":"http://image.tmdb.org/t/p/original/vyan44aMVh7itZvZKQk4rW18oki.jpg"},{"url":"http://image.tmdb.org/t/p/original/vyan44aMVh7itZvZKQk4rW18oki.jpg"}],"biography":"​From Wikipedia, the free encyclopedia.  \n\nPhilippe Noiret (born 1 October 1930 in Lille – died 23 November 2006 in Paris) was a French film actor.\n\nDescription above from the Wikipedia article Philippe Noiret, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1930-10-01"},{"name":"Rick Rosenthal","photos":[],"biography":"​From Wikipedia, the free encyclopedia.  \n\nRichard L. \"Rick\" Rosenthal, Jr. (born June 15, 1949) is an American film and television director. He is also a producer, actor, and writer.\n\nDescription above from the Wikipedia article Rick Rosenthal, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1949-06-15"},{"name":"Jodie Foster","photos":[{"url":"http://image.tmdb.org/t/p/original/eAIE6bnOQ8rm0f933gyeAQdIwrP.jpg"},{"url":"http://image.tmdb.org/t/p/original/9M6PpoJGwjhTantETojfFDc3VhW.jpg"},{"url":"http://image.tmdb.org/t/p/original/t88DxzYA7DlthxluhPLHXV69iJW.jpg"},{"url":"http://image.tmdb.org/t/p/original/1sKXTLNzd1gx7n6eqsqxAhAfk05.jpg"},{"url":"http://image.tmdb.org/t/p/original/ICuiQphW88Gr8XWfJnexxIDkOb.jpg"},{"url":"http://image.tmdb.org/t/p/original/1Pnd0CWGGgfHed5Dqom3qJdoPIr.jpg"},{"url":"http://image.tmdb.org/t/p/original/n6vTOEjDQ57RayEnKKRFJ1IsKyS.jpg"},{"url":"http://image.tmdb.org/t/p/original/4dBNWtdTREN5JfW4VAJvLZbrDtG.jpg"}],"biography":"Alicia Christian \"Jodie\" Foster (born November 19, 1962) is an American actress, film director, producer as well as being a former child actress.\n\nFoster began acting in commercials at three years of age, and her first significant role came in the 1976 film Taxi Driver as the preteen prostitute Iris for which she received a nomination for the Academy Award for Best Supporting Actress. Also that year, she starred in the cult film The Little Girl Who Lives Down the Lane. She won an Academy Award for Best Actress in 1989 for playing a rape survivor in The Accused. In 1991, she starred in The Silence of the Lambs as Clarice Starling, a gifted FBI trainee, assisting in a hunt for a serial killer. This performance received international acclaim and her second Academy Award for Best Actress. She received her fourth Academy Award nomination for playing a hermit in Nell (1994). Other popular films include Maverick (1994), Contact (1997), Panic Room (2002), Flightplan (2005), Inside Man (2006), The Brave One (2007), and Nim's Island (2008).\n\nFoster's films have spanned a wide variety of genres, from family films to horror. In addition to her two Academy Awards she has won two BAFTA Awards for three films, two Golden Globe Awards, a Screen Actors Guild Award, a People's Choice Award, and has received two Emmy nominations.\n\nDescription above from the Wikipedia article Jodie Foster, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1962-11-19"},{"name":"James Woods","photos":[{"url":"http://image.tmdb.org/t/p/original/fl5Jx1WFvBcg1b9VZRfXTH6LPUE.jpg"},{"url":"http://image.tmdb.org/t/p/original/2aVqoPKl4iPACRahajk3sg8nH0.jpg"},{"url":"http://image.tmdb.org/t/p/original/elruqgVseCnWk9tcPTVyIpEX5oj.jpg"},{"url":"http://image.tmdb.org/t/p/original/r3mS6TujsgIqV4j9Y7xtfCbmvrV.jpg"}],"biography":"James Howard Woods (born April 18, 1947) is an American film, stage and television actor. Woods is known for starring in critically acclaimed films such as Once Upon a Time in America, Salvador, Nixon, Ghosts of Mississippi, Casino, Hercules, and in the television legal drama Shark. He has won two Emmy Awards, and has gained two Academy Award nominations.\n\nDescription above from the Wikipedia article James Woods, licensed under CC-BY-SA, full list of contributors on Wikipedia","birthday":"1947-04-18"},{"name":"Robert Downey Jr.","photos":[{"url":"http://image.tmdb.org/t/p/original/iDtxXJXmJGU7jYRjsvePNQblHV1.jpg"},{"url":"http://image.tmdb.org/t/p/original/8fYa7iCeaPzkeTlmuZdBU1be8q5.jpg"},{"url":"http://image.tmdb.org/t/p/original/1UfsBig3mugwCMyPfbZWQ2n7egN.jpg"},{"url":"http://image.tmdb.org/t/p/original/zY5osf94NzImi2FoqSQvdSb0SQz.jpg"},{"url":"http://image.tmdb.org/t/p/original/o6ffyv7CYsEVpdd4jkmYT7y41Xn.jpg"},{"url":"http://image.tmdb.org/t/p/original/r9EIfIEXCzuhUiofdT6U4Vi1zZ1.jpg"},{"url":"http://image.tmdb.org/t/p/original/xIVHvRVYQgo31clG6cDJSO09F1P.jpg"},{"url":"http://image.tmdb.org/t/p/original/9TpkdIizG9QH92fz8RFgTjIDJFW.jpg"},{"url":"http://image.tmdb.org/t/p/original/yFLaHBE3vFLtj6fz3nCLKyRyxJc.jpg"},{"url":"http://image.tmdb.org/t/p/original/whPwAHm9eLTG3BONBOy1rWg5rHm.jpg"}],"biography":"Robert John Downey, Jr. (born April 4, 1965) is an American actor. Downey made his screen debut in 1970, at the age of five, when he appeared in his father's film Pound, and has worked consistently in film and television ever since. During the 1980s he had roles in a series of coming of age films associated with the Brat Pack. Less Than Zero (1987) is particularly notable, not only because it was the first time Downey's acting would be acknowledged by critics, but also because the role pushed Downey's already existing drug habit one step further. After Zero, Downey started landing roles in bigger films such as Air America (1990), Soapdish (1991) and Natural Born Killers (1994). He played Charlie Chaplin in the 1992 film Chaplin, for which he received an Academy Award nomination for Best Actor.\n\nBetween 1996 and 2001, Downey was frequently arrested on drug-related charges and went through several drug treatment programs, but had difficulty staying clean. After being released from the California Substance Abuse Treatment Facility and State Prison in 2000, Downey joined the cast of the hit television series Ally McBeal, playing the new love interest of Calista Flockhart's title character. His performance was praised and received accolades, but his character was written out when Downey was fired after two drug arrests in late 2000 and early 2001. After one last stay in a court-ordered drug treatment program, Downey finally achieved lasting sobriety and his career began to take off again. He appeared in semi-independent films such as The Singing Detective (2003), Kiss Kiss Bang Bang (2005), and A Scanner Darkly (2006). He also had supporting roles in the mainstream films Gothika (2003) and Zodiac (2007). In 2004, Downey released his debut studio album The Futurist.\n\nIn 2007, Downey was cast as the title character in the comic book adaptation Iron Man. The film was a huge success; the opening weekend for Iron Man is still in the top 20 openings of all time. He reprised the role of Tony Stark in the 2010 sequel, Iron Man 2, and will again in 2012 in The Avengers and in the third movie of the planned trilogy, Iron Man 3, due to open in 2013. In addition to receiving commercial success, Downey's performance in the first Iron Man film received rave reviews. Downey was nominated for—and won—a number of end-of-year awards from critics and film associations around the world. Downey's other 2008 films included Charlie Bartlett and the Ben Stiller-directed Tropic Thunder, in which he portrayed an Australian method actor overly engrossed in his role as an African-American soldier. He received his second Oscar nomination for the film, in the category of Best Supporting Actor. In 2009, Downey starred as the titular lead character in Guy Ritchie's adaptation of Sherlock Holmes, released Christmas 2009. Soon after, Downey won a Golden Globe for Best Performance by an Actor in a Motion Picture – Musical or Comedy for that portrayal of the famous detective","birthday":"1965-04-04"},{"name":"Mickey Rooney","photos":[{"url":"http://image.tmdb.org/t/p/original/bgCm55k2eo2YV5bMn3D0O4NPwU.jpg"},{"url":"http://image.tmdb.org/t/p/original/lYqmv7clPZE1m6lVHeRyZegU3hU.jpg"},{"url":"http://image.tmdb.org/t/p/original/enSAAl302HY7BR6nlDwS8eWQWGs.jpg"},{"url":"http://image.tmdb.org/t/p/original/zMU0esio9CECBXLUefFPmcNEsAL.jpg"}],"biography":"Mickey Rooney was born Joe Yule Jr. on September 23, 1920 in Brooklyn, New York. He first took the stage as a toddler in his parents vaudeville act at 17 months old. He made his first film appearance in 1926. The following year, he played the lead character in the first Mickey McGuire short film. It was in this popular film series that he took the stage name Mickey Rooney. Rooney reached new heights in 1937 with A Family Affair, the film that introduced the country to Andy Hardy, the popular all-American teenager. This beloved character appeared in nearly 20 films and helped make Rooney the top star at the box office in 1939, 1940 and 1941. Rooney also proved himself an excellent dramatic actor as a delinquent in Boys Town starring Spencer Tracy. In 1938, he was awarded a Juvenile Academy Award.\n\nTeaming up with Judy Garland, Rooney also appeared in a string of musicals, including Babes in Arms (1939) the first teenager to be nominated for an Oscar in a leading role, Strike up the Band (1940), Babes on Broadway (1941), and Girl Crazy (1943). He and Garland immediately became best of friends. \"We weren't just a team, we were magic,\" Rooney once said. During that time he also appeared with Elizabeth Taylor in the now classic National Velvet (1944). Rooney joined the service that same year, where he helped to entertain the troops and worked on the American Armed Forces Network. He returned to Hollywood after 21 months in Love Laughs at Andy Hardy (1946), did a remake of a Robert Taylor film, The Crowd Roars called Killer McCoy (1947) and portrayed composer Lorenz Hart in Words and Music (1948). He also appeared in Breakfast at Tiffany's (1961), starring Audrey Hepburn and George Peppard. Rooney played Hepburn's Japanese neighbor, Mr. Yunioshi. A sign of the times, Rooney played the part for comic relief which he later regretted feeling the role was offensive. He once again showed his incredible range in the dramatic role of a boxing trainer with Anthony Quinn and Jackie Gleason in Requiem for a Heavyweight (1962). In the late 1960s and 1970s Rooney showed audiences and critics alike why he was one of Hollywood's most enduring stars. He gave an impressive performance in Francis Ford Coppola's 1979 film The Black Stallion (1979), which brought him an Academy Award nomination as Best Supporting Actor. He also turned to the stage in 1979 in Sugar Babies with Ann Miller, and was nominated for a Tony Award. During that time he also portrayed the Wizard in The Wonderful Wizard of Oz with Eartha Kitt at New York's Madison Square Garden, which also had a successful run nationally.\n\nIn 2011 Rooney filed elder abuse and fraud charges against stepson Christopher Aber and Aber's wife. At Rooney's request, the Superior Court issued a restraining order against the Aber's demanding they stay 100 yards from Rooney, as well as Mickey's other son Mark Rooney and Mark's wife Charlene. Just prior, Rooney mustered the strength to break his silence and appeared before the Senate in Washington D.C. telling of his own heartbreaking story of abuse in an effort to live a peaceful, full life and help others who may be similarly suffering in silence. Rooney requested through the Superior Court to permanently reside with his son Mark Rooney and his wife Charlene in the Hollywood Hills. Rooney died on 6 April 2014, at age 93, surrounded by family at his home.","birthday":"1920-09-23"},{"name":"John Vernon","photos":[{"url":"http://image.tmdb.org/t/p/original/8jESb02RChcuBEh4yZrLHElNhWa.jpg"},{"url":"http://image.tmdb.org/t/p/original/ja7LrG75HzbpC1SRAPVmnZLRAK5.jpg"}],"biography":"From Wikipedia, the free encyclopedia.   John Keith Vernon (February 24, 1932 – February 1, 2005) was a Canadian actor. He made a career in Hollywood after achieving initial television stardom in Canada.\n\nDescription above from the Wikipedia article John Vernon, licensed under CC-BY-SA, full list of contributors on Wikipedia​","birthday":"1932-02-24"},{"name":"William Shatner","photos":[{"url":"http://image.tmdb.org/t/p/original/5hWNPFmnzlFAkGMleBKkeFFcxhY.jpg"},{"url":"http://image.tmdb.org/t/p/original/iYzPixojcg3lfAXk0UIKlw8JEyd.jpg"},{"url":"http://image.tmdb.org/t/p/original/e4qWzxBNDd9dkM4WbYB2mhG2pxN.jpg"},{"url":"http://image.tmdb.org/t/p/original/3aUg5IVVBNDbz9Bc0M2Nv1idxzX.jpg"},{"url":"http://image.tmdb.org/t/p/original/qiUlhMfcbmfbDU4pkNdtCjDYfmp.jpg"},{"url":"http://image.tmdb.org/t/p/original/xLxdsfeIPuYuaTqFeJ8N4nzgyIM.jpg"},{"url":"http://image.tmdb.org/t/p/original/qiUlhMfcbmfbDU4pkNdtCjDYfmp.jpg"},{"url":"http://image.tmdb.org/t/p/original/tZdVt0p7ZCZ9yJhbBZpEwshM0yA.jpg"},{"url":"http://image.tmdb.org/t/p/original/sR2oVopsyl9PIJMEQRLcBVp8Dj0.jpg"}],"biography":"From Wikipedia, the free encyclopedia\n\nWilliam Shatner (born March 22, 1931) is a Canadian  actor, musician, singer, author, film director, spokesman and comedian.  He gained worldwide fame and became a cultural icon for his portrayal  of Captain James Tiberius Kirk, commander of the Federation starship USS Enterprise, in the science fiction television series Star Trek, from 1966 to 1969; Star Trek: The Animated Series from 1973 to 1974, and in seven of the subsequent Star Trek feature films from 1979 to 1994. He has written a series of books chronicling his experiences playing Captain Kirk and being a part of Star Trek, and has co-written several novels set in the Star Trek universe. He has also authored a series of science fiction novels called TekWar that were adapted for television.\n\nShatner also played the eponymous veteran police sergeant in T. J. Hooker from 1982 to 1986. Afterwards, he hosted the reality-based television series Rescue 911 from 1989 to 1996, which won a People's Choice Award for Favorite New TV Dramatic Series. He has since worked as a musician, author, director and celebrity pitchman. From 2004 to 2008, he starred as attorney Denny Crane in the television dramas The Practice and its spin-off Boston Legal, for which he won two Emmy Awards and a Golden Globe Award.","birthday":"1931-03-22"},{"name":"John Goodman","photos":[{"url":"http://image.tmdb.org/t/p/original/xPR75KEtYVPg6Bw3SYDW9mCE2Cb.jpg"},{"url":"http://image.tmdb.org/t/p/original/axjpVeHMRKECVZrSYVcbQgCDX83.jpg"}],"biography":"​American actor. Height 6' 2\" (1,88 m)\n\nJohn Goodman is most famous for his role on the television series Roseanne. He is also a well known film and stage actor. Goodman comes from Affton, Missouri where he showed an early interest in film. A football scholarship took John to Southwest Missouri State University where he continued his acting education. A college injury ended his football dreams, so Goodman moved to Manhattan in pursuit of an acting career. He eventually performed on Broadway and appeared in several commercials. \n\nBy the early 1980's John started landing small movie roles, including Eddie Macon's Run, and The Survivors (both in 1984). In 1990 Arachnophobia earned John a nomination for a Saturn Award for Best Supporting Actor. John then starred in the hugely popular 1998 film, The Big Lebowski which lead to a repeat nomination for Best Supporting Actor. Despite his moderate film success, Goodman is most widely know for playing Dan Conner on the TV sitcom Roseanne. Between 1988 and 1997, 221 episodes of Roseanne were filmed and John received numerous awards for his performance.\n\nGoodman met his wife, Annabeth Hartzog, while filming Everybody's All-American (1988). The two were married in October 1989, and had daughter Molly in 1990. John admits once having a long-time alcohol problem, but has reportedly been clean since 2007.","birthday":"1952-06-20"},{"name":"Chris Pratt","photos":[{"url":"http://image.tmdb.org/t/p/original/4VBM00eSdXB13yZpuGsJcCKrVLu.jpg"},{"url":"http://image.tmdb.org/t/p/original/jA82DNCgmLKFcZopJMKYO6WETqu.jpg"},{"url":"http://image.tmdb.org/t/p/original/n12NkhWrrhkAM2WmewegyL8HNXM.jpg"},{"url":"http://image.tmdb.org/t/p/original/cux3msHQIV0lZe2yv4ADupiZA4v.jpg"},{"url":"http://image.tmdb.org/t/p/original/2IShl97AIyC0MGNPM7rsoYDvkCR.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nChristopher Michael \"Chris\" Pratt (born June 21, 1979) is an American actor, best known for his roles as Harold Brighton \"Bright\" Abbott in the television series Everwood, the recurring character Winchester \"Ché\" Cook in season 4 of The OC, and Andy Dwyer in the television series Parks and Recreation.\n\nDescription above from the Wikipedia article Chris Pratt, licensed under CC-BY-SA, full list of contributors on Wikipedia","birthday":"1979-06-21"},{"name":"Eva Green","photos":[{"url":"http://image.tmdb.org/t/p/original/fWHlFfPHtKYn4ykWm9kniYh8EfA.jpg"},{"url":"http://image.tmdb.org/t/p/original/rwmLtchv0uwUYWSNbixY3GGELJ2.jpg"},{"url":"http://image.tmdb.org/t/p/original/yjpZowMIq8lIiidjl33usViwYeE.jpg"},{"url":"http://image.tmdb.org/t/p/original/neJuXBw4NJgRJFbbGheYoiqEaCC.jpg"},{"url":"http://image.tmdb.org/t/p/original/seNOWGhvdIHJD2c8eFLTgpcX3Og.jpg"}],"biography":"Eva Gaëlle Green, born on 5 July 1980, is a French actress, raised in Paris and living partly in London. She has been noted by Vogue for her \"killer looks, intelligence and modesty\", and described by The Independent as \"gothic, quirky, and sexy\".\n\nThe daughter of actress Marlène Jobert, Green performed in theatre before making her film debut in The Dreamers (2003), which generated controversy over her numerous nude scenes. She achieved greater fame for her parts in Kingdom of Heaven (2005), and in the 2006 James Bond film Casino Royale, for which she won a BAFTA. She has also modeled for numerous brands. Director Bernardo Bertolucci discovered Green in 2002, and found her \"so beautiful, it's indecent\". She accepted his invitation to star in The Dreamers (2003), despite her parents' initial objections because of Maria Schneider's accounts of being traumatized while filming Bertolucci's Last Tango in Paris. Green performed extensive nude scenes, which she said felt natural on set, although she was embarrassed when her family saw the film. Her performance was well received, with some comparing her to Liv Tyler. Her performance in The Dreamers convinced Ridley Scott to cast Green in Kingdom of Heaven (2005), a film about the Crusades where she played Sibylla of Jerusalem. Campbell saw Green's performance in the director's cut of Kingdom of Heaven, and Green was approached again. She read the script, and found the character of Vesper far deeper than most Bond girls. Green's performance was well received: Entertainment Weekly called her the fourth best Bond girl of all time; IGN named her the best femme fatale, stating \"This is the girl that broke — and therefore made — James Bond\"; and she won a BAFTA and an Empire award for her performance. Both were voted for by the British public.\n\nGreen lives alone, jokingly referring to her border terrier, Griffin, as her \"husband\". She is an atheist, having not been raised to follow any religion. She has dated New Zealand actor Marton Csokas since she met him on the set of Kingdom of Heaven. Green's favourite film is Cries and Whispers, and she is a fan of directors François Truffaut, Ingmar Bergman, Tim Burton, Lars von Trier, David Lynch, and David Fincher. She admires the actresses Lauren Bacall, Marlene Dietrich, Bette Davis, Jeanne Moreau, Cate Blanchett, Juliette Binoche, and Helena Bonham Carter. She credits Blanchett and Kirsten Dunst as her fashion influences, describing her own taste as, \"bright pink lipstick, hot pink or geisha colors. Make up is allowed to be a bit weird, I feel.\"Her favourite artists are Gustav Klimt and Egon Schiele, and she is a keen museum visitor; she particularly likes Chinese and Indian architecture, and framed displays of butterflies and other insects. Green enjoys music, listening to film soundtracks and classical music when preparing for roles, and she plays the piano.","birthday":"1980-07-05"},{"name":"Melora Hardin","photos":[{"url":"http://image.tmdb.org/t/p/original/uecs9JKOqgYj3PrSGECaFzc3E2r.jpg"},{"url":"http://image.tmdb.org/t/p/original/gztAfnhqjefq2LXgID91BTzIgJY.jpg"}],"biography":"Melora Diane Hardin (born June 29, 1967) is an American actress, best known for her roles as Jan Levenson on NBC's The Office and Trudy Monk on USA's Monk.\n\nDescription above from the Wikipedia article Melora Hardin, licensed under CC-BY-SA, full list of contributors on Wikipedia.​","birthday":"1967-06-29"},{"name":"Kristen Dalton","photos":[{"url":"http://image.tmdb.org/t/p/original/hJE14DbGUWXVQHUxdIClpEcUfFo.jpg"},{"url":"http://image.tmdb.org/t/p/original/xoZTVakQx7sNtASfksfAfPfzamr.jpg"},{"url":"http://image.tmdb.org/t/p/original/ichi8dHIGs8Wp6Asv9urwZZuMHp.jpg"},{"url":"http://image.tmdb.org/t/p/original/xoZTVakQx7sNtASfksfAfPfzamr.jpg"}],"biography":null,"birthday":"1966-02-14"},{"name":"Kevin Costner","photos":[{"url":"http://image.tmdb.org/t/p/original/ybwfOhuuDPJ6NCcX7Y5XJxE6nMs.jpg"},{"url":"http://image.tmdb.org/t/p/original/gRbHrKrrTrQ0FBp1o7fvpItiWmf.jpg"},{"url":"http://image.tmdb.org/t/p/original/mTtkagFG0OWqr6GMwVmAnQc8maF.jpg"},{"url":"http://image.tmdb.org/t/p/original/cu05ZtB64N8I6CAT2eoZFBrJWbq.jpg"},{"url":"http://image.tmdb.org/t/p/original/4QvYaFMvbqTUIwOdceOser089EG.jpg"},{"url":"http://image.tmdb.org/t/p/original/ePo87kGyyY8JZ3z7Zm7Z2GYdmJ8.jpg"}],"biography":"Kevin Michael Costner (born January 18, 1955) is an American actor, singer, musician, producer, director, and businessman. He has been nominated for three BAFTA (British Academy of Film and Television Arts) Awards, won two Academy Awards, and two Golden Globe Awards. Costner's roles include Lt. John J. Dunbar in the film Dances with Wolves, Jim Garrison in JFK, Ray Kinsella in Field of Dreams, Robin Hood in Robin Hood: Prince of Thieves, Crash Davis in Bull Durham, Robert \"Butch\" Haynes in A Perfect World and Eliot Ness in The Untouchables. Costner also founded the band Modern West, and has performed with the band since 2007.\n\nDescription above from the Wikipedia article Kevin Costner, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1955-01-18"},{"name":"Neville Brand","photos":[{"url":"http://image.tmdb.org/t/p/original/oqHFJx2CUOLuZU3l1acZWUDFlVN.jpg"},{"url":"http://image.tmdb.org/t/p/original/tTLqiCL0M4ni0fhlRh8353ynbXw.jpg"}],"biography":"From Wikipedia, the free encyclopedia.  \n\nNeville Brand (August 13, 1920 - April 16, 1992) was an American television and movie actor.\n\nDescription above from the Wikipedia article Neville Brand  licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1920-08-13"},{"name":"John Hurt","photos":[{"url":"http://image.tmdb.org/t/p/original/rpuH2YRLpxJjMxHq4T1QdOSVtlN.jpg"},{"url":"http://image.tmdb.org/t/p/original/xX2NJBIowO0dzhIqpUGlZu3w8GM.jpg"},{"url":"http://image.tmdb.org/t/p/original/zUQ7WL3xg9C532Aa8hftcJUnk9j.jpg"},{"url":"http://image.tmdb.org/t/p/original/tW6cOElGBdJl8nNrHwL6gvxvdkI.jpg"},{"url":"http://image.tmdb.org/t/p/original/60qICr00nEWMc8rFwVJXATM0k5G.jpg"},{"url":"http://image.tmdb.org/t/p/original/jiYIkTdIkH9BO0W4sSj3wNBfr1c.jpg"}],"biography":"John Vincent Hurt, CBE (born 22 January 1940) is an English actor, known for his leading roles as John Merrick in The Elephant Man, Winston Smith in Nineteen Eighty-Four, Mr. Braddock in The Hit, Stephen Ward in Scandal and Quentin Crisp in The Naked Civil Servant, Caligula in the television series, I, Claudius (TV series), and An Englishman in New York. Recognizable for his distinctive rich voice, he has also enjoyed a successful voice acting career, starring in films such as Watership Down, The Lord of the Rings and Dogville, as well as BBC television series Merlin. Hurt initially came to prominence for his role as Richard Rich in the 1966 film A Man for All Seasons, and has since appeared in such popular motion pictures as: Alien, Midnight Express, Rob Roy, V for Vendetta, Indiana Jones and the Kingdom of the Crystal Skull, the Harry Potter film series and the Hellboy film series. Hurt is one of England's best-known, most prolific and sought-after actors, and has had a versatile film career spanning six decades. He is also known for his many Shakespearean roles. Hurt has received multiple awards and honours throughout his career including three BAFTA Awards and a Golden Globe Award, with six and two nominations respectively, as well as two Academy Award nominations. His character's final scene in Alien is consistently named as one of the most memorable in cinematic history.\n\nDescription above from the Wikipedia article John Hurt , licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1940-01-22"},{"name":"Anthony Stewart Head","photos":[{"url":"http://image.tmdb.org/t/p/original/17LzSGKGZElKVZZ51TIAMvHtQKJ.jpg"},{"url":"http://image.tmdb.org/t/p/original/xVz9Rbj6xTZQHHYn36qMT8sKMHG.jpg"},{"url":"http://image.tmdb.org/t/p/original/cDQeLUU0rTJ7Vlqnd1EaNdN4T6D.jpg"},{"url":"http://image.tmdb.org/t/p/original/cAw2ccfdWWczjhy428zzofNWUIU.jpg"},{"url":"http://image.tmdb.org/t/p/original/rAkrqv4z6ZCxGbyrBthppx4ZFyU.jpg"},{"url":"http://image.tmdb.org/t/p/original/1JuwQ6rvk1CAsV6FIe9XnJuGOi5.jpg"}],"biography":"From Wikipedia, the free encyclopedia.  Anthony Stewart Head (born 20 February 1954), usually credited as Anthony Head, is an English actor and musician. He rose to fame in the UK following his role in television advertisements for Nescafé Gold Blend (Taster's Choice in the U.S.), and is known for his roles as Rupert Giles in Buffy the Vampire Slayer and as Uther Pendragon in Merlin.\n\nDescription above from the Wikipedia article Anthony Head, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1954-02-20"},{"name":"Elke Sommer","photos":[{"url":"http://image.tmdb.org/t/p/original/eVx7RyK6FCBb1HZEdyx5UacL0Df.jpg"},{"url":"http://image.tmdb.org/t/p/original/ponLwZMM5EhqOyVeOJlXHzRfVXj.jpg"},{"url":"http://image.tmdb.org/t/p/original/53wE4WxSkTYVw0PtDPS9xDpejHX.jpg"},{"url":"http://image.tmdb.org/t/p/original/gdp3FqowRiMfdQlfybUta0dBmEl.jpg"},{"url":"http://image.tmdb.org/t/p/original/69ObnM88hYf7ykYAlwyQSeljC5R.jpg"},{"url":"http://image.tmdb.org/t/p/original/lgBJPHzpWhlEzcU6NNkmy3m0Ygm.jpg"},{"url":"http://image.tmdb.org/t/p/original/vTL5YvORAcLezE6GxUaTDuQaFFH.jpg"},{"url":"http://image.tmdb.org/t/p/original/t1uSwluZaHahN533IKVQV6jVla3.jpg"},{"url":"http://image.tmdb.org/t/p/original/xvM7Chy65VaOXBSm7IAtYbQoFvx.jpg"},{"url":"http://image.tmdb.org/t/p/original/1q6aTfFT3SaOTs1pPWhzwmoC1HO.jpg"},{"url":"http://image.tmdb.org/t/p/original/vvPQU6X8qp35BD5xuzkfb39eK5n.jpg"},{"url":"http://image.tmdb.org/t/p/original/gIsKJjVmU5XiBIPCpbC103GJD4f.jpg"},{"url":"http://image.tmdb.org/t/p/original/7RVF7eN9qGgwZXzzBNtEUGNdQVy.jpg"},{"url":"http://image.tmdb.org/t/p/original/a5VnWcKKUCZdYCyz6TKee76FiWL.jpg"},{"url":"http://image.tmdb.org/t/p/original/9xXaGKz6LWr599JhYtOd0hyqqTD.jpg"},{"url":"http://image.tmdb.org/t/p/original/7pvxDZDzpQ4RNkX8PxrgkvidhjC.jpg"},{"url":"http://image.tmdb.org/t/p/original/ulxfaSUDgWkAhXYCMUm1gy9FYc1.jpg"},{"url":"http://image.tmdb.org/t/p/original/2CZHhms1ChRzJwi03f3HzKoPP3W.jpg"},{"url":"http://image.tmdb.org/t/p/original/7pvxDZDzpQ4RNkX8PxrgkvidhjC.jpg"}],"biography":"From Wikipedia, the free encyclopedia.\n\nElke Sommer (born 5 November 1940), born Elke Schletz, is a German-born actress, entertainer and artist.\n\nDescription above from the Wikipedia article Elke Sommer, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1940-11-05"},{"name":"John Cusack","photos":[],"biography":"John Paul Cusack (born June 28, 1966 - Height: 6' 2½\" (1,89 m)) is an American film actor and screenwriter. He has appeared in more than 50 films, including The Journey of Natty Gann, Say Anything..., Grosse Point Blank, Con Air, High Fidelity, and 2012.\n\nCusack was born in Evanston, Illinois, to a Catholic Irish-American family. His mother, Ann Paula \"Nancy\" (née Carolan), is a former mathematics teacher and political activist. His father, Richard Cusack (1925–2003), was an actor, as are John's siblings, Ann, Joan, Bill, and Susie. His father was also a documentary filmmaker, owned a film production company, and was a friend of activist Philip Berrigan.\n\nCusack spent a year at New York University before dropping out, saying that he had \"too much fire in [his] belly\".\n\nCusack is a fan of both the Chicago Cubs and the Chicago White Sox, for which, he says, he is \"in trouble there\". He has led the crowd in a performance of \"Take Me Out to the Ball Game\" at Wrigley Field. He has also been spotted at multiple Chicago Bears games, and attended many of the Stanley Cup Finals games in support of the Chicago Blackhawks.\n\nCusack has trained in kickboxing for over 20 years, under former world kickboxing champion Benny Urquidez. He began training under Urquidez in preparation for his role in Say Anything... and currently holds the rank of a level 6 black belt in Urquidez's Ukidokan Kickboxing system.\n\nDescription above from the Wikipedia article John Cusack, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1966-06-28"},{"name":"Anthony Wong","photos":[{"url":"http://image.tmdb.org/t/p/original/pCwuQUam6Xy8AhFddQFKYa74xGQ.jpg"},{"url":"http://image.tmdb.org/t/p/original/ihc7PjuziqKWMdbF46GV5hdmnj6.jpg"}],"biography":"​From Wikipedia, the free encyclopedia.  \n\nAnthony Wong Chau-sang (born Anthony Perry on September 2, 1961) is a Hong Kong Film Award-winning Hong Kong actor, screenwriter and film director. He is regarded as one of the most notable actors in Hong Kong.\n\nDescription above from the Wikipedia article  Anthony Wong Chau-sang, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1961-09-02"},{"name":"Samuel L. Jackson","photos":[{"url":"http://image.tmdb.org/t/p/original/dlW6prW9HwYDsIRXNoFYtyHpSny.jpg"},{"url":"http://image.tmdb.org/t/p/original/teciwVY9DIDNyCuYybKgrebF8bC.jpg"},{"url":"http://image.tmdb.org/t/p/original/o9zwZifKGRc30YtemMX6b0Gfi44.jpg"},{"url":"http://image.tmdb.org/t/p/original/ylrCWQp6OwmSxVW3EoP4huYX3YJ.jpg"},{"url":"http://image.tmdb.org/t/p/original/nbYPSDKhsLQOY0bxJlLvlkIDo1D.jpg"},{"url":"http://image.tmdb.org/t/p/original/bnRcZj31vRfpwrmEaus9o0PudlT.jpg"}],"biography":"Samuel Leroy Jackson (born December 21, 1948) is an American film and television actor and film producer. After Jackson became involved with the Civil Rights Movement, he moved on to acting in theater at Morehouse College, and then films. He had several small roles such as in the film Goodfellas, Def by Temptation, before meeting his mentor, Morgan Freeman, and the director Spike Lee. After gaining critical acclaim for his role in Jungle Fever in 1991, he appeared in films such as Patriot Games, Amos &amp; Andrew, True Romance and Jurassic Park. In 1994 he was cast as Jules Winnfield in Pulp Fiction, and his performance received several award nominations and critical acclaim.\n\nJackson has since appeared in over 100 films including Die Hard with a Vengeance, The 51st State, Jackie Brown, Unbreakable, The Incredibles, Black Snake Moan, Shaft, Snakes on a Plane, as well as the Star Wars prequel trilogy and small roles in Quentin Tarantino's Kill Bill Vol. 2 and Inglourious Basterds. He played Nick Fury in Iron Man and Iron Man 2, Thor, the first two of a nine-film commitment as the character for the Marvel Cinematic Universe franchise. Jackson's many roles have made him one of the highest grossing actors at the box office. Jackson has won multiple awards throughout his career and has been portrayed in various forms of media including films, television series, and songs. In 1980, Jackson married LaTanya Richardson, with whom he has one daughter, Zoe.\n\nDescription above from the Wikipedia article Samuel L. Jackson, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1948-12-21"},{"name":"Chiwetel Ejiofor","photos":[{"url":"http://image.tmdb.org/t/p/original/fwaEgwYJdzGyBmGcHiH13vobQii.jpg"},{"url":"http://image.tmdb.org/t/p/original/pEZ1uCbgOBFxTRuK1OpCryb3voj.jpg"},{"url":"http://image.tmdb.org/t/p/original/borZexFtEufagwzL8VZVE0RvISG.jpg"}],"biography":"Chiwetelu Umeadi \"Chiwetel\" Ejiofor, born on 10 July 1977 in Forest Gate, London. He attended London Academy of Music and Dramatic Art, but had to leave after a year after receiving the roll of Ens, in Steven Spielberg's historical drama, \"Amistad\". For his first leading film role in Dirty Pretty Things, he won a British Independent Film Award for best actor. He has portrayed Othello in numerous stage productions including Bloomsbury Theatre, Theatre Royal in Glasgow and Donmar Warehouse. He made his directorial debut in the short film Slapper, which he also wrote. He soon became well known after moving on to bigger roles in \"Inside Man\" (2005), \"American Gangster\"(2007), \"Children of Men\" and Steve McQueen's \"12 Years a Slave\"(2012).","birthday":"1977-07-10"},{"name":"Gaspard Ulliel","photos":[],"biography":"​From Wikipedia, the free encyclopedia.  \n\nGaspard Ulliel (born 25 November 1984) is a French film actor. He began appearing in made-for-television films during the late 1990s and early 2000s, and then began to be known as a film actor in France, as well as starring in the title role in the thriller Hannibal Rising.\n\nDescription above from the Wikipedia article Gaspard Ulliel, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1984-11-25"}]